#include "dlls/engine/18_objfsa.h"
#include "dlls/engine/33_BaddieControl.h"
#include "dlls/engine/6_amsfx.h"
#include "dlls/objects/common/sidekick.h"
#include "dlls/objects/210_player.h"
#include "game/gamebits.h"
#include "game/objects/interaction_arrow.h"
#include "game/objects/object_id.h"
#include "sys/gfx/animseq.h"
#include "sys/objects.h"
#include "sys/objprint.h"
#include "sys/objtype.h"
#include "dll.h"
#include "macros.h"

typedef void (*SomeCallback)(Gfx**, Mtx**, Vertex**, Triangle**, s32, Object*);

typedef struct {
/*00*/ SomeCallback unk0;
/*04*/ s32 unk4;
/*08*/ f32 unk8;
/*0C*/ s8 unkC;
/*0D*/ u8 unkD;
/*10*/ f32 unk10;
/*14*/ u8 unk14;
} GuardClaw_Data;

/*0x0*/ static u32 data_0[] = {
    SOUND_35F_GuardClaw_Step, 
    SOUND_360_GuardClaw_Step2, 
    SOUND_35E_SharpClaw_Staff_Swing
};
/*0xC*/ static u32 data_C[] = {
    SOUND_35D_GuardClaw_Yawn, 
    SOUND_361_GuardClaw_Go_Away, 
    SOUND_366_GuardClaw_Rawr, 
    SOUND_367_GuardClaw_SharpClaw_Only, 
    SOUND_362_GuardClaw_Hah, 
    SOUND_363_GuardClaw_Hey_You, 
    SOUND_365_GuardClaw_Come_Here
};
/*0x28*/ static s32 data_28[] = { // hitAnimStateMap
/*0*/ 9, 
/*1*/ 9, 
/*2*/ 9, 
/*3*/ 8, 
/*4*/ 9, 
/*5*/ 8, 
/*6*/ 9, 
/*7*/ 8, 
/*8*/ 9, 
/*9*/ 8, 
/*10*/ 9, 
/*11*/ 8, 
/*12*/ 9, 
/*13*/ 8, 
/*14*/ 0, 
/*15*/ 8, 
/*16*/ 9, 
/*17*/ 8, 
/*18*/ 9, 
/*19*/ 8, 
/*20*/ 9, 
/*21*/ 8, 
/*22*/ 8, 
/*23*/ 9, 
/*24*/ 8, 
/*25*/ 8, 
/*26*/ 8, 
/*27*/ 8
};
/*0x98*/ static s8 data_98[] = { // hitDamageMap
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0, 
    0, 0, 0, 0
};
/*0xB4*/ static u32 data_B4[] = {
    0x00000000, 0x00000000, 0x00000000, 
    0x41c80000, 0x00000000, 0x00000000, 
    0x00000000
};

/*0x0*/ static ObjFSA_StateCallback bss_0[14];
/*0x38*/ static ObjFSA_StateCallback bss_38[4];

static int GuardClaw_anim_callback(Object* actor, Object* animObj, AnimObj_Data* animObjData, s8);

static void GuardClaw_func_1128(Object* self, Baddie* baddie, ObjFSA_Data* fsa);
static void GuardClaw_func_1520(Object* self, Baddie* baddie, ObjFSA_Data* fsa);
static void GuardClaw_func_C34(Object* self, Baddie* baddie, ObjFSA_Data* fsa, s32 arg3);
static void GuardClaw_func_D80(Object* self, Baddie* baddie, ObjFSA_Data* fsa);

static s32 GuardClaw_func_1760(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 GuardClaw_func_17E0(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 GuardClaw_func_1860(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 GuardClaw_func_191C(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 GuardClaw_func_1AD4(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 GuardClaw_func_1C8C(Object* self, ObjFSA_Data* fsa, f32 updateRate);
