//"NWmammoth.c" seems to have been Rare's name!

#include "PR/gbi.h"
#include "PR/os.h"
#include "PR/ultratypes.h"
#include "dll.h"
#include "dlls/engine/26_curves.h"
#include "dlls/engine/6_amsfx.h"
#include "dlls/objects/214_animobj.h"
#include "dlls/objects/227_tumbleweed.h"
#include "game/gamebits.h"
#include "game/objects/object.h"
#include "sys/gfx/model.h"
#include "sys/main.h"
#include "sys/math.h"
#include "sys/objects.h"
#include "sys/objhits.h"
#include "sys/objtype.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/print.h"
#include "sys/rand.h"
#include "functions.h"
#include "types.h"
#include "segment_334F0.h"

s32 func_80031BBC(f32, f32, f32);
s32 func_80032538(Object* self);
void joy_set_button_mask(int port, u16 mask);

enum SnowHornAnims {
    MODANIM_SnowHorn_Idle = 0,
    MODANIM_SnowHorn_Talk = 2,
    MODANIM_SnowHorn_Walk = 3,
    MODANIM_SnowHorn_Sleep_Intro = 4,
    MODANIM_SnowHorn_Sleep = 5,
    MODANIM_SnowHorn_Wake_Up = 6,
    MODANIM_SnowHorn_Hit_React = 47
};

enum SnowHornTutorialSequences {
    SEQ_0157_SnowHorn_Chat_BeforeDefeatingSharpClaw = 0, //Hmph, shouldn't you help your friend?
    SEQ_0157_SnowHorn_Chat_BeforeDiggingUpRoot = 1, //I'm too hungry to talk to strangers!
    SEQ_0158_SnowHorn_Chat_AfterDiggingUpRoot = 2, //If you press the C-right button you can feed me that root!
    SEQ_0159_SnowHorn_Cutscene_FeedingRoot1 = 3, //One root is never enough, I'm starving! To get out of the clearing...
    SEQ_0625_SnowHorn_Chat_AfterEatingRoot1 = 4, //One root is never enough, I'm starving!
    SEQ_0248_SnowHorn_Cutscene_FeedingRoot2 = 5, //Ahh, that hit the spot! Tell you what, young 'un, I'll help you out!
    SEQ_0626_SnowHorn_Chat_AfterEatingRoot2 = 6  //I'm sorry lad, you're on your own now.
};

#define GARUNDA_TE_WEEDS_NEEDED 12

typedef struct {
/*000*/ s32 *unk0;
/*004*/ s16 unkRadius;
/*006*/ s16 unk6;
/*008*/ s16 unk8;
/*00A*/ s16 sleepTimer; //randomly-assigned value?
/*00c*/ u16 flags;
/*00e*/ u16 unkE; //yaw?
/*010*/ s32 unk10;
/*014*/ Vec3f playerPositionCopy;
/*020*/ f32 distanceFromPlayer;
/*024*/ s8 unk24;
/*025*/ s8 unk25;
/*026*/ s8 unk26;
/*027*/ s8 unk27;
/*028*/ Object* frostWeed;
/*02c*/ s16 unk2C;
/*02e*/ s16 unk2E;
/*030*/ s32 unk30;
/*034*/ s32 unk34;
/*038*/ s32 unk38;
/*03c*/ s32 unk3C;
/*040*/ s32 unk40;
/*044*/ s16* someAnimIDList;
/*048*/ f32* unk48;
/*04c*/ s32* chatSequenceList;
/*050*/ f32 unk50;
/*054*/ f32 unk54;
/*058*/ f32 walkSpeed; //has something to do with the struct at 0x60?
/*05C*/ s32 unk5C;
/*060*/ UnkCurvesStruct unk60;
/*168*/ s32 unk168;
/*16C*/ s32 unk16C;
/*170*/ DLL27_Data unk170;
/*3d0*/ s8 _unk3D0[0x3E0-0x3D0];
/*3e0*/ u32 unk3e0;
/*3e4*/ u32 unk3e4;
/*3e8*/ u32 unk3e8;
/*3ec*/ u32 unk3ec;
/*3f0*/ u32 unk3f0;
/*3f4*/ u32 unk3f4;
/*3f8*/ u32 unk3f8;
/*3fc*/ u32 unk3fc;
/*400*/ Unk80032CF8 lookAtUnk;
/*424*/ u8 unk424;
/*425*/ u8 unk425;
/*426*/ u8 unk426;
/*427*/ u8 unk427;
/*428*/ s8 garundaTe_weedsEaten;
/*429*/ s8 unk429;
/*42A*/ s8 unk42A;
/*42B*/ s8 unk42B;
// TODO: below is not part of this DLL objdata! where are these supposed to be? does something inherit this DLL?
// /*42C*/ f32 unk42C;
// /*42C*/ s8 unk430[0x16c];
// /*59c*/ s16 rEyeU;
// /*59e*/ s16 rEyeV;
// /*600*/ u32 unk600;
// /*604*/ u32 unk604;
// /*608*/ u32 unk608;
// /*60c*/ s16 lEyeU;
// /*60e*/ s16 lEyeV;
} SnowHorn_Data;

typedef struct{
/*0x10*/ ObjSetup base;
/*0x18*/ s16 unkRadius;
/*0x1A*/ s16 unk1A;
/*0x1C*/ s8 rotation;
/*0x1D*/ s8 unk1D;
} SnowHorn_Setup;

typedef struct {
/*000*/ s8 unk0[0x62];
/*062*/ s8 unk62;
/*063*/ s8 unk63;
/*064*/ s8 unk64[0x2A];
/*08E*/ u8 unk8E[10];
/*098*/ u8 unk98[10];
} UnkStruct2;

static const char _rodata_0[] = "MAM: curve setup failed\n";

static Unk80026DF4 _data_0[] = {
    {SOUND_377_Metal_Smack, NO_SOUND, 0x002f, 0x0030, 0x00,  0.012, 0.005},
    {SOUND_377_Metal_Smack, NO_SOUND, 0x002f, 0x0030, 0x00,  0.012, 0.005},
    {SOUND_377_Metal_Smack, NO_SOUND, 0x002a, 0x0030, 0x00,  0.011, 0.005},
    {SOUND_677_Metal_Clang, NO_SOUND, 0xffff, 0xffff, 0x01,  0.0, 0.0},
    {SOUND_377_Metal_Smack, NO_SOUND, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_377_Metal_Smack, NO_SOUND, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_377_Metal_Smack, NO_SOUND, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_377_Metal_Smack, NO_SOUND, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_677_Metal_Clang, NO_SOUND, 0xffff, 0xffff, 0x01,  0.0, 0.0},
    {SOUND_377_Metal_Smack, NO_SOUND, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_377_Metal_Smack, NO_SOUND, 0xffff, 0xffff, 0x00, 0.0, 0.0},
