//"NWmammoth.c" seems to have been Rare's name!

#include "PR/ultratypes.h"
#include "dll.h"
#include "dlls/objects/214_animobj.h"
#include "dlls/objects/227_tumbleweed.h"
#include "game/objects/object.h"
#include "sys/main.h"
#include "sys/objects.h"
#include "sys/objtype.h"
#include "sys/objanim.h"
#include "sys/print.h"
#include "sys/rand.h"
#include "variables.h"
#include "functions.h"
#include "types.h"

s32 func_800053B0(void*, f32);
s32 func_8002493C(void*, f32, void*);
s32 func_80026DF4(Object*, u32*, u32, s32, void*);
s32 func_80031BBC(f32, f32, f32);
s32 func_80032538(Object* self);
void func_800328F0(Object*, void*, f32);
void func_80032A08(Object*, void*);
s16* func_80034804(Object* obj, s32 sequenceBoneID);
s32* func_800348A0(Object*, s32, s32);
void set_button_mask(int port, u16 mask);

enum SnowHornAnims {
    MODANIM_SnowHorn_Idle = 0,
    MODANIM_SnowHorn_Talk = 2,
    MODANIM_SnowHorn_Walk = 3,
    MODANIM_SnowHorn_Sleep_Intro = 4,
    MODANIM_SnowHorn_Sleep = 5,
    MODANIM_SnowHorn_Wake_Up = 6,
    MODANIM_SnowHorn_Hit_React = 47
};

enum SnowHornTutorialSequences {
    SEQ_0157_SnowHorn_Chat_BeforeDefeatingSharpClaw = 0, //Hmph, shouldn't you help your friend?
    SEQ_0157_SnowHorn_Chat_BeforeDiggingUpRoot = 1, //I'm too hungry to talk to strangers!
    SEQ_0158_SnowHorn_Chat_AfterDiggingUpRoot = 2, //If you press the C-right button you can feed me that root!
    SEQ_0159_SnowHorn_Cutscene_FeedingRoot1 = 3, //One root is never enough, I'm starving! To get out of the clearing...
    SEQ_0625_SnowHorn_Chat_AfterEatingRoot1 = 4, //One root is never enough, I'm starving!
    SEQ_0248_SnowHorn_Cutscene_FeedingRoot2 = 5, //Ahh, that hit the spot! Tell you what, young 'un, I'll help you out!
    SEQ_0626_SnowHorn_Chat_AfterEatingRoot2 = 6  //I'm sorry lad, you're on your own now.
};

enum SnowHornGameBits {
    FLAG_Always_1 = 0x95,
    FLAG_Always_0 = 0x96,
    INVENTORY_Alpine_Root = 0x576,
    FLAG_SnowHorn_Tutorial_Defeated_SharpClaw = 0xD3,
    FLAG_SnowHorn_Tutorial_NumRootsFed = 0x578,
    FLAG_SnowHorn_Tutorial_GotAlpineRoot1 = 0x8E,
    FLAG_SnowHorn_Tutorial_GotAlpineRoot2 = 0x116,
    FLAG_Garunda_Te_Quest_Progress = 0x115,
    FLAG_Garunda_Te_NumFrostWeedsEaten = 0x48B,
    FLAG_SnowHorn_Unknown = 0x5A0, //Maybe intended to hide SnowHorn Wastes' minimap until SnowHorn gifts map?
    FLAG_DarkIce_Mines_Leap_of_Faith_Completed = 0x22B,
    FLAG_Tricky_Distract_Learned = 0x9E,
    FLAG_SpellStone_1_Activated = 0x123
};

#define GARUNDA_TE_WEEDS_NEEDED 12

typedef struct {
/*000*/ s32 *unk0;
/*004*/ s16 unkRadius;
/*006*/ s16 unk6;
/*008*/ s16 unk8;
/*00A*/ s16 sleepTimer; //randomly-assigned value?
/*00c*/ u16 flags;
/*00e*/ u16 unkE; //yaw?
/*010*/ s32 unk10;
/*014*/ Vec3f playerPositionCopy;
/*020*/ f32 distanceFromPlayer;
/*024*/ s8 unk24;
/*025*/ s8 unk25;
/*026*/ s8 unk26;
/*027*/ s8 unk27;
/*028*/ Object* frostWeed;
/*02c*/ s16 unk2C;
/*02e*/ s16 unk2E;
/*030*/ s32 unk30;
/*034*/ s32 unk34;
/*038*/ s32 unk38;
/*03c*/ s32 unk3C;
/*040*/ s32 unk40;
/*044*/ s16* someAnimIDList;
/*048*/ f32* unk48;
/*04c*/ s32* chatSequenceList;
/*050*/ f32 unk50;
/*054*/ s32 unk54;
/*058*/ f32 walkSpeed; //has something to do with the struct at 0x60?
/*05C*/ s32 unk5C;
/*060*/ UnkCurvesStruct60 unk60;
/*0E0*/ s32 unkE0;
/*0E4*/ s32 unkE4;
/*0E8*/ s32 unkE8;
/*0EC*/ s32 unkEC;
/*0F0*/ s32 unkF0;
/*0F4*/ s32 unkF4;
/*0F8*/ s32 unkF8;
/*0FC*/ s32 unkFC;
/*100*/ s32 unk100;
/*104*/ s32 unk104;
/*108*/ s32 unk108;
/*10C*/ s32 unk10C;
/*110*/ s32 unk110;
/*114*/ s32 unk114;
/*118*/ s32 unk118;
/*11C*/ s32 unk11C;
/*110*/ s32 unk120;
/*114*/ s32 unk124;
/*118*/ s32 unk128;
/*11C*/ s32 unk12C;
/*110*/ s32 unk130;
/*114*/ s32 unk134;
/*118*/ s32 unk138;
/*11C*/ s32 unk13C;
/*110*/ s32 unk140;
/*114*/ s32 unk144;
/*118*/ s32 unk148;
/*11C*/ s32 unk14C;
/*110*/ s32 unk150;
/*114*/ s32 unk154;
/*118*/ s32 unk158;
/*11C*/ s32 unk15C;
/*110*/ s32 unk160;
/*114*/ s32 unk164;
/*118*/ s32 unk168;
/*11C*/ s32 unk16C;
/*110*/ Vec3f* unk170;
/*114*/ s32 unk174;
/*118*/ Vec3f unk178[8]; //position samples/deltas - maybe for walk-related calculus?
/*1d8*/ s8 unk1d8[0x208];
/*3e0*/ u32 unk3e0;
/*3e4*/ u32 unk3e4;
/*3e8*/ u32 unk3e8;
/*3ec*/ u32 unk3ec;
/*3f0*/ u32 unk3f0;
/*3f4*/ u32 unk3f4;
/*3f8*/ u32 unk3f8;
/*3fc*/ u32 unk3fc;
/*400*/ s8 lookAtUnk;
/*401*/ s8 unk401;
/*402*/ s8 unk402;
/*403*/ s8 unk403;
/*404*/ f32 copyPlayerX;
/*408*/ f32 copyPlayerY;
/*40c*/ f32 copyPlayerZ;
/*410*/ f32 unk410;
/*414*/ f32 unk414;
/*418*/ f32 unk418;
/*41C*/ f32 unk41C;
/*420*/ f32 unk420;
/*424*/ u8 unk424;
/*425*/ u8 unk425;
/*426*/ u8 unk426;
/*427*/ u8 unk427;
/*428*/ s8 garundaTe_weedsEaten;
/*429*/ s8 unk429;
/*42A*/ s8 unk42A;
/*42B*/ s8 unk42B;
/*42C*/ f32 unk42C;
/*42C*/ s8 unk430[0x16c];
/*59c*/ s16 rEyeU;
/*59e*/ s16 rEyeV;
/*600*/ u32 unk600;
/*604*/ u32 unk604;
/*608*/ u32 unk608;
/*60c*/ s16 lEyeU;
/*60e*/ s16 lEyeV;
} SnowHornState;

typedef struct{
/*0x10*/ ObjCreateInfo base;
/*0x18*/ s16 unkRadius;
/*0x1A*/ s16 unk1A;
/*0x1C*/ s8 rotation;
/*0x1D*/ s8 unk1D;
}
SnowHornCreateInfo;

typedef struct {
/*000*/ s8 unk0[0x62];
/*062*/ s8 unk62;
/*063*/ s8 unk63;
/*064*/ s8 unk64[0x2A];
/*08E*/ u8 unk8E[10];
/*098*/ u8 unk98[10];
} UnkStruct2;

typedef struct {
s16 soundIDA;
s16 soundIDB;
s16 unk4;
s16 unk6;
s8 unk8; //Boolean: seems to choose between using DLL17 (particles) or DLL106 (modgfx)
f32 unkC;
f32 unk10;
} SnowHornData0;

static const char _rodata_0[] = "MAM: curve setup failed\n";

static SnowHornData0 _data_0[] = {
    {SOUND_377, SOUND_FFFF, 0x002f, 0x0030, 0x00,  0.012, 0.005},
    {SOUND_377, SOUND_FFFF, 0x002f, 0x0030, 0x00,  0.012, 0.005},
    {SOUND_377, SOUND_FFFF, 0x002a, 0x0030, 0x00,  0.011, 0.005},
    {SOUND_677, SOUND_FFFF, 0xffff, 0xffff, 0x01,  0.0, 0.0},
    {SOUND_377, SOUND_FFFF, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_377, SOUND_FFFF, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_377, SOUND_FFFF, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_377, SOUND_FFFF, 0xffff, 0xffff, 0x00,  0.0, 0.0},
    {SOUND_677, SOUND_FFFF, 0xffff, 0xffff, 0x01,  0.0, 0.0},
    {SOUND_377, SOUND_FFFF, 0xffff, 0xffff, 0x00,  0.0, 0.0},
