#ifndef _DLLS_210_H
#define _DLLS_210_H

#include "PR/ultratypes.h"
#include "dlls/engine/29_gplay.h"
#include "game/objects/object.h"
#include "dll_def.h"
#include "types.h"

typedef struct {
/*000*/ s32 unk0; //bitfield?
/*004*/ s8 unk4[0x48 - 0x4];
/*048*/ Vec3f unk48;
/*004*/ s8 unk54[0xBC - 0x54];
/*0BC*/ s8 unkBC;
/*004*/ s8 unkBD[0x198 - 0xBD];
/*198*/ s16 unk198;
/*19A*/ s16 unk19A;
/*19C*/ s8 unk19C[0x1AC - 0x19C];
/*1ac*/ f32 unk1AC;
/*1b0*/ f32 unk1B0;
/*1b4*/ f32 unk1B4;
/*1b8*/ s8 unk1B8[0x260 - 0x1B8];
/*260*/ s8 unk260;
/*261*/ s8 unk261;
/*262*/ s8 unk262;
/*263*/ s8 unk263;
/*264*/ s32 unk264;
/*268*/ s32 unk268;
/*26c*/ s16 unk26C;
/*26e*/ s16 unk26E;
/*270*/ s8 unk270;
/*271*/ s8 unk271;
/*272*/ s8 unk272;
/*273*/ s8 unk273;
/*274*/ s32 unk274;
/*278*/ f32 unk278;
/*27C*/ f32 unk27C;
/*280*/ s32 unk280;
/*284*/ s32 unk284;
/*288*/ s32 unk288;
/*28C*/ f32 unk28C;
/*290*/ f32 unk290;
/*294*/ f32 unk294;
/*298*/ f32* unk298;
/*29C*/ s8 unk29C[0x2B0 - 0x29C];
/*2b0*/ f32 unk2B0;
/*2b4*/ s8 unk2B4[0x2C8 - 0x2B4];
/*2c8*/ s32 unk2C8;
/*2cc*/ s8 unk2CC[0x2FC - 0x2CC];
/*2fc*/ void* unk2FC;
/*300*/ s8 unk300[0x310 - 0x300];
/*310*/ s32 unk310;
/*314*/ s8 unk314[0x328 - 0x314];
/*328*/ s16 unk328;
/*32A*/ s16 unk32A;
/*32C*/ s8 unk32C[0x33D - 0x32C];
/*33D*/ u8 unk33D;
/*33E*/ s8 unk33E[0x341 - 0x33E];
/*341*/ s8 unk341;
/*342*/ s8 unk342[0x34C - 0x342];
/*34C*/ PlayerStats* stats; //health, Dusters, etc!
/*350*/ s32 flags;
/*354*/ s8 unk354;    
/*354*/ s8 unk355[0x372 - 0x355];    
/*372*/ s8 unk372;    
/*354*/ s8 unk373[0x3C0 - 0x373];    
/*3C0*/ s16* modAnims; //current modanim index array?
/*3C4*/ f32* unk3C4; //array of floats - seem to be speed thresholds for different walking animations?
/*3C8*/ f32 unk3C8;
/*3CC*/ s8 unk3CC[0x6A8 - 0x3CC];    
/*6A8*/ s32 unk6A8; 
/*6AC*/ s16 unk6AC; 
/*6AE*/ s8 unk6AE;
/*6AF*/ s8 unk6AF[0x6e8 - 0x6AF];    
/*6e8*/ s32 unk6E8;
/*3CC*/ s8 unk6EC[0x708 - 0x6EC];  
/*708*/ s32 unk708;
/*70C*/ s8 unk70C[0x7FC - 0x70C];    
/*7FC*/ f32 unk7FC;
/*800*/ f32 unk800;
/*804*/ f32 unk804;
/*808*/ f32 unk808;
/*80C*/ s32 aimX;
/*810*/ s32 aimY;
/*814*/ s8 unk814[0x840 - 0x814];  
/*840*/ f32 unk840;
/*844*/ f32 unk844;
/*844*/ f32 unk848;
/*84C*/ f32 unk84C;
/*850*/ f32 unk850;  
/*854*/ s32 unk854;
/*858*/ s32 unk858;    
/*85C*/ s8 unk85C[0x864 - 0x85C];
/*868*/ s32 unk864;    
/*868*/ s16* unk868;    
/*86C*/ s32 unk86C;
/*870*/ u8 unk870;    
/*871*/ u8 unk871;    
/*872*/ u8 unk872;    
/*873*/ u8 unk873;    
/*874*/ s8 unk874[0x87C - 0x874];
/*87C*/ s16 unk87C;    
/*87E*/ s16 unk87E;    
/*880*/ s32 unk880;    
/*884*/ s16 unk884;    
/*886*/ s16 unk886;    
/*888*/ s16 unk888;    
/*88A*/ s16 unk88A;    
/*88C*/ s32 unk88C;
/*890*/ s32 unk890;
/*894*/ s32 unk894;
/*898*/ s32 unk898;
/*89C*/ s32 unk89C;
/*8A0*/ s32 unk8A0;
/*8A4*/ s8 unk8A4;
/*8A5*/ s8 unk8A5;
/*8A6*/ s8 unk8A6;
/*8A7*/ s8 unk8A7;
/*8A8*/ u8 unk8A8; 
/*8A9*/ u8 unk8A9; 
/*8AA*/ u8 unk8AA; 
/*8AB*/ u8 unk8AB; 
/*8AC*/ s32 unk8AC; 
/*8B0*/ s32 unk8B0; 
/*8B4*/ s8 unk8B4; 
/*8B5*/ s8 unk8B5; 
/*8B6*/ s8 unk8B6; 
/*8B7*/ s8 unk8B7; 
/*8B8*/ s8 unk8B8; 
/*8B9*/ s8 unk8B9; 
/*8BA*/ u8 unk8BA; 
/*8BB*/ u8 unk8BB; 
/*8BC*/ s8 unk8BC; 
/*8BD*/ u8 unk8BD; 
/*8BE*/ s8 unk8BE; 
/*8BF*/ s8 unk8BF; 
/*8C0*/ s8 unk8C0; 
} PlayerState;

// AKA. krystal
DLL_INTERFACE(DLL_210_Player) {
    /*:*/ DLL_INTERFACE_BASE(DLL_IObject);
    /*7*/ Object *(*func7)(Object*);
    /*8*/ UnknownDLLFunc func8;
    /*9*/ UnknownDLLFunc func9;
    /*10*/ UnknownDLLFunc func10;
    /*11*/ UnknownDLLFunc func11;
    /*12*/ UnknownDLLFunc func12;
    /*13*/ UnknownDLLFunc func13;
    /*14*/ UnknownDLLFunc func14;
    /*15*/ UnknownDLLFunc func15;
    /*16*/ UnknownDLLFunc func16;
    /*17*/ UnknownDLLFunc func17;
    /*18*/ UnknownDLLFunc func18;
    /*19*/ UnknownDLLFunc func19;
    /*20*/ UnknownDLLFunc func20;
    /*21*/ UnknownDLLFunc func21;
    /*22*/ UnknownDLLFunc func22;
    /*23*/ UnknownDLLFunc func23;
    /*24*/ UnknownDLLFunc func24;
    /*25*/ UnknownDLLFunc func25;
    /*26*/ UnknownDLLFunc func26;
    /*27*/ UnknownDLLFunc func27;
    /*28*/ UnknownDLLFunc func28;
    /*29*/ UnknownDLLFunc func29;
    /*30*/ UnknownDLLFunc func30;
    /*31*/ UnknownDLLFunc func31;
    /*32*/ UnknownDLLFunc func32;
    /*33*/ UnknownDLLFunc func33;
    /*34*/ UnknownDLLFunc func34;
    /*35*/ UnknownDLLFunc func35;
    /*36*/ UnknownDLLFunc func36;
    /*37*/ UnknownDLLFunc func37;
    /*38*/ UnknownDLLFunc func38;
    /*39*/ UnknownDLLFunc func39;
    /*40*/ UnknownDLLFunc func40;
    /*41*/ UnknownDLLFunc func41;
    /*42*/ UnknownDLLFunc func42;
    /*43*/ UnknownDLLFunc func43;
    /*44*/ UnknownDLLFunc func44;
    /*45*/ UnknownDLLFunc func45;
    /*46*/ UnknownDLLFunc func46;
    /*47*/ UnknownDLLFunc func47;
    /*48*/ UnknownDLLFunc func48;
    /*49*/ UnknownDLLFunc func49;
    /*50*/ s32 (*func50)(Object*);
    /*51*/ UnknownDLLFunc func51;
    /*52*/ UnknownDLLFunc func52;
    /*53*/ UnknownDLLFunc func53;
    /*54*/ UnknownDLLFunc func54;
    /*55*/ UnknownDLLFunc func55;
    /*56*/ UnknownDLLFunc func56;
    /*57*/ UnknownDLLFunc func57;
    /*58*/ UnknownDLLFunc func58;
    /*59*/ UnknownDLLFunc func59;
    /*60*/ UnknownDLLFunc func60;
    /*61*/ UnknownDLLFunc func61;
    /*62*/ UnknownDLLFunc func62;
    /*63*/ UnknownDLLFunc func63;
    /*64*/ UnknownDLLFunc func64;
    /*65*/ UnknownDLLFunc func65;
    /*66*/ UnknownDLLFunc func66;
    /*67*/ void (*func67)(Object*,s32,f32);
    /*68*/ UnknownDLLFunc func68;
    /*69*/ UnknownDLLFunc func69;
    /*70*/ UnknownDLLFunc func70;
    /*71*/ UnknownDLLFunc func71;
    /*72*/ UnknownDLLFunc func72;
    /*73*/ UnknownDLLFunc func73;
    /*74*/ UnknownDLLFunc func74;
    /*75*/ UnknownDLLFunc func75;
    /*76*/ UnknownDLLFunc func76;
    /*77*/ UnknownDLLFunc func77;
    /*78*/ UnknownDLLFunc func78;
    /*79*/ UnknownDLLFunc func79;
};

#endif //_DLLS_210_H
