#include "PR/ultratypes.h"
#include "functions.h"
#include "dll.h"
#include "dlls/engine/21_gametext.h"
#include "sys/memory.h"
#include "sys/gfx/gx.h"
#include "sys/gfx/texture.h"
#include "game/objects/inventory_items.h"

// #include "prevent_bss_reordering.h"

typedef struct {
/*0*/ InventoryItem* characterItems;
/*4*/ s16 unk4;
/*6*/ s16 unk6;
/*8*/ s16 unk8;
/*A*/ s16 unkA;
/*C*/ s16 unkC;
/*E*/ s16 unkE;
} UIUnknownCharacterStruct;

typedef struct {
/*0*/ Texture* unk0;
/*4*/ s32 unk4;
/*8*/ f32 unk8;
/*C*/ s16 unkC;
} CmdmenuItemUnkBSS;

typedef struct {
f32 unk0; //scarabUIOpacity
f32 unk4; //playerIconMagicBarOpacity
s32 unk8;
s32 unkC; //healthValue

} CmdmenuBSS0;

typedef struct {
s32 unk0;
s32 unk4; //magic
s32 unk8; //scarabCount
s32 unkC;
s32 unk10;
s32 unk14;
s32 unk18; //maxHealth
s32 unk1C; //maxMagic
s32 unk20;
s32 unk24;
} CmdmenuPlayerSidekickData;

enum InventoryIcons {
    INVENTORY_ICON_SPELLSTONE_INACTIVE = 0x0562,
    INVENTORY_ICON_SPELLSTONE_ACTIVE = 0x0563
};

/*0x0*/ static s8 _data_0 = 0;
/*0x4*/ static u32 _data_4 = 0x00000000;
/*0x8*/ static u32 _data_8 = 0x01000000;
/*0xC*/ static s16 _data_C = 0x0048;
/*0x10*/ static u32 _data_10 = 0x00000000;
/*0x14*/ static u32 _data_14 = 0x00000000;
/*0x18*/ static s16 _data_18 = 0xffff;
/*0x1C*/ static s8 _data_1C = 0;
/*0x20*/ static s16 _data_20 = 0x003c;
/*0x24*/ static s16 _data_24 = 0x0032;
/*0x28*/ static s16 _data_28 = 0x0014;
/*0x2C*/ static s16 _data_2C = 0x00a0;
/*0x30*/ static u32 _data_30 = 0x00000000;
/*0x34*/ static u32 _data_34[] = {
    0x00000000, 0x00000000, 0x00000000, 0x00000000
};
/*0x44*/ static s16 _data_44 = 0xffff;
/*0x48*/ static s8 _data_48 = 0;
/*0x4C*/ static s16 _data_4C = 0x0078;
/*0x50*/ static s16 _data_50 = 0x0050;
/*0x54*/ static s16 _data_54 = 0x0014;
/*0x58*/ static s16 _data_58 = 0x00a0;
/*0x5C*/ static s16 _data_5C = 0x0000;
/*0x60*/ static u32 _data_60[] = {
    0x00000000, 0xffff0000
};
/*0x68*/ static u32 _data_68[] = {
    0x00000000, 0x3f800000, 0xff000000
};
/*0x74*/ static u8 _data_74 = 0;
/*0x78*/ static u32 _data_78 = 0x00000000;
/*0x7C*/ static u32 _data_7C = 0x00000000;
/*0x80*/ static u8 _data_80 = 0;
/*0x84*/ static u32 _data_84 = 0x00000000;
/*0x88*/ static s8 _data_88 = 1;
/*0x8C*/ static u16 _data_8C[] = {0x002d, 0x0040};
/*0x90*/ static u16 _data_90[] = {
    0x01d7, 0x05bd, 0x05ce, 0x05fc, 0x0777, 0x0000
};
/*0x9C*/ static u16 _data_9C[] = {0x0578, 0x057a};
/*0xA0*/ static u16 _data_A0[] = {
    0x057d, 0x057c, 0x057b, 0x057e, 0x0579, 0x0000
};
/*0xAC*/ static u16 _data_AC[] = {
    0x057f, 0x057f, 0x0581, 0x0580, 0x0582, 0x0583
};
/*0xB8*/ static u16 _data_B8[] = {
    0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 0xffff, 
    0x0000, 0x0000, 0x0000, 0x0000, 0x0d05, 0x1310, 0x040a, 0x0c16, 0x0416, 0x0c20, 0x0d16, 0x1328, 0x140a, 0x1c16, 0x1416, 0x1c20, 
    0x0b00, 0x150a, 0x0204, 0x0c10, 0x0417, 0x0c28, 0x0b20, 0x152c, 0x1417, 0x1c28, 0x1404, 0x1e10, 0x080e, 0x1812, 0x0812, 0x1818
};
/*0x118*/ static u32 _data_118 = 0x00000000;
/*0x11C*/ static u32 _data_11C = 0x00000000;
/*0x120*/ static u32 _data_120 = 0x00000000;
/*0x124*/ static u32 _data_124 = 0x00000000;

/* Krystal items
 * 0x128*/ static InventoryItem _data_128[] = {
    {0x00c7, 0x00b4, 0x0245, 0xffff, 0x0010, 0xff, 0x01}, //Warp Crystal
    {0x0044, 0xffff, 0x0175, 0xffff, 0x0007, 0xff, 0x01}, //Prison Key (CloudRunner Fortress)
    {0x0060, 0xffff, 0x0176, 0xffff, 0x0008, 0xff, 0x01}, //Power Room Key (CloudRunner Fortress)
    {0x0051, 0xffff, 0x0180, 0xffff, 0x0009, 0xff, 0x01}, //Red Power Crystal (CloudRunner Fortress)
    {0x0052, 0xffff, 0x0181, 0xffff, 0x0009, 0xff, 0x01}, //Green Power Crystal (CloudRunner Fortress)
    {0x0053, 0xffff, 0x0182, 0xffff, 0x0009, 0xff, 0x01}, //Blue Power Crystal (CloudRunner Fortress)
    {0x00c8, 0xffff, 0x0175, 0xffff, 0x0011, 0xff, 0x01}, //Snowbike Key (Removed)
    {0x002b, 0x002a, 0x0175, 0xffff, 0x0013, 0xff, 0x01}, //Mine Key
    {0x0170, 0xffff, 0x01a3, 0xffff, 0x000b, 0xff, 0x01}, //Alpine Root (Unsure whether geyser area or DIM)
    {0x017b, 0x0181, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 1
    {0x017e, 0x0182, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 2
    {0x017f, 0x0183, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 3
    {0x0180, 0x0184, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 4
    {0x0163, 0x0164, 0x027a, 0xffff, 0x0016, 0x02, 0x02}, //Small Food Bag
    {0x0164, 0x0165, 0x0244, 0xffff, 0x0017, 0x02, 0x02}, //Medium Food Bag
    {0x0165, 0xffff, 0x02bf, 0xffff, 0x0018, 0x02, 0x02}, //Large Food Bag
    {0x00aa, 0x00f1, 0x0471, 0xffff, 0x002f, 0x09, 0x02}, //Small Grub Bag
    {0x00f1, 0x00fe, 0x0560, 0xffff, 0x0030, 0x09, 0x02}, //Medium Grub Bag
    {0x00fe, 0xffff, 0x0560, 0xffff, 0x0031, 0x09, 0x02}, //Large Grub Bag
    {0x02b6, 0x0088, 0x0257, 0xffff, 0xffff, 0xff, 0x01}, //Gold Nugget #1 (Near Golden Plains)
    {0x02b7, 0x02c5, 0x0257, 0xffff, 0xffff, 0xff, 0x01}, //Gold Nugget #2 (Near LightFoot Village)
    {0x03d5, 0xffff, 0x04f7, 0xffff, 0x0102, 0xff, 0x01}, //Fire Crystal #3
    {0x03ed, 0x02c5, 0x0175, 0xffff, 0x001e, 0xff, 0x01}, //Cell Door Key (Cape Claw?)
    {0x02e8, 0xffff, 0x0562, 0xffff, 0xffff, 0xff, 0x01}, //SpellStone - CloudRunner Fortress (Activated)
    {0x083a, 0xffff, 0x0562, 0xffff, 0xffff, 0xff, 0x01}, //SpellStone - BlackWater Canyon (Activated)
    {0x07bd, 0xffff, 0x0562, 0xffff, 0xffff, 0xff, 0x01}, //SpellStone - Krazoa Palace (Activated)
    {0x07bf, 0xffff, 0x0496, 0xffff, 0xffff, 0xff, 0x01}, //Krazoa Translator
    {0x01ee, 0xffff, 0x0258, 0xffff, 0x001d, 0xff, 0x01}, //Horn of Truth
    {0x0336, 0xffff, 0x0568, 0xffff, 0xffff, 0xff, 0x01}, //Treasure Chest Key (CloudRunner Fortress)
    {0x0023, 0xffff, 0x01a5, 0xffff, 0x002a, 0xff, 0x01}, //Blue Mushroom (CloudRunner Grubs?)
    {0x013d, 0xffff, 0x046d, 0xffff, 0x003d, 0xff, 0x01}, //Firefly Lantern
    {0x0611, 0xffff, 0x0175, 0xffff, 0x0007, 0xff, 0x01}, //Prison Key (CloudRunner Fortress)
    {0x023b, 0xffff, 0x0496, 0xffff, 0x005b, 0xff, 0x01}, //Krazoa Tablets
    {0x086a, 0xffff, 0x040d, 0xffff, 0x005e, 0xff, 0x01}, //MoonSeeds
    {0x08fc, 0xffff, 0x0175, 0xffff, 0x0064, 0xff, 0x01}, //Construction Engineer's Key (CloudRunner Fortress)
    {0x0395, 0x0088, 0x0257, 0xffff, 0x0103, 0xff, 0x01}, //Gold Nugget #3 (Cape Claw)
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Sabre items
 * 0x2E4*/ static InventoryItem _data_2E4[] = {
    {0x0098, 0xffff, 0x0175, 0xffff, 0x000a, 0xff, 0x01}, //Gate Key (Northern Wastes) (Unused?)
    {0x0576, 0xffff, 0x01a3, 0xffff, 0x000b, 0xff, 0x01}, //Alpine Root (Unsure whether geyser area or DIM)
    {0x00c1, 0xffff, 0x01a5, 0xffff, 0x000c, 0xff, 0x01}, //Blue Mushroom
    {0x066c, 0xffff, 0x0498, 0xffff, 0x0057, 0xff, 0x01}, //Purple Mushroom
    {0x066d, 0xffff, 0x0497, 0xffff, 0x0056, 0xff, 0x01}, //White Mushroom
    {0x002b, 0x002a, 0x0175, 0xffff, 0x0013, 0xff, 0x01}, //Mine Key
    {0x0170, 0xffff, 0x01a3, 0xffff, 0x000b, 0xff, 0x01}, //Alpine Root (Unsure whether geyser area or DIM)
    {0x017b, 0x0181, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 1 
    {0x017e, 0x0182, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 2
    {0x017f, 0x0183, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 3
    {0x0180, 0x0184, 0x0479, 0xffff, 0x000b, 0xff, 0x01}, //DIM Gear 4
    {0x01f1, 0x01f2, 0x0175, 0xffff, 0x0019, 0xff, 0x01}, //Belina Te Cell Key (DarkIce Mines)
    {0x01f3, 0x01f4, 0x0175, 0xffff, 0x0019, 0xff, 0x01}, //Tricky Cell Key (DarkIce Mines)
    {0x08a0, 0x08a2, 0x0245, 0xffff, 0x0010, 0xff, 0x01}, //Warp Crystal
    {0x0241, 0x0242, 0x0175, 0xffff, 0x0019, 0xff, 0x01}, //Door Key 1 (DarkIce Mines)
    {0x0282, 0x0283, 0x0175, 0xffff, 0x0019, 0xff, 0x01}, //Door Key 2 (DarkIce Mines)
    {0x0160, 0x0161, 0x027a, 0xffff, 0x0016, 0x03, 0x02}, //Small Food Bag
    {0x0161, 0x0162, 0x0244, 0xffff, 0x0017, 0x03, 0x02}, //Medium Food Bag
    {0x0162, 0xffff, 0x02bf, 0xffff, 0x0018, 0x03, 0x02}, //Large Food Bag
    {0x0009, 0x0024, 0x0471, 0xffff, 0x0032, 0x0a, 0x02}, //Small Dinosaur Food Bag
    {0x0024, 0x00a6, 0x0560, 0xffff, 0x0033, 0x0a, 0x02}, //Medium Dinosaur Food Bag
    {0x00a6, 0xffff, 0x0560, 0xffff, 0x0034, 0x0a, 0x02}, //Large Dinosaur Food Bag
    {0x02d6, 0xffff, 0x0175, 0xffff, 0x001d, 0xff, 0x01}, //Corrupted? A key with "ForceField Spell (Cape Claw)" as its description
    {0x01ee, 0xffff, 0x0258, 0xffff, 0x001d, 0xff, 0x01}, //Horn of Truth
    {0x05d6, 0xffff, 0x046d, 0xffff, 0x003d, 0xff, 0x01}, //Firefly Lantern
    {0x081d, 0x081f, 0x052b, 0xffff, 0x0000, 0xff, 0x01}, //Silver Tooth (Walled City)
    {0x081e, 0x0820, 0x052a, 0xffff, 0x0000, 0xff, 0x01}, //Gold Tooth (Walled City)
    {0x0201, 0x0202, 0x03a8, 0xffff, 0x001b, 0xff, 0x01}, //Sun Stone (Walled City)
    {0x0264, 0x0243, 0x03d6, 0xffff, 0x001c, 0xff, 0x01}, //Moon Stone (Walled City)
    {0x086a, 0xffff, 0x040d, 0xffff, 0x0062, 0xff, 0x01}, //MoonSeeds
    {0x0123, 0x022b, 0x0562, 0xffff, 0x0060, 0xff, 0x01}, //SpellStone - DarkIce Mines (Inactive)
    {0x022b, 0xffff, 0x0563, 0xffff, 0x0061, 0xff, 0x01}, //SpellStone - DarkIce Mines (Activated) 
    {0x083b, 0xffff, 0x0180, 0xffff, 0xffff, 0xff, 0x01}, //Spellstone - Walled City (Activated)
    {0x083c, 0xffff, 0x0180, 0xffff, 0xffff, 0xff, 0x01}, //Spellstone - Dragon Rock (Activated)
    {0x086d, 0xffff, 0x055e, 0xffff, 0x005e, 0xff, 0x01}, //PointBack Egg (Diamond Bay)
    {0x086c, 0xffff, 0x055f, 0xffff, 0x005f, 0xff, 0x01}, //Bay Diamond
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Food Bag actions (Krystal)
 * 0x4A0*/ static InventoryItem _data_4A0[] = {
    {0x0385, 0xffff, 0x02c7, 0xffff, 0x001f, 0x04, 0x02}, //Eat food in foodbag
    {0x0386, 0xffff, 0x02c8, 0xffff, 0x0020, 0x04, 0x02}, //Place food down from foodbag
    {0x0387, 0xffff, 0x02ef, 0xffff, 0x0021, 0x04, 0x02}, //Give food from foodbag
    {0x0383, 0xffff, 0x0265, 0xffff, 0x0039, 0x02, 0x02}, //Take all food
    {0x0384, 0xffff, 0x0529, 0xffff, 0x003a, 0x02, 0x02}, //Eat first
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Food Bag actions (Sabre)
 * 0x4E8*/ static InventoryItem _data_4E8[] = {
    {0x0385, 0xffff, 0x02c7, 0xffff, 0x001f, 0x05, 0x02}, //Eat food in foodbag
    {0x0386, 0xffff, 0x02c8, 0xffff, 0x0020, 0x05, 0x02}, //Place food down from foodbag
    {0x0387, 0xffff, 0x02ef, 0xffff, 0x0021, 0x05, 0x02}, //Give food from foodbag
    {0x0383, 0xffff, 0x0265, 0xffff, 0x0039, 0x03, 0x02}, //Take all food
    {0x0384, 0xffff, 0x0529, 0xffff, 0x003a, 0x03, 0x02}, //Eat first
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Food Bag items (Krystal)
 * 0x530*/ static InventoryItem _data_530[] = {
    {0x0166, 0xffff, 0x026e, 0xffff, 0x0022, 0xff, 0x01}, //Green apple
    {0x0167, 0xffff, 0x026f, 0xffff, 0x0023, 0xff, 0x01}, //Red apple
    {0x0256, 0xffff, 0x0270, 0xffff, 0x0024, 0xff, 0x01}, //Brown Apple
    {0x036e, 0xffff, 0x0272, 0xffff, 0x0025, 0xff, 0x01}, //Fish
    {0x037f, 0xffff, 0x02c6, 0xffff, 0x0026, 0xff, 0x01}, //Smoked Fish
    {0x0380, 0xffff, 0x02c4, 0xffff, 0x0027, 0xff, 0x01}, //Dino Egg
    {0x0381, 0xffff, 0x02c5, 0xffff, 0x0028, 0xff, 0x01}, //Moldy Meat
    {0x0543, 0xffff, 0x0270, 0xffff, 0x0035, 0xff, 0x01}, //Green Bean
    {0x0544, 0xffff, 0x0270, 0xffff, 0x0036, 0xff, 0x01}, //Red Bean
    {0x0545, 0xffff, 0x0270, 0xffff, 0x0037, 0xff, 0x01}, //Brown Bean
    {0x0546, 0xffff, 0x0270, 0xffff, 0x0038, 0xff, 0x01}, //Blue Bean
    {0x0163, 0x0164, 0x027a, 0xffff, 0x0016, 0x02, 0x02}, //Small Food Bag
    {0x0164, 0x0165, 0x0244, 0xffff, 0x0017, 0x02, 0x02}, //Medium Food Bag
    {0x0165, 0xffff, 0x02bf, 0xffff, 0x0018, 0x02, 0x02}, //Large Food Bag
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Food Bag items (Sabre)
 * 0x5E4*/ static InventoryItem _data_5E4[] = {
    {0x0166, 0xffff, 0x026e, 0xffff, 0x0022, 0xff, 0x01}, //Green apple
    {0x0167, 0xffff, 0x026f, 0xffff, 0x0023, 0xff, 0x01}, //Red apple
    {0x0256, 0xffff, 0x0270, 0xffff, 0x0024, 0xff, 0x01}, //Brown Apple
    {0x036e, 0xffff, 0x0272, 0xffff, 0x0025, 0xff, 0x01}, //Fish
    {0x037f, 0xffff, 0x02c6, 0xffff, 0x0026, 0xff, 0x01}, //Smoked Fish
    {0x0380, 0xffff, 0x02c4, 0xffff, 0x0027, 0xff, 0x01}, //Dino Egg
    {0x0381, 0xffff, 0x02c5, 0xffff, 0x0028, 0xff, 0x01}, //Moldy Meat
    {0x0543, 0xffff, 0x0270, 0xffff, 0x0035, 0xff, 0x01}, //Green Bean 
    {0x0544, 0xffff, 0x0270, 0xffff, 0x0036, 0xff, 0x01}, //Red Bean
    {0x0545, 0xffff, 0x0270, 0xffff, 0x0037, 0xff, 0x01}, //Brown Bean
    {0x0546, 0xffff, 0x0270, 0xffff, 0x0038, 0xff, 0x01}, //Blue Bean
    {0x0160, 0x0161, 0x027a, 0xffff, 0x0016, 0x03, 0x02}, //Small Food Bag
    {0x0161, 0x0162, 0x0244, 0xffff, 0x0017, 0x03, 0x02}, //Medium Food Bag
    {0x0162, 0xffff, 0x02bf, 0xffff, 0x0018, 0x03, 0x02}, //Large Food Bag
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Magic Spells
 * 0x698*/ static InventoryItem _data_698[] = {
    {0x002d, 0xffff, 0x0183, 0xffff, 0x000d, 0xff, 0x00}, //Projectile Spell
    {0x05ce, 0xffff, 0x0468, 0xffff, 0x003c, 0xff, 0x00}, //Ice Blast Spell
    {0x0777, 0xffff, 0x04f8, 0xffff, 0x000f, 0xff, 0x00}, //Grenade Spell (Incorrectly labelled as Randorn)
    {0x0040, 0xffff, 0x0177, 0xffff, 0x000e, 0xff, 0x00}, //Illusion Spell
    {0x01d7, 0xffff, 0x0265, 0xffff, 0x0014, 0xff, 0x00}, //ForceField Spell
    {0x0107, 0xffff, 0x0183, 0xffff, 0x000d, 0xff, 0x00}, //Glitched Spell
    {0x0341, 0x0348, 0x0529, 0xffff, 0x000d, 0xff, 0x00}, //Glitched Spell (Quake?)
    {0x05bd, 0xffff, 0x0466, 0xffff, 0x003b, 0xff, 0x00}, //Portal Spell
    {0x05fc, 0xffff, 0x0470, 0xffff, 0x003e, 0xff, 0x00}, //Mind Read
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Sidekick Commands (Kyte)
 * 0x710*/ static InventoryItem _data_710[] = {
    {0x0001, 0x0000, 0x01cd, 0x01cd, 0x0000, 0x00, 0x00}, //Heel
    {0x0020, 0x0005, 0x01d1, 0x01d1, 0x0006, 0x00, 0x00}, //Play
    {0x0002, 0x0001, 0x01ce, 0x01ce, 0x0001, 0x00, 0x00}, //Find
    {0x0010, 0x0004, 0x01cf, 0x01cf, 0x0002, 0x00, 0x00}, //Flame
    {0x0004, 0x0002, 0x01d0, 0x01d0, 0x0003, 0x00, 0x00}, //Distract
    {0x0008, 0x0003, 0x01d2, 0x01d2, 0x0004, 0x00, 0x00}, //Guard
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Sidekick Commands (Tricky)
 * 0x764*/ static InventoryItem _data_764[] = {
    {0x0001, 0x0000, 0x01cd, 0x01cd, 0x0000, 0x00, 0x00}, //Heel
    {0x0020, 0x0005, 0x01d1, 0x01d1, 0x0006, 0x00, 0x00}, //Play
    {0x0002, 0x0001, 0x01ce, 0x01ce, 0x0001, 0x00, 0x00}, //Find
    {0x0010, 0x0004, 0x01cf, 0x01cf, 0x0002, 0x00, 0x00}, //Flame
    {0x0004, 0x0002, 0x01d0, 0x01d0, 0x0003, 0x00, 0x00}, //Distract
    {0x0008, 0x0003, 0x01d2, 0x01d2, 0x0004, 0x00, 0x00}, //Guard
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Dinosaur Food Bag Actions (Krystal)
 * 0x7B8*/ static InventoryItem _data_7B8[] = {
    {0x0200, 0xffff, 0x02c8, 0xffff, 0x0020, 0x0b, 0x02}, //Place food down from foodbag
    {0x022c, 0xffff, 0x0561, 0xffff, 0x0021, 0x0b, 0x02}, //Give food from foodbag
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Dinosaur Food Bag Actions (Sabre)
 * 0x7DC*/ static InventoryItem _data_7DC[] = {
    {0x0200, 0xffff, 0x02c8, 0xffff, 0x0020, 0x0c, 0x02}, //Place food down from foodbag
    {0x022c, 0xffff, 0x0561, 0xffff, 0x0021, 0x0c, 0x02}, //Give food from foodbag
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

/* Dinosaur Food Bag Items (Kyte)
 * 0x800*/ static InventoryItem _data_800[] = {
    {0x00aa, 0x00f1, 0x027a, 0xffff, 0x002f, 0x09, 0x02}, //Small Mushroom Bag
    {0x00f1, 0x00fe, 0x0244, 0xffff, 0x0030, 0x09, 0x02}, //Medium Mushroom Bag
    {0x00fe, 0xffff, 0x02bf, 0xffff, 0x0031, 0x09, 0x02}, //Large Mushroom Bag
    {0x012e, 0xffff, 0x0270, 0xffff, 0x000c, 0xff, 0x01}, //Blue Mushroom
    {0x0169, 0xffff, 0x0270, 0xffff, 0x002d, 0xff, 0x01}, //Red Mushroom
    {0x01d0, 0xffff, 0x0270, 0xffff, 0x002e, 0xff, 0x01}, //Old Mushroom
    {0x01d6, 0xffff, 0x0270, 0xffff, 0x002a, 0xff, 0x01}, //Blue Grub
    {0x01ed, 0xffff, 0x0270, 0xffff, 0x002b, 0xff, 0x01}, //Red Grub
    {0x01fd, 0xffff, 0x0270, 0xffff, 0x002c, 0xff, 0x01}, //Old Grub
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00},
};

/* Dinosaur Food Bag Items (Tricky)
 * 0x878*/ static InventoryItem _data_878[] = {
    {0x0009, 0x0024, 0x027a, 0xffff, 0x0032, 0x0a, 0x02}, //Small Mushroom Bag
    {0x0024, 0x00a6, 0x0244, 0xffff, 0x0033, 0x0a, 0x02}, //Medium Mushroom Bag
    {0x00a6, 0xffff, 0x02bf, 0xffff, 0x0034, 0x0a, 0x02}, //Large Mushroom Bag
    {0x012e, 0xffff, 0x0270, 0xffff, 0x000c, 0xff, 0x01}, //Blue Mushroom
    {0x0169, 0xffff, 0x0270, 0xffff, 0x002d, 0xff, 0x01}, //Red Mushroom
    {0x01d0, 0xffff, 0x0270, 0xffff, 0x002e, 0xff, 0x01}, //Old Mushroom
    {0x01d6, 0xffff, 0x0270, 0xffff, 0x002a, 0xff, 0x01}, //Blue Grub
    {0x01ed, 0xffff, 0x0270, 0xffff, 0x002b, 0xff, 0x01}, //Red Grub
    {0x01fd, 0xffff, 0x0270, 0xffff, 0x002c, 0xff, 0x01}, //Old Grub
    {0xffff, 0xffff, 0xffff, 0xffff, 0x0000, 0x00, 0x00}
};

//Krystal
/*0x8F0*/ static UIUnknownCharacterStruct _data_8F0 = {
    (InventoryItem*)&_data_128, 0x0000, 0x0000, 0x0008, 0x0001, 0x0000, 0x0001 };

//Sabre
/*0x900*/ static UIUnknownCharacterStruct _data_900[] = {
    (InventoryItem*)&_data_2E4, 0x0000, 0x0000, 0x0008, 0x0001, 0x0000, 0x0001 };

/*0x910*/ static UIUnknownCharacterStruct _data_910[] = {
    (InventoryItem*)&_data_4A0, 0x0000, 0x0000, 0x0008, 0x0001, 0x0000, 0x0001 };
/*0x920*/ static UIUnknownCharacterStruct _data_920[] = {
    (InventoryItem*)&_data_4E8, 0x0000, 0x0000, 0x0008, 0x0001, 0x0000, 0x0001 };
/*0x930*/ static UIUnknownCharacterStruct _data_930[] = {
    (InventoryItem*)&_data_530, 0x0000, 0x0000, 0x0008, 0x0001, 0x0000, 0x0001 };
/*0x940*/ static UIUnknownCharacterStruct _data_940[] = {
    (InventoryItem*)&_data_5E4, 0x0000, 0x0000, 0x0008, 0x0001, 0x0000, 0x0001 };
/*0x950*/ static UIUnknownCharacterStruct _data_950[] = {
    (InventoryItem*)&_data_698, 0x0000, 0x0000, 0x0008, 0x0002, 0x0000, 0x0002 };

/*0x960*/ static u32 _data_960 = (u32)&_data_710;
/*0x964*/ static u32 _data_964[] = {
    0x00000000, 0x00080009, 0x00000004
};
/*0x970*/ static u32 _data_970 = (u32)&_data_764;
/*0x974*/ static u32 _data_974[] = {
    0x00000000, 0x00080009, 0x00000004
};
/*0x980*/ static u32 _data_980[] = {
    (u32)&_data_7B8, 0x00000000, 0x00080001, 0x00000001
};
/*0x990*/ static u32 _data_990[] = {
    (u32)&_data_7DC, 0x00000000, 0x00080001, 0x00000001
};
/*0x9A0*/ static u32 _data_9A0[] = {
    (u32)&_data_800, 0x00000000, 0x00080001, 0x00000001
};
/*0x9B0*/ static u32 _data_9B0[] = {
    (u32)&_data_878, 0x00000000, 0x00080001, 0x00000001, 0x00000000, 0x00000000, 0x00000000, 0x00000000
};

/*0x9D0*/ static s8 _data_9D0 = 0;
/*0x9D4*/ static u32 _data_9D4 = 0x00000000;
/*0x9D8*/ static u16 _data_9D8[] = {
    0x01be, 0x01bf, 0x1c0, 0x01c2, 0x01c3, 0x01c4, 0x01c5, 0x01c6, 
    0x03e2, 0x03e3, 0x03e4, 0x03e5, 0x0421, 0x01c9, 0x03ea, 0x03eb, 
    0x01cb, 0x03e6, 0x03e7, 0x03f5, 0x03f6, 0x03f7, 0x03f8, 0x03f9,
    0x03fa, 0x03fb, 0x03fc, 0x03fd, 0x03fe, 0x0422, 0x0423, 0x0429, 
    0x042a, 0x042b, 0x042c, 0x0424, 0x042d, 0x0431, 0x01d4, 0x042f,
    0x0432, 0x0430, 0x0433, 0x042e, 0x0435, 0x0436, 0x0438, 0x043a, 
    0x043b, 0x043d, 0x043e, 0x0434, 0x0437, 0x0267, 0x0268, 0x0476,
    0x0477, 0x0478, 0x0000, 0x0000
};

/*0x0*/ static f32 _bss_0; //scarabUIOpacity
/*0x4*/ static f32 _bss_4; //playerIconMagicBarOpacity
/*0x8*/ static u8 _bss_8[0x8];
/*0x10*/ static CmdmenuPlayerSidekickData _bss_10; //Tricky food level is stored in here! Maybe a struct?
/*0x38*/ static u8 _bss_38[0x8];
/*0x40*/ static u8 _bss_40[0xc];
/*0x4C*/ static u8 _bss_4C[0x4];
/*0x50*/ static u8 _bss_50[0x10];
/*0x60*/ static u8 _bss_60[0x4];
/*0x64*/ static u8 _bss_64[0x4];
/*0x68*/ static u8 _bss_68[0x8];
/*0x70*/ static u8 _bss_70[0x18];
/*0x88*/ static s8 _bss_88;
/*0x89*/ static u8 _bss_89[0x1];
/*0x8A*/ static u8 _bss_8A[0x1];
/*0x8B*/ static u8 _bss_8B[0x1];
/*0x8C*/ static u8 _bss_8C[0x4];
/*0x90*/ static EnergyBar* _bss_90; 
/*0x98*/ static u8 _bss_98[0x8]; //Pointers to inventory icon textures
/*0xA0*/ static u8 _bss_A0[0xf8];
/*0x198*/ static u8 _bss_198[0x8];
/*0x1A0*/ static u8 _bss_1A0[0xf8];
/*0x298*/ static u8 _bss_298[0x8];
/*0x2A0*/ static u8 _bss_2A0[0x78];
/*0x318*/ static u8 _bss_318[0x8];
/*0x320*/ static u8 _bss_320[0xf8];
/*0x418*/ static s16 _bss_418[4]; //array of textIDs
/*0x420*/ static u8 _bss_420[0x78];
/*0x498*/ static s8 _bss_498[8]; //array of unkAs (from InventoryItem)
/*0x4A0*/ static u8 _bss_4A0[0x38];
/*0x4D8*/ static s8 _bss_4D8[8]; //array of unkBs (from InventoryItem)
/*0x4E0*/ static u8 _bss_4E0[0x38];
/*0x518*/ static u8 _bss_518[0x8];
/*0x520*/ static u8 _bss_520[0x38];
/*0x558*/ static u8 _bss_558[0x8];
/*0x560*/ static u8 _bss_560[0x38];
/*0x598*/ static u8 _bss_598[0x4];
/*0x59C*/ static u8 _bss_59C[0x4];
/*0x5A0*/ static u8 _bss_5A0[0x4];
/*0x5A4*/ static u8 _bss_5A4[0x4];
/*0x5A8*/ static u8 _bss_5A8[0x4];
/*0x5AC*/ static u8 _bss_5AC[0x4];
/*0x5B0*/ static u8 _bss_5B0[0x4];
/*0x5B4*/ static s32 _bss_5B4;
/*0x5B8*/ static u8 _bss_5B8[0x4];
/*0x5BC*/ static s32 _bss_5BC;
/*0x5C0*/ static u8 _bss_5C0[0x8];
/*0x5C8*/ static u8 _bss_5C8[0x8];
/*0x5D0*/ static u8 _bss_5D0[0x4];
/*0x5D4*/ static u8 _bss_5D4[0x4];
/*0x5D8*/ static u8 _bss_5D8[0x4];
/*0x5DC*/ static u8 _bss_5DC[0x4];
/*0x5E0*/ static u8 _bss_5E0[0x4];
/*0x5E4*/ static u8 _bss_5E4[0x4];
/*0x5E8*/ static u8 _bss_5E8[0x8];
/*0x5F0*/ static u8 _bss_5F0[0xc0];
/*0x6B0*/ static u8 _bss_6B0[0x8];
/*0x6B8*/ static u8 _bss_6B8[0x8];
/*0x6C0*/ static u8 _bss_6C0[0x10];
/*0x6D0*/ static u8 _bss_6D0[0x18];
/*0x6E8*/ static u8 _bss_6E8[0x8];
/*0x6F0*/ static u8 _bss_6F0[0x280];
/*0x970*/ static u8 _bss_970[0x18];
/*0x988*/ static u8 _bss_988[0x8];
/*0x990*/ static u8 _bss_990[0x10];
/*0x9A0*/ static u8 _bss_9A0[0x18];
/*0x9B8*/ static u8 _bss_9B8[0x8];
/*0x9C0*/ static u8 _bss_9C0[0x10];
/*0x9D0*/ static u8 _bss_9D0[0x18];
/*0x9E8*/ static u8 _bss_9E8[0x8];
/*0x9F0*/ static u8 _bss_9F0[0x10];
/*0xA00*/ static u8 _bss_A00[0x18];
/*0xA18*/ static u8 _bss_A18[0x8];
/*0xA20*/ static u8 _bss_A20[0x10];
/*0xA30*/ static u8 _bss_A30[0x30];
/*0xA60*/ static u8 _bss_A60[0x30];
/*0xA90*/ static u8 _bss_A90[0x108];
/*0xB98*/ static u8 _bss_B98[0x8];
/*0xBA0*/ static u8 _bss_BA0[0x88]; //infobox height and inventory box height stored near the end (height of paper scroll graphics)
/*0xC28*/ static s16 _bss_C28;
/*0xC2A*/ static s16 _bss_C2A;
/*0xC2C*/ static s16 _bss_C2C;
/*0xC2E*/ static s16 _bss_C2E;
/*0xC30*/ static GameTextChunk* _bss_C30;
/*0xC34*/ static u8 _bss_C34[0x4];
/*0xC38*/ static s16 _bss_C38;
/*0xC3A*/ static s16 _bss_C3A;
/*0xC3C*/ static s8 _bss_C3C;
/*0xC3D*/ static s8 _bss_C3D;
/*0xC3E*/ static u8 _bss_C3E[0x2];
/*0xC40*/ static u8 _bss_C40[0x4];
/*0xC44*/ static u8 _bss_C44[0x4];
/*0xC48*/ static s8 _bss_C48;
/*0xC4C*/ static u8 _bss_C4C[0x4];
/*0xC50*/ static u8 _bss_C50[0x4];
/*0xC54*/ static s32 _bss_C54; //controllerButtons
/*0xC58*/ static u8 _bss_C58[0x8];
/*0xC60*/ static u8 _bss_C60[0x18];
/*0xC78*/ static u8 _bss_C78[0x2];
/*0xC7A*/ static u8 _bss_C7A[0x2];
/*0xC7C*/ static u16 _bss_C7C;
/*0xC7E*/ static u16 _bss_C7E;
/*0xC80*/ static u16 _bss_C80;
/*0xC88*/ static CmdmenuItemUnkBSS _bss_C88;
// /*0xC90*/ static u8 _bss_C90[0x10];

// offset: 0x0 | ctor
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/1_cmdmenu/dll_1_ctor.s")

// offset: 0x180 | dtor
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/1_cmdmenu/dll_1_dtor.s")

// offset: 0x2B8 | func: 0 | export: 15
void dll_1_func_2B8(u16 arg0) {
    _data_74 = arg0;
}

// offset: 0x2E0 | func: 1 | export: 19
void dll_1_func_2E0(u8 arg0) {
    _data_80 = arg0;
}

// offset: 0x308 | func: 2 | export: 0
#ifndef NON_MATCHING
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/1_cmdmenu/dll_1_func_308.s")
#else

void dll_1_func_1410();
void dll_1_func_1FEC();

s32 dll_1_func_308(void) {
    dll_1_func_1FEC();
    dll_1_func_1410();
    return 0;
}
#endif

// offset: 0x35C | func: 3 | export: 1
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/1_cmdmenu/dll_1_func_35C.s")

// offset: 0xBB8 | func: 4 | export: 2
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/1_cmdmenu/dll_1_func_BB8.s")

