#include "PR/gbi.h"
#include "PR/ultratypes.h"
#include "dlls/engine/1_cmdmenu.h"
#include "dll.h"
#include "dlls/engine/21_gametext.h"
#include "dlls/objects/210_player.h"
#include "dlls/objects/common/sidekick.h"
#include "game/gamebits.h"
#include "game/gametexts.h"
#include "game/objects/interaction_arrow.h"
#include "game/objects/object.h"
#include "game/objects/object_id.h"
#include "sys/gfx/textable.h"
#include "sys/memory.h"
#include "sys/objects.h"
#include "sys/objmsg.h"
#include "sys/rcp.h"
#include "sys/vi.h"
#include "sys/gfx/texture.h"
#include "sys/main.h"
#include "sys/fonts.h"
#include "sys/rcp.h"
#include "sys/joypad.h"
#include "macros.h"
#include "gbi_extra.h"
#include "prevent_bss_reordering2.h"

// official filename: 9slcommandmenu.c (default.dol)

#define MAX_LOADED_ITEMS 64
#define MAX_OPACITY 0xFF
#define MAX_OPACITY_F 255.0f

#define NO_GAMETEXT -1
#define NO_TEXTURE -1
#define NO_PAGE -1

/* UI COORD MACROS */

#define SCREEN_WIDTH 320
#define SCREEN_HEIGHT 240

//Change these to move the UI elements in the top-left of screen (character icon, health, magic)
#define UI_TOP_LEFT_X 0
#define UI_TOP_LEFT_Y 0

//Change these to move the UI elements in the top-right of screen (C-buttons, inventory scroll)
#define UI_TOP_RIGHT_X (SCREEN_WIDTH)
#define UI_TOP_RIGHT_Y (0)

//Change these to move the UI elements in the bottom-left of screen (item info pop-up, minimap)
#define UI_BOTTOM_LEFT_X (0)
#define UI_BOTTOM_LEFT_Y (SCREEN_HEIGHT)

//Change these to move the UI elements in the bottom-right of screen (Scarab counter, active Spell/Command)
#define UI_BOTTOM_RIGHT_X (SCREEN_WIDTH)
#define UI_BOTTOM_RIGHT_Y (SCREEN_HEIGHT)

//UI TOP-LEFT
#define POS_HEALTH_X 60
#define POS_HEALTH_Y 20

#define APPLES_ROW_1 7
#define APPLES_ROW_2 6
#define APPLES_ROW_2_IDX (APPLES_ROW_1)
#define APPLES_ROW_3_IDX (APPLES_ROW_1 + APPLES_ROW_2)
#define APPLES_SPACING_X 10
#define APPLES_SPACING_Y 10

//UI TOP-RIGHT
#define POS_PAGE_ICON_X 261
#define POS_PAGE_ICON_Y 10

#define POS_ITEM_HL_X1 266
#define POS_ITEM_HL_Y1 82
#define POS_ITEM_HL_X2 282
#define POS_ITEM_HL_Y2 102

//UI BOTTOM-LEFT

//UI BOTTOM-RIGHT
#define POS_SCARABS_X (UI_BOTTOM_RIGHT_X - 68)
#define POS_SCARABS_Y (UI_BOTTOM_RIGHT_Y - 42)
#define POS_SCARABS_NUMBER_X (POS_SCARABS_X + 18)
#define POS_SCARABS_NUMBER_Y (POS_SCARABS_Y + 4)


typedef struct {
/*0*/ Texture* texture;
/*4*/ s32 timer;
/*8*/ f32 opacity;
/*C*/ s16 count;
} CmdmenuInfoShowData;

typedef struct {
/*0*/ InventoryItem* items;
/*4*/ s16 unk4;     // the loaded item index of this page's selected item (at runtime)
/*8*/ u32 mesgID;   // objmesg ID sent to player
/*C*/ s32 btnMask;  // mask of joypad buttons that can be used to move to this item
} CmdmenuPage;

typedef union { 
    struct {
    /*0 00*/ s32 playerHealth;
    /*1 04*/ s32 sidekickBlueFood;
    /*2 08*/ s32 playerMagic;
    /*3 0C*/ s32 playerScarabCount;
    /*4 10*/ s32 sidekickRedFood;
    /*5 14*/ s32 unk14;
    /*6 18*/ s32 unk18;
    /*7 1C*/ s32 playerHealthMax;
    /*8 20*/ s32 playerMagicMax;
    /*9 24*/ s32 sidekickMaxFood;
    };
    s32 items[10];
} CmdmenuPlayerSidekickData;

typedef struct {
/*00*/ s32 min;
/*04*/ s32 max;
/*08*/ u32 width;
/*0C*/ u32 height;
/*10*/ f32 filledWidth;
/*14*/ u8 alpha;
/*18*/ TextureTile fullbarTex[2]; // official name: Fullbartex (default.dol)
/*30*/ TextureTile emptybarTex[2]; // official name: Emptybartex (default.dol)
/*48*/ s32 scale;
/*4C_0*/ u32 fadeout : 1;
} EnergyBar;

typedef union {
    struct {
    /*0 00*/ f32 playerHealth;
    /*1 04*/ f32 sidekickBlueFood;
    /*2 08*/ f32 playerMagic;
    /*3 0C*/ f32 playerScarabCount;
    /*4 10*/ f32 sidekickRedFood;
    /*5 14*/ f32 unk14;
    /*6 18*/ f32 unk18;
    /*7 1C*/ f32 playerHealthMax;
    /*8 20*/ f32 playerMagicMax;
    /*9 24*/ f32 sidekickMaxFood;
    };
    f32 items[10];
} CmdmenuPlayerSidekickDataChangeTimers;

enum CmdMenuTextures {
    CMDMENU_TEX_00_Scroll_BG = 0,
    CMDMENU_TEX_01_Scroll_Bottom = 1,
    CMDMENU_TEX_02_Scroll_Top = 2,
    CMDMENU_TEX_03_InfoScroll_Roll_End = 3,
    CMDMENU_TEX_04_InfoScroll_Roll = 4,
    CMDMENU_TEX_05_InfoScroll_Side = 5,
    CMDMENU_TEX_06_InfoScroll_BG = 6,
    CMDMENU_TEX_07_InfoScroll_SelfShadow = 7,
    CMDMENU_TEX_08_Apple_0_Pct = 8,
    CMDMENU_TEX_09_Apple_25_Pct = 9,
    CMDMENU_TEX_10_Apple_50_Pct = 10,
    CMDMENU_TEX_11_Apple_75_Pct = 11,
    CMDMENU_TEX_12_Mushroom_Blue_Full = 12,
    CMDMENU_TEX_13_Grub_Blue_Full = 13,
    CMDMENU_TEX_14 = 14,
    CMDMENU_TEX_15 = 15,
    CMDMENU_TEX_16_Grub_Blue_Half = 16,
    CMDMENU_TEX_17_Apple_100_Pct = 17,
    CMDMENU_TEX_18_Scarab = 18,
    CMDMENU_TEX_19_Scarab_Flutter_Frame1 = 19,
    CMDMENU_TEX_20_Scarab_Flutter_Frame2 = 20,
    CMDMENU_TEX_21_Scarab_Flutter_Frame3 = 21,
    CMDMENU_TEX_22_Scarab_Spin_Frame1 = 22,
    CMDMENU_TEX_23_Scarab_Spin_Frame2 = 23,
    CMDMENU_TEX_24_Scarab_Spin_Frame3 = 24,
    CMDMENU_TEX_25_Scarab_Spin_Frame4 = 25,
    CMDMENU_TEX_26_Scarab_Spin_Frame5 = 26,
    CMDMENU_TEX_27_Scarab_Spin_Frame6 = 27,
    CMDMENU_TEX_28_Scarab_Spin_Frame7 = 28,
    CMDMENU_TEX_29_Page_Torn_Left = 29,
    CMDMENU_TEX_30_Page_Torn_Right = 30,
    CMDMENU_TEX_31_Highlight_Corner_Top_Left = 31,
    CMDMENU_TEX_32_Highlight_Corner_Top_Right = 32,
    CMDMENU_TEX_33_Highlight_Corner_Bottom_Left = 33,
    CMDMENU_TEX_34_Highlight_Corner_Bottom_Right = 34,
    CMDMENU_TEX_35_MagicBar_Empty = 35,
    CMDMENU_TEX_36_MagicBar_Full = 36,
    CMDMENU_TEX_37_C_Down = 37,
    CMDMENU_TEX_38_LeftDownButtons_With_Kyte = 38,
    CMDMENU_TEX_39_C_Left = 39,
    CMDMENU_TEX_40_Sabre = 40,
    CMDMENU_TEX_41_C_Right = 41,
    CMDMENU_TEX_42_Tricky = 42,
    CMDMENU_TEX_43_LeftDownButtons_With_Tricky = 43,
    CMDMENU_TEX_44_Mushroom_Empty = 44,
    CMDMENU_TEX_45_Mushroom_Red_Full = 45,
    CMDMENU_TEX_46_Mushroom_Red_Half = 46,
    CMDMENU_TEX_47_RightButton_With_Bag = 47,
    CMDMENU_TEX_48_LeftDownButtons_NoSidekick = 48,
    CMDMENU_TEX_49_MagicBook = 49,
    CMDMENU_TEX_50_Bag = 50,
    CMDMENU_TEX_51_Mushroom_Blue_Half = 51,
    CMDMENU_TEX_52_Page_Torn_Shadow = 52,
    CMDMENU_TEX_53_Krystal = 53,
    CMDMENU_TEX_54_Kyte = 54,
    CMDMENU_TEX_55_Grub_Empty = 55,
    CMDMENU_TEX_56_Grub_Red_Full = 56,
    CMDMENU_TEX_57_Grub_Red_Half = 57
};

/*0x0*/ static s8 dInventoryShow = FALSE;
/*0x4*/ static s8 sInventoryScrollOffset = 0;   //Y offset for the scroll's inner strip, used to smoothly animate moving between inventory items
/*0x8*/ static s8 dInventoryMoveSpeed = 1;      //Scroll speed when moving between inventory items (how many times to shift gUpdateRate)
/*0xC*/ static s16 dInventoryUnrollMax = 72;    //The height of the inventory scroll when fully open
/*0x10*/ static s16 dOpacityInventoryScroll = 0;
/*0x14*/ static s16 _data_14 = 0;
/*0x18*/ static s16 _data_18 = -1;
/*0x1C*/ static s8 _data_1C = 0;
/*0x20*/ static s16 _data_20 = 60;
/*0x24*/ static s16 _data_24 = 50;
/*0x28*/ static s16 _data_28 = 20;
/*0x2C*/ static s16 _data_2C = 160;
/*0x30*/ static s16 dOpacityInfoScroll = 0;

/** 
  * Lines of text for the info scroll 
  */
/*0x34*/ static char* dTextStrings[] = {
    NULL, NULL, NULL, NULL
};

/** 
  * StringID for the info scroll's gametext
  *
  * (First 255 lines are from `gametext_3`, higher IDs use `gametext_568`) 
  */
/*0x44*/ static s16 dGametextStringID = NO_GAMETEXT;

/*0x48*/ static s8 _data_48 = 0;
/*0x4C*/ static s16 _data_4C = 120;
/*0x50*/ static s16 _data_50 = 80;
/*0x54*/ static s16 _data_54 = 20;
/*0x58*/ static s16 _data_58 = 160;
/*0x5C*/ static s16 _data_5C = 0;
/*0x60*/ static s16 _data_60 = 0;
/*0x64*/ static s16 _data_64 = -1;
/*0x68*/ static Texture* dInventoryPageIcon = NULL; //Icon in the top-right corner of screen: Bag/SpellBook/Kyte/Tricky
/*0x6C*/ static u32 _data_6C[] = {
    0x3f800000, 0xff000000
};
/*0x74*/ static s8 sJoyButtonMask = 0;
/*0x78*/ static s16 _data_78 = 0;
/*0x7C*/ static u8 _data_7C = 0;
/*0x80*/ static u8 sForceStatsDisplay = FALSE;
/*0x84*/ static s16 _data_84 = 0;
/*0x88*/ static s8 _data_88 = 1;
/*0x8C*/ static s16 dSpellGamebits[] = {
    BIT_Spell_Projectile, 
    BIT_Spell_Illusion, 
    BIT_Spell_Forcefield, 
    BIT_Spell_Portal, 
    BIT_Spell_Ice_Blast, 
    BIT_Spell_Mind_Read, 
    BIT_Spell_Grenade
};
/*0x9C*/ static s16 dSpellTextableIDs[] = {
    TEXTABLE_578_CMDMENU_ProjectileSpell_NoBG, 
    TEXTABLE_57A_CMDMENU_IllusionSpell_NoBG, 
    TEXTABLE_57D_CMDMENU_ShieldSpell_NoBG, 
    TEXTABLE_57C_CMDMENU_PortalSpell_NoBG, 
    TEXTABLE_57B_CMDMENU_IceSpell_NoBG, 
    TEXTABLE_57E_CMDMENU_UnkSpell_NoBG, 
    TEXTABLE_579_CMDMENU_GrenadeSpell_NoBG
};
/*0xAC*/ static s16 dCommandTextableIDs[] = {
    TEXTABLE_57F_CMDMENU_FindCommand_NoBG, 
    TEXTABLE_57F_CMDMENU_FindCommand_NoBG, 
    TEXTABLE_581_CMDMENU_DistractCommand_NoBG, 
    TEXTABLE_580_CMDMENU_GuardCommand_NoBG, 
    TEXTABLE_582_CMDMENU_FlameCommand_NoBG, 
    TEXTABLE_583_CMDMENU_TrickyBall_NoBG
};
/*0xB8*/ static s16 _data_B8[10][2] = {
    {NO_SOUND, NO_SOUND}, 
    {NO_SOUND, NO_SOUND}, 
    {NO_SOUND, NO_SOUND}, 
    {NO_SOUND, NO_SOUND}, 
    {NO_SOUND, NO_SOUND}, 
    {NO_SOUND, NO_SOUND}, 
    {NO_SOUND, NO_SOUND}, 
    {NO_SOUND, NO_SOUND}, 
    {0, 0}, 
    {0, 0}
};
/*0xE0*/ static u16 _data_E0[] = {
    0x0d05, 0x1310, 0x040a, 0x0c16, 
    0x0416, 0x0c20, 0x0d16, 0x1328, 
    0x140a, 0x1c16, 0x1416, 0x1c20, 
    0x0b00, 0x150a, 0x0204, 0x0c10, 
    0x0417, 0x0c28, 0x0b20, 0x152c, 
    0x1417, 0x1c28, 0x1404, 0x1e10, 
    0x080e, 0x1812, 0x0812, 0x1818
};
/*0x118*/ static s8 _data_118 = 0;
/*0x11C*/ static s8 _data_11C = 0;
/*0x120*/ static s8 _data_120 = 0;
/*0x124*/ static s8 _data_124 = 0;

#define NONE 0xFFFF
#define EXIT -1
#define END {NONE, NONE, NONE, NONE, 0x0000, 0x00, 0x00}

/* Krystal items
 * 0x128*/ static InventoryItem dPage0ItemsKrystal[] = {
    {BIT_Krystal_Warp_Crystal,   BIT_Krystal_Used_Warp_Crystal,    TEXTABLE_245, NONE,  0x010, EXIT,                                CMDMENU_SOUND_ITEM}, //Warp Crystal
    {BIT_CRF_Prison_Key_1,       NONE,                             TEXTABLE_175, NONE,  0x007, EXIT,                                CMDMENU_SOUND_ITEM}, //Prison Key (CloudRunner Fortress)
    {BIT_CRF_Power_Room_Key,     NONE,                             TEXTABLE_176, NONE,  0x008, EXIT,                                CMDMENU_SOUND_ITEM}, //Power Room Key (CloudRunner Fortress)
    {BIT_CRF_Red_Power_Crystal,  NONE,                             TEXTABLE_180, NONE,  0x009, EXIT,                                CMDMENU_SOUND_ITEM}, //Red Power Crystal (CloudRunner Fortress)
    {BIT_CRF_Green_Power_Crystal,NONE,                             TEXTABLE_181, NONE,  0x009, EXIT,                                CMDMENU_SOUND_ITEM}, //Green Power Crystal (CloudRunner Fortress)
    {BIT_CRF_Blue_Power_Crystal, NONE,                             TEXTABLE_182, NONE,  0x009, EXIT,                                CMDMENU_SOUND_ITEM}, //Blue Power Crystal (CloudRunner Fortress)
    {BIT_IM_Snowbike_Key,        NONE,                             TEXTABLE_175, NONE,  0x011, EXIT,                                CMDMENU_SOUND_ITEM}, //Snowbike Key (Removed)
    {BIT_DIM_Mine_Key,           BIT_DIM_Used_Mine_Key,            TEXTABLE_175, NONE,  0x013, EXIT,                                CMDMENU_SOUND_ITEM}, //Mine Key (unused?)
    {BIT_DIM_Alpine_Roots,       NONE,                             TEXTABLE_1A3, NONE,  0x00b, EXIT,                                CMDMENU_SOUND_ITEM}, //Alpine Root (unused?)
    {BIT_DIM_Gear_1,             BIT_DIM_Used_Gear_1,              TEXTABLE_479, NONE,  0x00b, EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 1
    {BIT_DIM_Gear_2,            BIT_DIM_Used_Gear_2,              TEXTABLE_479,  NONE,  0x00b, EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 2
    {BIT_DIM_Gear_3,            BIT_DIM_Used_Gear_3,              TEXTABLE_479,  NONE,  0x00b, EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 3
    {BIT_DIM_Gear_4,            BIT_DIM_Used_Gear_4,              TEXTABLE_479,  NONE,  0x00b, EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 4
    {BIT_Krystal_Foodbag_S,     BIT_Krystal_Foodbag_M,            TEXTABLE_27A,  NONE,  0x016, CMDMENU_PAGE_2_Food_Actions_Krystal, CMDMENU_SOUND_PAGE}, //Small Food Bag
    {BIT_Krystal_Foodbag_M,     BIT_Krystal_Foodbag_L,            TEXTABLE_244,  NONE,  0x017, CMDMENU_PAGE_2_Food_Actions_Krystal, CMDMENU_SOUND_PAGE}, //Medium Food Bag
    {BIT_Krystal_Foodbag_L,     NONE,                             TEXTABLE_2BF,  NONE,  0x018, CMDMENU_PAGE_2_Food_Actions_Krystal, CMDMENU_SOUND_PAGE}, //Large Food Bag
    {BIT_Krystal_Dino_Bag_S,    BIT_Krystal_Dino_Bag_M,           TEXTABLE_471,  NONE,  0x02f, CMDMENU_PAGE_9_Food_Actions_Kyte,    CMDMENU_SOUND_PAGE}, //Small Grub Bag
    {BIT_Krystal_Dino_Bag_M,    BIT_Krystal_Dino_Bag_L,           TEXTABLE_560,  NONE,  0x030, CMDMENU_PAGE_9_Food_Actions_Kyte,    CMDMENU_SOUND_PAGE}, //Medium Grub Bag
    {BIT_Krystal_Dino_Bag_L,    NONE,                             TEXTABLE_560,  NONE,  0x031, CMDMENU_PAGE_9_Food_Actions_Kyte,    CMDMENU_SOUND_PAGE}, //Large Grub Bag
    {BIT_Gold_Nugget_GP,        BIT_CC_Bribed_GuardClaw,          TEXTABLE_257,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //Gold Nugget #1 (Near Golden Plains)
    {BIT_Gold_Nugget_LFV,       BIT_CC_Rescued_Kyte,              TEXTABLE_257,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //Gold Nugget #2 (Near LightFoot Village)
    {BIT_CC_Fire_Crystal,       NONE,                             TEXTABLE_4F7,  NONE,  0x102, EXIT,                                CMDMENU_SOUND_ITEM}, //Fire Crystal
    {BIT_CC_Cell_Door_Key,      BIT_CC_Rescued_Kyte,              TEXTABLE_175,  NONE,  0x01e, EXIT,                                CMDMENU_SOUND_ITEM}, //Cell Door Key (Cape Claw?)
    {BIT_SpellStone_CRF,        NONE,                             TEXTABLE_562,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //SpellStone - CloudRunner Fortress (Inactive)
    {BIT_SpellStone_BWC,        NONE,                             TEXTABLE_562,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //SpellStone - BlackWater Canyon (Inactive)
    {BIT_SpellStone_KP,         NONE,                             TEXTABLE_562,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //SpellStone - Krazoa Palace (Inactive)
    {BIT_Krazoa_Translator,     NONE,                             TEXTABLE_496,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //Krazoa Translator
    {BIT_Horn_of_Truth,         NONE,                             TEXTABLE_258,  NONE,  0x01d, EXIT,                                CMDMENU_SOUND_ITEM}, //Horn of Truth
    {BIT_CRF_Treasure_Chest_Key,NONE,                             TEXTABLE_568,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //Treasure Chest Key (CloudRunner Fortress)
    {BIT_CloudRunner_Grubs,     NONE,                             TEXTABLE_1A5,  NONE,  0x02a, EXIT,                                CMDMENU_SOUND_ITEM}, //Blue Mushroom (CloudRunner Grubs?)
    {BIT_Krystal_Fireflies,     NONE,                             TEXTABLE_46D,  NONE,  0x03d, EXIT,                                CMDMENU_SOUND_ITEM}, //Firefly Lantern
    {BIT_CRF_Prison_Key_2,      NONE,                             TEXTABLE_175,  NONE,  0x007, EXIT,                                CMDMENU_SOUND_ITEM}, //Prison Key (CloudRunner Fortress)
    {BIT_CC_Krazoa_Tablets,     NONE,                             TEXTABLE_496,  NONE,  0x05b, EXIT,                                CMDMENU_SOUND_ITEM}, //Krazoa Tablets
    {BIT_Inventory_MoonSeeds,   NONE,                             TEXTABLE_40D,  NONE,  0x05e, EXIT,                                CMDMENU_SOUND_ITEM}, //MoonSeeds
    {BIT_CC_Engineers_Key,      NONE,                             TEXTABLE_175,  NONE,  0x064, EXIT,                                CMDMENU_SOUND_ITEM}, //Construction Engineer's Key (CloudRunner Fortress)
    {BIT_Gold_Nugget_CC,        BIT_CC_Bribed_GuardClaw,          TEXTABLE_257,  NONE,  0x103, EXIT,                                CMDMENU_SOUND_ITEM}, //Gold Nugget #3 (Cape Claw)
    END
};

/* Sabre items
 * 0x2E4*/ static InventoryItem dPage1ItemsSabre[] = {
    {BIT_SP_Krazoa_Translator,       NONE,                         TEXTABLE_175, NONE,  0x0a,  EXIT,                                CMDMENU_SOUND_ITEM}, //Gate Key (Northern Wastes) (Unused?)
    {BIT_SW_Alpine_Roots,            NONE,                         TEXTABLE_1A3, NONE,  0x0b,  EXIT,                                CMDMENU_SOUND_ITEM}, //Alpine Root (Geyser area)
    {BIT_Inventory_Blue_Mushrooms,   NONE,                         TEXTABLE_1A5, NONE,  0x0c,  EXIT,                                CMDMENU_SOUND_ITEM}, //Blue Mushroom
    {BIT_Inventory_Purple_Mushrooms, NONE,                         TEXTABLE_498, NONE,  0x57,  EXIT,                                CMDMENU_SOUND_ITEM}, //Purple Mushroom
    {BIT_Inventory_White_Mushrooms,  NONE,                         TEXTABLE_497, NONE,  0x56,  EXIT,                                CMDMENU_SOUND_ITEM}, //White Mushroom
    {BIT_DIM_Mine_Key,               BIT_DIM_Used_Mine_Key,        TEXTABLE_175, NONE,  0x13,  EXIT,                                CMDMENU_SOUND_ITEM}, //Mine Key
    {BIT_DIM_Alpine_Roots,           NONE,                         TEXTABLE_1A3, NONE,  0x0b,  EXIT,                                CMDMENU_SOUND_ITEM}, //Alpine Root (DIM)
    {BIT_DIM_Gear_1,                 BIT_DIM_Used_Gear_1,          TEXTABLE_479, NONE,  0x0b,  EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 1 
    {BIT_DIM_Gear_2,                 BIT_DIM_Used_Gear_2,          TEXTABLE_479, NONE,  0x0b,  EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 2
    {BIT_DIM_Gear_3,                 BIT_DIM_Used_Gear_3,          TEXTABLE_479, NONE,  0x0b,  EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 3
    {BIT_DIM_Gear_4,                BIT_DIM_Used_Gear_4,          TEXTABLE_479,  NONE,  0x0b,  EXIT,                                CMDMENU_SOUND_ITEM}, //DIM Gear 4
    {BIT_Belina_Te_Cell_Key,        BIT_Used_Belina_Te_Cell_Key,  TEXTABLE_175,  NONE,  0x19,  EXIT,                                CMDMENU_SOUND_ITEM}, //Belina Te Cell Key (DarkIce Mines)
    {BIT_Tricky_Cell_Key,           BIT_Used_Tricky_Cell_Key,     TEXTABLE_175,  NONE,  0x19,  EXIT,                                CMDMENU_SOUND_ITEM}, //Tricky Cell Key (DarkIce Mines)
    {BIT_Sabre_Warp_Crystal,        BIT_Sabre_Used_Warp_Crystal,  TEXTABLE_245,  NONE,  0x10,  EXIT,                                CMDMENU_SOUND_ITEM}, //Warp Crystal
    {BIT_DIM_Door_Key_1,            BIT_DIM_Used_Door_Key_1,      TEXTABLE_175,  NONE,  0x19,  EXIT,                                CMDMENU_SOUND_ITEM}, //Door Key 1 (DarkIce Mines)
    {BIT_DIM_Door_Key_2,            BIT_DIM_Used_Door_Key_2,      TEXTABLE_175,  NONE,  0x19,  EXIT,                                CMDMENU_SOUND_ITEM}, //Door Key 2 (DarkIce Mines)
    {BIT_Sabre_Foodbag_S,           BIT_Sabre_Foodbag_M,          TEXTABLE_27A,  NONE,  0x16,  CMDMENU_PAGE_3_Food_Actions_Sabre,   CMDMENU_SOUND_PAGE}, //Small Food Bag
    {BIT_Sabre_Foodbag_M,           BIT_Sabre_Foodbag_L,          TEXTABLE_244,  NONE,  0x17,  CMDMENU_PAGE_3_Food_Actions_Sabre,   CMDMENU_SOUND_PAGE}, //Medium Food Bag
    {BIT_Sabre_Foodbag_L,           NONE,                         TEXTABLE_2BF,  NONE,  0x18,  CMDMENU_PAGE_3_Food_Actions_Sabre,   CMDMENU_SOUND_PAGE}, //Large Food Bag
    {BIT_Sabre_Dino_Bag_S,          BIT_Sabre_Dino_Bag_M,         TEXTABLE_471,  NONE,  0x32,  CMDMENU_PAGE_10_Food_Actions_Tricky, CMDMENU_SOUND_PAGE}, //Small Dinosaur Food Bag
    {BIT_Sabre_Dino_Bag_M,          BIT_Sabre_Dino_Bag_L,         TEXTABLE_560,  NONE,  0x33,  CMDMENU_PAGE_10_Food_Actions_Tricky, CMDMENU_SOUND_PAGE}, //Medium Dinosaur Food Bag
    {BIT_Sabre_Dino_Bag_L,          NONE,                         TEXTABLE_560,  NONE,  0x34,  CMDMENU_PAGE_10_Food_Actions_Tricky, CMDMENU_SOUND_PAGE}, //Large Dinosaur Food Bag
    {BIT_Inventory_Corrupt_Item,    NONE,                         TEXTABLE_175,  NONE,  0x1d,  EXIT,                                CMDMENU_SOUND_ITEM}, //Corrupted? A key with "ForceField Spell (Cape Claw)" as its description
    {BIT_Horn_of_Truth,             NONE,                         TEXTABLE_258,  NONE,  0x1d,  EXIT,                                CMDMENU_SOUND_ITEM}, //Horn of Truth
    {BIT_Sabre_Fireflies,           NONE,                         TEXTABLE_46D,  NONE,  0x3d,  EXIT,                                CMDMENU_SOUND_ITEM}, //Firefly Lantern
    {BIT_WC_Silver_Tooth,           BIT_WC_Used_Silver_Tooth,     TEXTABLE_52B,  NONE,  0x00,  EXIT,                                CMDMENU_SOUND_ITEM}, //Silver Tooth (Walled City)
    {BIT_WC_Gold_Tooth,             BIT_WC_Used_Gold_Tooth,       TEXTABLE_52A,  NONE,  0x00,  EXIT,                                CMDMENU_SOUND_ITEM}, //Gold Tooth (Walled City)
    {BIT_WC_Sun_Stone,              BIT_WC_Used_Sun_Stone,        TEXTABLE_3A8,  NONE,  0x1b,  EXIT,                                CMDMENU_SOUND_ITEM}, //Sun Stone (Walled City)
    {BIT_WC_Moon_Stone,             BIT_WC_Used_Moon_Stone,       TEXTABLE_3D6,  NONE,  0x1c,  EXIT,                                CMDMENU_SOUND_ITEM}, //Moon Stone (Walled City)
    {BIT_Inventory_MoonSeeds,       NONE,                         TEXTABLE_40D,  NONE,  0x62,  EXIT,                                CMDMENU_SOUND_ITEM}, //MoonSeeds
    {BIT_SpellStone_DIM,            BIT_SpellStone_DIM_Activated, TEXTABLE_562,  NONE,  0x60,  EXIT,                                CMDMENU_SOUND_ITEM}, //SpellStone - DarkIce Mines (Inactive)
    {BIT_SpellStone_DIM_Activated,  NONE,                         TEXTABLE_563,  NONE,  0x61,  EXIT,                                CMDMENU_SOUND_ITEM}, //SpellStone - DarkIce Mines (Activated) 
    {BIT_SpellStone_WC,             NONE,                         TEXTABLE_180,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //Spellstone - Walled City (Inactive) (Incorrect icon: Red Power Crystal, CRF)
    {BIT_SpellStone_DR,             NONE,                         TEXTABLE_180,  NONE,  NONE,  EXIT,                                CMDMENU_SOUND_ITEM}, //Spellstone - Dragon Rock (Inactive) (Incorrect icon: Red Power Crystal, CRF)
    {BIT_DB_PointBack_Egg,          NONE,                         TEXTABLE_55E,  NONE,  0x5e,  EXIT,                                CMDMENU_SOUND_ITEM}, //PointBack Egg (Diamond Bay)
    {BIT_DB_Bay_Diamond,            NONE,                         TEXTABLE_55F,  NONE,  0x5f,  EXIT,                                CMDMENU_SOUND_ITEM}, //Bay Diamond
    END
};

/* Food Bag actions (Krystal)
 * 0x4A0*/ static InventoryItem dPage2FoodActionsKrystal[] = {
    {BIT_Foodbag_Eat,               NONE, TEXTABLE_2C7, NONE, 0x1f, CMDMENU_PAGE_4_Food_Krystal,            CMDMENU_SOUND_PAGE}, //Eat food in foodbag
    {BIT_Foodbag_Place,             NONE, TEXTABLE_2C8, NONE, 0x20, CMDMENU_PAGE_4_Food_Krystal,            CMDMENU_SOUND_PAGE}, //Place food down from foodbag
    {BIT_Foodbag_Give,              NONE, TEXTABLE_2EF, NONE, 0x21, CMDMENU_PAGE_4_Food_Krystal,            CMDMENU_SOUND_PAGE}, //Give food from foodbag
    {BIT_Foodbag_Setting_Eat_First, NONE, TEXTABLE_265, NONE, 0x39, CMDMENU_PAGE_2_Food_Actions_Krystal,    CMDMENU_SOUND_PAGE}, //Eat later (NOTE: option to switch shown when "Eat First" enabled)
    {BIT_Foodbag_Setting_Eat_Later, NONE, TEXTABLE_529, NONE, 0x3a, CMDMENU_PAGE_2_Food_Actions_Krystal,    CMDMENU_SOUND_PAGE}, //Eat first (NOTE: option to switch shown when "Eat Later" enabled)
    END
};

/* Food Bag actions (Sabre)
 * 0x4E8*/ static InventoryItem dPage3FoodActionsSabre[] = {
    {BIT_Foodbag_Eat,               NONE, TEXTABLE_2C7, NONE, 0x1f, CMDMENU_PAGE_5_Food_Sabre,              CMDMENU_SOUND_PAGE}, //Eat food in foodbag
    {BIT_Foodbag_Place,             NONE, TEXTABLE_2C8, NONE, 0x20, CMDMENU_PAGE_5_Food_Sabre,              CMDMENU_SOUND_PAGE}, //Place food down from foodbag
    {BIT_Foodbag_Give,              NONE, TEXTABLE_2EF, NONE, 0x21, CMDMENU_PAGE_5_Food_Sabre,              CMDMENU_SOUND_PAGE}, //Give food from foodbag
    {BIT_Foodbag_Setting_Eat_First, NONE, TEXTABLE_265, NONE, 0x39, CMDMENU_PAGE_3_Food_Actions_Sabre,      CMDMENU_SOUND_PAGE}, //Eat later (NOTE: option to switch shown when "Eat First" enabled)
    {BIT_Foodbag_Setting_Eat_Later, NONE, TEXTABLE_529, NONE, 0x3a, CMDMENU_PAGE_3_Food_Actions_Sabre,      CMDMENU_SOUND_PAGE}, //Eat first (NOTE: option to switch shown when "Eat Later" enabled)
    END
};

/* Food Bag items (Krystal)
 * 0x530*/ static InventoryItem dPage4FoodItemsKrystal[] = {
    {BIT_Green_Apple_Count,  NONE,                 TEXTABLE_26E,  NONE, 0x22, EXIT,                                 CMDMENU_SOUND_ITEM}, //Green apple
    {BIT_Red_Apple_Count,    NONE,                 TEXTABLE_26F,  NONE, 0x23, EXIT,                                 CMDMENU_SOUND_ITEM}, //Red apple
    {BIT_Brown_Apple_Count,  NONE,                 TEXTABLE_270,  NONE, 0x24, EXIT,                                 CMDMENU_SOUND_ITEM}, //Brown Apple
    {BIT_Fish_Count,         NONE,                 TEXTABLE_272,  NONE, 0x25, EXIT,                                 CMDMENU_SOUND_ITEM}, //Fish
    {BIT_Smoked_Fish_Count,  NONE,                 TEXTABLE_2C6,  NONE, 0x26, EXIT,                                 CMDMENU_SOUND_ITEM}, //Smoked Fish
    {BIT_Dino_Egg_Count,     NONE,                 TEXTABLE_2C4,  NONE, 0x27, EXIT,                                 CMDMENU_SOUND_ITEM}, //Dino Egg
    {BIT_Moldy_Meat_Count,   NONE,                 TEXTABLE_2C5,  NONE, 0x28, EXIT,                                 CMDMENU_SOUND_ITEM}, //Moldy Meat
    {BIT_Green_Bean_Count,   NONE,                 TEXTABLE_270,  NONE, 0x35, EXIT,                                 CMDMENU_SOUND_ITEM}, //Green Bean
    {BIT_Red_Bean_Count,     NONE,                 TEXTABLE_270,  NONE, 0x36, EXIT,                                 CMDMENU_SOUND_ITEM}, //Red Bean
    {BIT_Brown_Bean_Count,   NONE,                 TEXTABLE_270,  NONE, 0x37, EXIT,                                 CMDMENU_SOUND_ITEM}, //Brown Bean
    {BIT_Blue_Bean_Count,   NONE,                  TEXTABLE_270,  NONE, 0x38, EXIT,                                 CMDMENU_SOUND_ITEM}, //Blue Bean
    {BIT_Krystal_Foodbag_S, BIT_Krystal_Foodbag_M, TEXTABLE_27A,  NONE, 0x16, CMDMENU_PAGE_2_Food_Actions_Krystal,  CMDMENU_SOUND_PAGE}, //Small Food Bag
    {BIT_Krystal_Foodbag_M, BIT_Krystal_Foodbag_L, TEXTABLE_244,  NONE, 0x17, CMDMENU_PAGE_2_Food_Actions_Krystal,  CMDMENU_SOUND_PAGE}, //Medium Food Bag
    {BIT_Krystal_Foodbag_L, NONE,                  TEXTABLE_2BF,  NONE, 0x18, CMDMENU_PAGE_2_Food_Actions_Krystal,  CMDMENU_SOUND_PAGE}, //Large Food Bag
    END
};

/* Food Bag items (Sabre)
 * 0x5E4*/ static InventoryItem dPage5FoodItemsSabre[] = {
    {BIT_Green_Apple_Count,  NONE,                 TEXTABLE_26E,  NONE, 0x22, EXIT,                                 CMDMENU_SOUND_ITEM}, //Green apple
    {BIT_Red_Apple_Count,    NONE,                 TEXTABLE_26F,  NONE, 0x23, EXIT,                                 CMDMENU_SOUND_ITEM}, //Red apple
    {BIT_Brown_Apple_Count,  NONE,                 TEXTABLE_270,  NONE, 0x24, EXIT,                                 CMDMENU_SOUND_ITEM}, //Brown Apple
    {BIT_Fish_Count,         NONE,                 TEXTABLE_272,  NONE, 0x25, EXIT,                                 CMDMENU_SOUND_ITEM}, //Fish
    {BIT_Smoked_Fish_Count,  NONE,                 TEXTABLE_2C6,  NONE, 0x26, EXIT,                                 CMDMENU_SOUND_ITEM}, //Smoked Fish
    {BIT_Dino_Egg_Count,     NONE,                 TEXTABLE_2C4,  NONE, 0x27, EXIT,                                 CMDMENU_SOUND_ITEM}, //Dino Egg
    {BIT_Moldy_Meat_Count,   NONE,                 TEXTABLE_2C5,  NONE, 0x28, EXIT,                                 CMDMENU_SOUND_ITEM}, //Moldy Meat
    {BIT_Green_Bean_Count,   NONE,                 TEXTABLE_270,  NONE, 0x35, EXIT,                                 CMDMENU_SOUND_ITEM}, //Green Bean 
    {BIT_Red_Bean_Count,     NONE,                 TEXTABLE_270,  NONE, 0x36, EXIT,                                 CMDMENU_SOUND_ITEM}, //Red Bean
    {BIT_Brown_Bean_Count,   NONE,                 TEXTABLE_270,  NONE, 0x37, EXIT,                                 CMDMENU_SOUND_ITEM}, //Brown Bean
    {BIT_Blue_Bean_Count,   NONE,                  TEXTABLE_270,  NONE, 0x38, EXIT,                                 CMDMENU_SOUND_ITEM}, //Blue Bean
    {BIT_Sabre_Foodbag_S,   BIT_Sabre_Foodbag_M,   TEXTABLE_27A,  NONE, 0x16, CMDMENU_PAGE_3_Food_Actions_Sabre,    CMDMENU_SOUND_PAGE}, //Small Food Bag
    {BIT_Sabre_Foodbag_M,   BIT_Sabre_Foodbag_L,   TEXTABLE_244,  NONE, 0x17, CMDMENU_PAGE_3_Food_Actions_Sabre,    CMDMENU_SOUND_PAGE}, //Medium Food Bag
    {BIT_Sabre_Foodbag_L,   NONE,                  TEXTABLE_2BF,  NONE, 0x18, CMDMENU_PAGE_3_Food_Actions_Sabre,    CMDMENU_SOUND_PAGE}, //Large Food Bag
    END
};

/* Magic Spells
 * 0x698*/ static InventoryItem dPage6MagicSpells[] = {
    {BIT_Spell_Projectile, NONE,    TEXTABLE_183, NONE, 0x0d, EXIT, CMDMENU_SOUND_NONE}, //Projectile Spell
    {BIT_Spell_Ice_Blast,  NONE,    TEXTABLE_468, NONE, 0x3c, EXIT, CMDMENU_SOUND_NONE}, //Ice Blast Spell
    {BIT_Spell_Grenade,    NONE,    TEXTABLE_4F8, NONE, 0x0f, EXIT, CMDMENU_SOUND_NONE}, //Grenade Spell (Incorrectly labelled as Randorn)
    {BIT_Spell_Illusion,   NONE,    TEXTABLE_177, NONE, 0x0e, EXIT, CMDMENU_SOUND_NONE}, //Illusion Spell
    {BIT_Spell_Forcefield, NONE,    TEXTABLE_265, NONE, 0x14, EXIT, CMDMENU_SOUND_NONE}, //ForceField Spell
    {BIT_Spell_Glitched_1, NONE,    TEXTABLE_183, NONE, 0x0d, EXIT, CMDMENU_SOUND_NONE}, //Glitched Spell
    {BIT_Spell_Glitched_2, BIT_348, TEXTABLE_529, NONE, 0x0d, EXIT, CMDMENU_SOUND_NONE}, //Glitched Spell (Maybe "Quake", mentioned elsewhere?)
    {BIT_Spell_Portal,     NONE,    TEXTABLE_466, NONE, 0x3b, EXIT, CMDMENU_SOUND_NONE}, //Portal Spell
    {BIT_Spell_Mind_Read,  NONE,    TEXTABLE_470, NONE, 0x3e, EXIT, CMDMENU_SOUND_NONE}, //Mind Read
    END
};

//TODO: should sidekick pages use an InventoryItem struct variant with slightly different member names?
/* Sidekick Commands (Kyte)
 * 0x710*/ static InventoryItem dPage7CommandsKyte[] = {
    {Sidekick_COMMAND_01_Heel,      0, TEXTABLE_1CD, TEXTABLE_1CD, 0, 0, 0}, //Heel
    {Sidekick_COMMAND_20_Play,      5, TEXTABLE_1D1, TEXTABLE_1D1, 6, 0, 0}, //Play
    {Sidekick_COMMAND_02_Find,      1, TEXTABLE_1CE, TEXTABLE_1CE, 1, 0, 0}, //Find
    {Sidekick_COMMAND_10_Flame,     4, TEXTABLE_1CF, TEXTABLE_1CF, 2, 0, 0}, //Flame
    {Sidekick_COMMAND_04_Distract,  2, TEXTABLE_1D0, TEXTABLE_1D0, 3, 0, 0}, //Distract
    {Sidekick_COMMAND_08_Guard,     3, TEXTABLE_1D2, TEXTABLE_1D2, 4, 0, 0}, //Guard
    END
};

/* Sidekick Commands (Tricky)
 * 0x764*/ static InventoryItem sPage8CommandsTricky[] = {
    {Sidekick_COMMAND_01_Heel,      0, TEXTABLE_1CD, TEXTABLE_1CD, 0, 0, 0}, //Heel
    {Sidekick_COMMAND_20_Play,      5, TEXTABLE_1D1, TEXTABLE_1D1, 6, 0, 0}, //Play
    {Sidekick_COMMAND_02_Find,      1, TEXTABLE_1CE, TEXTABLE_1CE, 1, 0, 0}, //Find
    {Sidekick_COMMAND_10_Flame,     4, TEXTABLE_1CF, TEXTABLE_1CF, 2, 0, 0}, //Flame
    {Sidekick_COMMAND_04_Distract,  2, TEXTABLE_1D0, TEXTABLE_1D0, 3, 0, 0}, //Distract
    {Sidekick_COMMAND_08_Guard,     3, TEXTABLE_1D2, TEXTABLE_1D2, 4, 0, 0}, //Guard
    END
};

/* Dinosaur Food Bag Actions (Krystal)
 * 0x7B8*/ static InventoryItem dPage9FoodActionsKyte[] = {
    {BIT_Dino_Foodbag_Place, NONE, TEXTABLE_2C8, NONE, 0x20, CMDMENU_PAGE_11_Food_Kyte, CMDMENU_SOUND_PAGE}, //Place food down from foodbag
    {BIT_Dino_Foodbag_Give,  NONE, TEXTABLE_561, NONE, 0x21, CMDMENU_PAGE_11_Food_Kyte, CMDMENU_SOUND_PAGE}, //Give food from foodbag
    END
};

/* Dinosaur Food Bag Actions (Sabre)
 * 0x7DC*/ static InventoryItem dPage10FoodActionsTricky[] = {
    {BIT_Dino_Foodbag_Place, NONE, TEXTABLE_2C8, NONE, 0x20, CMDMENU_PAGE_12_Food_Tricky, CMDMENU_SOUND_PAGE}, //Place food down from foodbag
    {BIT_Dino_Foodbag_Give,  NONE, TEXTABLE_561, NONE, 0x21, CMDMENU_PAGE_12_Food_Tricky, CMDMENU_SOUND_PAGE}, //Give food from foodbag
    END
};

/* Dinosaur Food Bag Items (Kyte)
 * 0x800*/ static InventoryItem dPage11FoodItemsKyte[] = {
    {BIT_Krystal_Dino_Bag_S,      BIT_Krystal_Dino_Bag_M, TEXTABLE_27A, NONE, 0x2f, CMDMENU_PAGE_9_Food_Actions_Kyte,       CMDMENU_SOUND_PAGE}, //Small Mushroom Bag
    {BIT_Krystal_Dino_Bag_M,      BIT_Krystal_Dino_Bag_L, TEXTABLE_244, NONE, 0x30, CMDMENU_PAGE_9_Food_Actions_Kyte,       CMDMENU_SOUND_PAGE}, //Medium Mushroom Bag
    {BIT_Krystal_Dino_Bag_L,      NONE,                   TEXTABLE_2BF, NONE, 0x31, CMDMENU_PAGE_9_Food_Actions_Kyte,       CMDMENU_SOUND_PAGE}, //Large Mushroom Bag
    {BIT_Dino_Bag_Blue_Mushrooms, NONE,                   TEXTABLE_270, NONE, 0x0c, EXIT,                                   CMDMENU_SOUND_ITEM}, //Blue Mushroom
    {BIT_Dino_Bag_Red_Mushrooms,  NONE,                   TEXTABLE_270, NONE, 0x2d, EXIT,                                   CMDMENU_SOUND_ITEM}, //Red Mushroom
    {BIT_Dino_Bag_Old_Mushrooms,  NONE,                   TEXTABLE_270, NONE, 0x2e, EXIT,                                   CMDMENU_SOUND_ITEM}, //Old Mushroom
    {BIT_Dino_Bag_Blue_Grubs,     NONE,                   TEXTABLE_270, NONE, 0x2a, EXIT,                                   CMDMENU_SOUND_ITEM}, //Blue Grub
    {BIT_Dino_Bag_Red_Grubs,      NONE,                   TEXTABLE_270, NONE, 0x2b, EXIT,                                   CMDMENU_SOUND_ITEM}, //Red Grub
    {BIT_Dino_Bag_Old_Grubs,      NONE,                   TEXTABLE_270, NONE, 0x2c, EXIT,                                   CMDMENU_SOUND_ITEM}, //Old Grub
    END
};

/* Dinosaur Food Bag Items (Tricky)
 * 0x878*/ static InventoryItem dPage12FoodItemsTricky[] = {
    {BIT_Sabre_Dino_Bag_S,        BIT_Sabre_Dino_Bag_M,   TEXTABLE_27A, NONE, 0x32, CMDMENU_PAGE_10_Food_Actions_Tricky,    CMDMENU_SOUND_PAGE}, //Small Mushroom Bag
    {BIT_Sabre_Dino_Bag_M,        BIT_Sabre_Dino_Bag_L,   TEXTABLE_244, NONE, 0x33, CMDMENU_PAGE_10_Food_Actions_Tricky,    CMDMENU_SOUND_PAGE}, //Medium Mushroom Bag
    {BIT_Sabre_Dino_Bag_L,        NONE,                   TEXTABLE_2BF, NONE, 0x34, CMDMENU_PAGE_10_Food_Actions_Tricky,    CMDMENU_SOUND_PAGE}, //Large Mushroom Bag
    {BIT_Dino_Bag_Blue_Mushrooms, NONE,                   TEXTABLE_270, NONE, 0x0c, EXIT,                                   CMDMENU_SOUND_ITEM}, //Blue Mushroom
    {BIT_Dino_Bag_Red_Mushrooms,  NONE,                   TEXTABLE_270, NONE, 0x2d, EXIT,                                   CMDMENU_SOUND_ITEM}, //Red Mushroom
    {BIT_Dino_Bag_Old_Mushrooms,  NONE,                   TEXTABLE_270, NONE, 0x2e, EXIT,                                   CMDMENU_SOUND_ITEM}, //Old Mushroom
    {BIT_Dino_Bag_Blue_Grubs,     NONE,                   TEXTABLE_270, NONE, 0x2a, EXIT,                                   CMDMENU_SOUND_ITEM}, //Blue Grub
    {BIT_Dino_Bag_Red_Grubs,      NONE,                   TEXTABLE_270, NONE, 0x2b, EXIT,                                   CMDMENU_SOUND_ITEM}, //Red Grub
    {BIT_Dino_Bag_Old_Grubs,      NONE,                   TEXTABLE_270, NONE, 0x2c, EXIT,                                   CMDMENU_SOUND_ITEM}, //Old Grub
    END
};

/*0x8F0*/ static CmdmenuPage dCmdmenuPages[] = {
    /*0*/  { dPage0ItemsKrystal,         0, 0x80001, R_CBUTTONS },  // Krystal items
    /*1*/  { dPage1ItemsSabre,           0, 0x80001, R_CBUTTONS },  // Sabre items
    /*2*/  { dPage2FoodActionsKrystal,   0, 0x80001, R_CBUTTONS },  // Foodbag actions (Krystal)
    /*3*/  { dPage3FoodActionsSabre,     0, 0x80001, R_CBUTTONS },  // Foodbag actions (Sabre)
    /*4*/  { dPage4FoodItemsKrystal,     0, 0x80001, R_CBUTTONS },  // Foodbag items (Krystal)
    /*5*/  { dPage5FoodItemsSabre,       0, 0x80001, R_CBUTTONS },  // Foodbag items (Sabre)
    /*6*/  { dPage6MagicSpells,          0, 0x80002, L_CBUTTONS },  // Magic spells
    /*7*/  { dPage7CommandsKyte,         0, 0x80009, D_CBUTTONS },  // Sidekick commands (Kyte)
    /*8*/  { sPage8CommandsTricky,       0, 0x80009, D_CBUTTONS },  // Sidekick commands (Tricky)
    /*9*/  { dPage9FoodActionsKyte,      0, 0x80001, R_CBUTTONS },  // Dinosaur foodbag actions (Krystal)
    /*10*/ { dPage10FoodActionsTricky,  0, 0x80001, R_CBUTTONS },  // Dinosaur foodbag actions (Sabre)
    /*11*/ { dPage11FoodItemsKyte,      0, 0x80001, R_CBUTTONS },  // Dinosaur foodbag items (Krystal)
    /*12*/ { dPage12FoodItemsTricky,    0, 0x80001, R_CBUTTONS },  // Dinosaur foodbag items (Sabre)
    /*13*/ { NULL,                      0, 0,       0 }
};

/*0x9D0*/ static s8 dPageCategory = 0; //Category of cmdmenu page currently open (see `CmdMenuPageCategories`)
/*0x9D4*/ static s8 dNextPageCategory = 0; //Assigned when changing between menus in the inventory
/*0x9D8*/ static s16 dTextableIDs[] = {
    /*00*/ TEXTABLE_1BE_CMDMENU_Scroll_BG,
    /*01*/ TEXTABLE_1BF_CMDMENU_Scroll_Bottom,
    /*02*/ TEXTABLE_1C0_CMDMENU_Scroll_Top,
    /*03*/ TEXTABLE_1C2_CMDMENU_InfoScroll_Roll_End,
    /*04*/ TEXTABLE_1C3_CMDMENU_InfoScroll_Roll,
    /*05*/ TEXTABLE_1C4_CMDMENU_InfoScroll_Side,
    /*06*/ TEXTABLE_1C5_CMDMENU_InfoScroll_BG,
    /*07*/ TEXTABLE_1C6_CMDMENU_InfoScroll_SelfShadow,
    /*08*/ TEXTABLE_3E2_CMDMENU_Apple_0_Pct,
    /*09*/ TEXTABLE_3E3_CMDMENU_Apple_25_Pct,
    /*10*/ TEXTABLE_3E4_CMDMENU_Apple_50_Pct,
    /*11*/ TEXTABLE_3E5_CMDMENU_Apple_75_Pct,
    /*12*/ TEXTABLE_421_CMDMENU_Mushroom_Blue_Full,
    /*13*/ TEXTABLE_1C9_CMDMENU_Grub_Blue_Full,
    /*14*/ TEXTABLE_3EA,
    /*15*/ TEXTABLE_3EB,
    /*16*/ TEXTABLE_1CB_CMDMENU_Grub_Blue_Half,
    /*17*/ TEXTABLE_3E6_CMDMENU_Apple_100_Pct,
    /*18*/ TEXTABLE_3E7_CMDMENU_Scarab,
    /*19*/ TEXTABLE_3F5_CMDMENU_Scarab_Flutter_Frame1,
    /*20*/ TEXTABLE_3F6_CMDMENU_Scarab_Flutter_Frame2,
    /*21*/ TEXTABLE_3F7_CMDMENU_Scarab_Flutter_Frame3,
    /*22*/ TEXTABLE_3F8_CMDMENU_Scarab_Spin_Frame1,
    /*23*/ TEXTABLE_3F9_CMDMENU_Scarab_Spin_Frame2,
    /*24*/ TEXTABLE_3FA_CMDMENU_Scarab_Spin_Frame3,
    /*25*/ TEXTABLE_3FB_CMDMENU_Scarab_Spin_Frame4,
    /*26*/ TEXTABLE_3FC_CMDMENU_Scarab_Spin_Frame5,
    /*27*/ TEXTABLE_3FD_CMDMENU_Scarab_Spin_Frame6,
    /*28*/ TEXTABLE_3FE_CMDMENU_Scarab_Spin_Frame7,
    /*29*/ TEXTABLE_422_CMDMENU_Page_Torn_Left,
    /*30*/ TEXTABLE_423_CMDMENU_Page_Torn_Right,
    /*31*/ TEXTABLE_429_CMDMENU_Highlight_Corner_Top_Left,
    /*32*/ TEXTABLE_42A_CMDMENU_Highlight_Corner_Top_Right,
    /*33*/ TEXTABLE_42B_CMDMENU_Highlight_Corner_Bottom_Left,
    /*34*/ TEXTABLE_42C_CMDMENU_Highlight_Corner_Bottom_Right,
    /*35*/ TEXTABLE_424_CMDMENU_MagicBar_Empty,
    /*36*/ TEXTABLE_42D_CMDMENU_MagicBar_Full,
    /*37*/ TEXTABLE_431_CMDMENU_C_Down,
    /*38*/ TEXTABLE_1D4_CMDMENU_LeftDownButtons_With_Kyte,
    /*39*/ TEXTABLE_42F_CMDMENU_C_Left,
    /*40*/ TEXTABLE_432_CMDMENU_Sabre,
    /*41*/ TEXTABLE_430_CMDMENU_C_Right,
    /*42*/ TEXTABLE_433_CMDMENU_Tricky,
    /*43*/ TEXTABLE_42E_CMDMENU_LeftDownButtons_With_Tricky,
    /*44*/ TEXTABLE_435_CMDMENU_Mushroom_Empty,
    /*45*/ TEXTABLE_436_CMDMENU_Mushroom_Red_Full,
    /*46*/ TEXTABLE_438_CMDMENU_Mushroom_Red_Half,
    /*47*/ TEXTABLE_43A_CMDMENU_RightButton_With_Bag,
    /*48*/ TEXTABLE_43B_CMDMENU_LeftDownButtons_NoSidekick,
    /*49*/ TEXTABLE_43D_CMDMENU_MagicBook,
    /*50*/ TEXTABLE_43E_CMDMENU_Bag,
    /*51*/ TEXTABLE_434_CMDMENU_Mushroom_Blue_Half,
    /*52*/ TEXTABLE_437_CMDMENU_Page_Torn_Shadow,
    /*53*/ TEXTABLE_267_CMDMENU_Krystal,
    /*54*/ TEXTABLE_268_CMDMENU_Kyte,
    /*55*/ TEXTABLE_476_CMDMENU_Grub_Empty,
    /*56*/ TEXTABLE_477_CMDMENU_Grub_Red_Full,
    /*57*/ TEXTABLE_478_CMDMENU_Grub_Red_Half
};

/*0x0*/ static f32 sOpacityHealth;  //Opacity of player health UI
/*0x4*/ static f32 sOpacityScarabs; //Opacity of Scarab counter UI
/*0x8*/ static f32 sOpacityMagic;   //Opacity of player magic bar UI
/*0xC*/ static s32 _bss_C;
/*0x10*/ static CmdmenuPlayerSidekickData sStats;
/*0x38*/ static CmdmenuPlayerSidekickData sPrevStats;
/*0x60*/ static CmdmenuPlayerSidekickDataChangeTimers sStatsChangeTimers;
/*0x88*/ static u8 _bss_88;
/*0x89*/ static u8 sAnimFrameScarab;
/*0x8A*/ static u8 sAnimScarabFlutterTimer;
/*0x8B*/ static u8 _bss_8B;
/*0x8C*/ static f32 sOpacityR; //Opacity of icons on right side of screen (C-buttons, menu page image, etc.)
/*0x90*/ static EnergyBar* sEnergyBar; 
/*0x98*/ static Texture* sMenuItemTextures[MAX_LOADED_ITEMS]; //Inventory icon texture pointers for the current menu page's loaded items
/*0x198*/ static Texture* sMenuSidekickCommandTextures[MAX_LOADED_ITEMS]; //Sidekick command inventory icon textures for the current menu page's loaded items
/*0x298*/ static s16 sMenuItemTextureIDs[MAX_LOADED_ITEMS]; //TextableIDs for the current menu page's loaded items
/*0x318*/ static s32 sMenuItemGamebits[MAX_LOADED_ITEMS]; //GamebitIDs for the current menu page's loaded items
/*0x418*/ static s16 sMenuItemTextIDs[MAX_LOADED_ITEMS]; //Gametext lineIDs for the current menu page's loaded items
/*0x498*/ static s8 _bss_498[MAX_LOADED_ITEMS]; //array of unkAs (from InventoryItem)
/*0x4D8*/ static u8 _bss_4D8[MAX_LOADED_ITEMS]; //array of unkBs (from InventoryItem)
/*0x518*/ static u8 sMenuItemVisibilities[MAX_LOADED_ITEMS];
/*0x558*/ static u8 sMenuItemQuantities[MAX_LOADED_ITEMS];
/*0x598*/ static Texture* sActiveSpellIcon; //Icon in bottom-right of screen
/*0x59C*/ static Texture* sActiveSpellRing; //Icon in bottom-right of screen
/*0x5A0*/ static Texture* sAButtonAnimTex;
/*0x5A4*/ static s16 sPrevActiveSpellGamebit;
/*0x5A8*/ static Texture* sActiveSidekickCommandIcon;
/*0x5AC*/ static Texture* sActiveSidekickCommandRing;
/*0x5B0*/ static s16 sPrevSidekickCommandIndex;
/*0x5B4*/ static s32 _bss_5B4;
/*0x5B8*/ static s32 sCrosshairAnimRenderFlags;
/*0x5BC*/ static s32 _bss_5BC;
/*0x5C0*/ static s32 sCrosshairAnimProgress;
/*0x5C8*/ static Texture* sTextures[ARRAYCOUNT(dTextableIDs)];
/*0x6B0*/ static Texture* sInventoryStackNumbersTex;
/*0x6B8*/ static TextureTile sTextureTiles[ARRAYCOUNT(dTextableIDs)][2];
/*0xC28*/ static s16 sInventoryUnrollY; //How far the inventory scroll has opened (0 when fully closed)
/*0xC2A*/ static s16 _bss_C2A;
/*0xC2C*/ static s16 _bss_C2C;
/*0xC2E*/ static s16 _bss_C2E;
/*0xC30*/ static GameTextChunk* _bss_C30;
/*0xC34*/ static Texture* sCrosshairTex;
/*0xC38*/ static s16 sUsedItemGamebitID;
/*0xC3A*/ static s16 _bss_C3A;
/*0xC3C*/ static s8 sUsedItemSound; //Set to 0 when item selection successful (item given to character, etc.)
/*0xC3D*/ static s8 _bss_C3D;
/*0xC3E*/ static s8 sInventoryPageID;
/*0xC3F*/ static u8 _bss_C3F;
/*0xC40*/ static s16 usedLoadedIdx;
/*0xC44*/ static s32 _bss_C44;
/*0xC48*/ static s8 sShouldOverrideJoypadButtons;
/*0xC4C*/ static s32 _bss_C4C;
/*0xC50*/ static s32 sJoyPressedButtons; // joypad button bitfield
/*0xC54*/ static s32 sJoyPressedButtonsOverride; //controllerButtons
/*0xC58*/ static s32 sJoyHeldButtons; // joypad button bitfield
/*0xC60*/ static TextureTile _bss_C60[2];
/*0xC78*/ static s8 _bss_C78;
/*0xC7A*/ static s16 _bss_C7A;
/*0xC7C*/ static s16 _bss_C7C;
/*0xC7E*/ static s16 _bss_C7E;
/*0xC80*/ static s16 _bss_C80;
/*0xC88*/ static CmdmenuInfoShowData sInfoPopup; //item info pop-up that appears after collecting certain items (e.g. Kyte's grubs)

static void cmdmenu_func_1410(void);
static void cmdmenu_func_1614(Gfx** gdl, Mtx** mtxs, Vertex** vtxs);
static void cmdmenu_func_1FEC(void);
static void cmdmenu_func_27D8(Gfx** gdl, Mtx** mtxs, Vertex** vtxs);
static s32 cmdmenu_func_325C(InventoryItem* arg0, s8 arg1);
static s32 cmdmenu_page_count_shown_items(InventoryItem* arg0, s8 arg1);
static void cmdmenu_func_3880(InventoryItem* items, s32 loadedItemIndex, s32 itemIndex);
static void cmdmenu_func_38E4(Gfx** gdl, Texture* tex, s32 frame);
static s32 cmdmenu_is_inventory_open(void);
static s32 cmdmenu_func_3A4C(void);
static void cmdmenu_close_inventory(void);
static void cmdmenu_open_inventory(void);
static void cmdmenu_func_3AD0(void);
static void cmdmenu_func_3D28(Gfx** gdl, Mtx** mtxs, Vertex** vtxs);
static void cmdmenu_func_4630(Gfx **gdl);
