#include "common.h"
#include "dlls/engine/21_gametext.h"
#include "dlls/engine/74_picmenu.h"
#include "game/gametexts.h"
#include "macros.h"
#include "sys/fonts.h"
#include "sys/audio/speaker.h"
#include "sys/menu.h"

extern void vi_set_modifiers(u8 updateViMode, s8 hStartMod, s8 vScaleMod);

#define NONE -1

typedef enum {
    OPTIONS_PAGE_0_Main_Page,       //Top-level options page, navigating to Video/Audio/Display/Control/Cheats/Cinema pages
    OPTIONS_PAGE_1_Video,           //Choices for screen size/ratio, and navigating to Screen Position page
    OPTIONS_PAGE_2_Audio,           //Choice for setup (headphones/stereo/mono/surround), volume sliders for music/SFX
    OPTIONS_PAGE_3_Display,         //Toggles for subtitles/instruments (UI elements like the minimap)
    OPTIONS_PAGE_4_Control,         //Choice for Z-button lock (tap/hold/combo), and navigating to View Layout page
    OPTIONS_PAGE_5_Cheats,          //Scrollable box showing 4 cheats at a time
    OPTIONS_PAGE_6_Cinema,
    OPTIONS_PAGE_7_View_Layout,     //Diagram of control scheme
    OPTIONS_PAGE_8_Screen_Position  //Adjusting screen X/Y offset
} OptionsMenuPages;

/*0x0*/ static char dDownArrowChar = 0xab;
/*0x4*/ static char dUpArrowChar = 0xbb;
/*0x8*/ static char dLeftArrowChar = 0x3c; // <
/*0xC*/ static char dRightArrowChar = 0x3e; // >

/*0x10*/ static PicMenuItem dItemsMain[] = {
    /*0*/ NEW_PICMENU_ITEM(
        /*textX*/ 83, /*textY*/ 64, /*innerWidth*/ 0, 

        /*itemX*/ 83, /*itemY*/ 302, /*textureID*/ NONE, /*outerWidth*/ 0, 
        /*flags*/ (PICMENU_RAISED_EFFECT | PICMENU_USE_TEXT_COLOR | PICMENU_DISABLED | 1), 
        /*fontID*/ FONT_FUN_FONT, /*highlightFontID*/ FONT_FUN_FONT, 
        /*upLink*/ 1, /*1*/ NONE, /*leftLink*/ NONE, /*rightLink*/ NONE, /*overrideWith*/ NONE
    ), 

    /*3*/ NEW_PICMENU_ITEM(
        /*textX*/ 83, /*textY*/ 326, /*innerWidth*/ 0, 
        /*itemX*/ 83, /*itemY*/ 326, /*textureID*/ NONE, /*outerWidth*/ 0, 
        /*flags*/ (PICMENU_RAISED_EFFECT | PICMENU_USE_TEXT_COLOR | PICMENU_DISABLED | 1), 
        /*fontID*/ FONT_FUN_FONT, /*highlightFontID*/ FONT_FUN_FONT, 
        /*upLink*/ 2, /*downLink*/ NONE, /*leftLink*/ NONE, /*rightLink*/ NONE, /*overrideWith*/ NONE
    )
};
/*0x5EC*/ static s8 data_5EC[] = {30, 35, 36, 37}; //Text lineIDs?

/*0x5F0*/ static char* data_5F0[] = {
    NULL, NULL, NULL, NULL
};
/*0x600*/ static PicMenuItem dItemsCinema[] = {
    /*0*/ NEW_PICMENU_ITEM(
        /*textX*/ 83, /*textY*/ 254, /*innerWidth*/ 0, 
        /*itemX*/ 83, /*itemY*/ 254, /*textureID*/ NONE, /*outerWidth*/ 0, 
        /*flags*/ (PICMENU_RAISED_EFFECT | PICMENU_USE_TEXT_COLOR | 1), 
        /*fontID*/ FONT_FUN_FONT, /*highlightFontID*/ FONT_FUN_FONT, 
        /*upLink*/ NONE, /*downLink*/ 1, /*leftLink*/ NONE, /*rightLink*/ NONE, /*overrideWith*/ NONE
    ), 

    /*1*/ NEW_PICMENU_ITEM(
        /*textX*/ 83, /*textY*/ 278, /*innerWidth*/ 0, 
        /*itemX*/ 83, /*itemY*/ 278, /*textureID*/ NONE, /*outerWidth*/ 0, 
        /*flags*/ (PICMENU_RAISED_EFFECT | PICMENU_USE_TEXT_COLOR | 1), 
        /*fontID*/ FONT_FUN_FONT, /*highlightFontID*/ FONT_FUN_FONT, 
        /*upLink*/ 0, /*downLink*/ NONE, /*leftLink*/ NONE, /*rightLink*/ NONE, /*overrideWith*/ NONE
    )
};
/*0x678*/ static u32 data_678 = 0;
/*0x67C*/ static u32 data_67C = 0;
/*0x680*/ static u32 data_680 = 0;
/*0x684*/ static PicMenuItem dItemsViewLayout[] = {
    /*0*/ NEW_PICMENU_ITEM(
        /*textX*/ 265, /*textY*/ 392, /*innerWidth*/ 0, 
        /*itemX*/ 265, /*itemY*/ 380, /*textureID*/ NONE, /*outerWidth*/ 0, 
        /*flags*/ (PICMENU_AUTO_WIDTH | PICMENU_HAS_BACKGROUND | PICMENU_ALIGN_TEXT_CENTER),
        /*fontID*/ FONT_DINO_MEDIUM_FONT_OUT, /*highlightFontID*/ FONT_DINO_MEDIUM_FONT_IN, 
        /*upLink*/ NONE, /*downLink*/ NONE, /*leftLink*/ NONE, /*rightLink*/ NONE, /*overrideWith*/ NONE
    ),
};
/*0x6C0*/ static s8 data_6C0[] = {40};
/*0x6C4*/ static PicMenuItem dItemsScreenPosition[] = {
    /*0*/ NEW_PICMENU_ITEM( 
        /*textX*/ 320, /*textY*/ 237, /*innerWidth*/ 0,
        /*itemX*/ 320, /*itemY*/ 225, /*textureID*/ NONE, /*outerWidth*/ 0, 
        /*flags*/ (PICMENU_ALIGN_ITEM_CENTER | PICMENU_AUTO_WIDTH | PICMENU_HAS_BACKGROUND | PICMENU_ALIGN_TEXT_CENTER), 
        /*fontID*/ FONT_DINO_MEDIUM_FONT_OUT, /*highlightFontID*/ FONT_DINO_MEDIUM_FONT_IN, 
        /*upLink*/ NONE, /*downLink*/ NONE, /*leftLink*/ NONE, /*rightLink*/ NONE, /*overrideWith*/ NONE
    ),
};
/*0x700*/ static s8 data_700[] = {40};

typedef struct {
    PicMenuItem *menuItems;
    s8 *textIDs;
    u8 count;
    s8 unk9;
    s8 unkA;
    u8 unkB;
    u8 unkC;
    u8 unkD;
} OptionsSubmenu;

/*0x704*/ static OptionsSubmenu dMenus[] = {
    {dItemsMain,            data_178,   ARRAYCOUNT(dItemsMain),           NONE, 0,      4, 5, 4},
    {dItemsVideo,           data_4E4,   3,                                5,    0,      3, 0, 0},
    {dItemsAudio,           data_5EC,   3,                                6,    0,      3, 0, 0},
    {dItemsDisplay,         data_1F8,   ARRAYCOUNT(dItemsDisplay),        2,    0,      3, 0, 0},
    {dItemsControl,         data_27C,   ARRAYCOUNT(dItemsControl),        3,    0,      3, 0, 0},
    {dItemsCheats,          NULL,       ARRAYCOUNT(dItemsCheats),         4,    0,      3, 0, 0},
    {dItemsCinema,          NULL,       ARRAYCOUNT(dItemsCinema),         7,    0,      3, 0, 0},
    {dItemsViewLayout,      data_6C0,   ARRAYCOUNT(dItemsViewLayout),     NONE, NONE,   5, 5, 4},
    {dItemsScreenPosition,  data_700,   ARRAYCOUNT(dItemsScreenPosition), NONE, NONE,   5, 5, 4}
};
/*0x794*/ static GameTextChunk* data_794 = NULL;
/*0x798*/ static GameTextChunk* dGametextControls = NULL; //Controls text
/*0x79C*/ static s8 dMenuID = NONE;

/*0x7A0*/ static s16 data_7A0[][2] = {
    {0x01d6, 0x00c4}, 
    {0x01d0, 0x011c}, 
    {0x01cc, 0x003e}, 
    {0x019b, 0x0175},
    {0x003f, 0x008d}, 
    {0x003f, 0x013f}, 
    {0x013a, 0x003e}, 
    {0x01d9, 0x0096},
    {0x01d9, 0x0071}, 
    {0x01d6, 0x005c}, 
    {0x01d6, 0x0082}
};
/*0x7CC*/ static s16 data_7CC[][2] = {
    {0x01ea, 0x0059}, 
    {0x01ea, 0x0073}, 
    {0x01ea, 0x0086}, 
    {0x01ea, 0x0098}, 
    {0x01d8, 0x00de}, 
    {0x01d8, 0x00ef}, 
    {0x01ce, 0x0100}, 
    {0x01cc, 0x0133},
    {0x01c6, 0x0145}, 
    {0x01ef, 0x0154}, 
    {0x019d, 0x018a}, 
    {0x019d, 0x0199}, 
    {0x0041, 0x0153}, 
    {0x0041, 0x0162}, 
    {0x0041, 0x00a3}, 
    {0x0131, 0x0053}
};
/*0x80C*/ static s16 dBoxTextureIDs[] = {
    TEXTABLE_320_Textbox_Edge_Bottom_1, 
    TEXTABLE_2F5_Textbox_Edge_Bottom_2, 
    TEXTABLE_2F6_Textbox_Corner_Bottom_Left, 
    TEXTABLE_2F7_Textbox_Corner_Bottom_Right, 
    TEXTABLE_2F8_Textbox_Corner_Top_Left, 
    TEXTABLE_2F9_Textbox_Corner_Top_Right, 
    TEXTABLE_2FA_Textbox_Edge_Left_1, 
    TEXTABLE_2FB_Textbox_Edge_Left_2, 
    TEXTABLE_2FC_Textbox_Edge_Left_3, 
    TEXTABLE_313_Textbox_Centre_1, 
    TEXTABLE_2FD_Textbox_Centre_2, 
    TEXTABLE_2FE_Textbox_Centre_3, 
    TEXTABLE_2FF_Textbox_Centre_4, 
    TEXTABLE_300_Textbox_Edge_Right_1, 
    TEXTABLE_301_Textbox_Edge_Right_2, 
    TEXTABLE_302_Textbox_Edge_Right_3, 
    TEXTABLE_303_Textbox_Edge_Top_1, 
    TEXTABLE_304_Textbox_Edge_Top_2
};
/*0x830*/ static s16 data_830[] = {
    0x0004, 0x0010, 0x0011, 0x0011, 0x0010, 0x0011, 0x0011, 0x0005, 
    0xffff, 0x0006, 0x0009, 0x000c, 0x0009, 0x000b, 0x000a, 0x0009,
    0x000d, 0xffff, 0x0007, 0x0009, 0x000b, 0x0009, 0x0009, 0x000c, 
    0x000a, 0x000e, 0xffff, 0x0008, 0x000a, 0x0009, 0x000c, 0x000a,
    0x0009, 0x000b, 0x000f, 0xffff, 0x0002, 0x0000, 0x0001, 0x0000, 
    0x0001, 0x0001, 0x0000, 0x0003, 0xffff, 0x0000
};
/*0x88C*/ static u8 data_88C[] = {0x02, 0x04, 0x01, 0x03};

/*0x0*/ static s8 sRedrawFrames;    //The number of updates that should be drawn before idling
/*0x1*/ static s8 sCheatsTopIdx;    //The index of the first cheat shown in the scrollable box (4 cheats are shown at a time)
/*0x2*/ static s8 bss_2;
/*0x3*/ static s8 bss_3;
/*0x4*/ static s32 _bss_4;
/*0x8*/ static char sCheatStrings[4][50];
/*0xD0*/ static  Texture* dBoxTextures[18];
/*0x118*/ static Texture* sBGTex;
/*0x11C*/ static Texture* sCropFrameVertical;
/*0x120*/ static Texture* sCropFrameHorizontal;
/*0x124*/ static GameTextChunk* sGametextCinema;
/*0x128*/ static GameTextChunk* sGametextCheats;
/*0x12C*/ static s8 bss_12C;
/*0x12D*/ static s8 bss_12D;
/*0x12E*/ static s8 bss_12E;
/*0x12F*/ static s8 bss_12F;
/*0x130*/ static s32 bss_130[6]; //Unknown length
/*0x148*/ static GplayOptions* sGameOptions; //Player's saved game options

static void options_func_1718(void);                 
static void options_func_1AE4(s32 arg0);             
static void options_func_2088(s32 arg0);             
static s32 options_func_2A1C(s32 arg0, u32 arg1);
static void options_func_2B50(s32 arg0, s32 arg1);  
static void options_func_2C58(s32 arg0, s32 arg1);  
static void options_func_2D50(s32 arg0, s32 arg1);  
static void options_func_320C(s32 arg0, s32 arg1);  
static void options_func_32B8(s32 arg0, s32 arg1);  
static void options_func_3404(s32 arg0, s32 arg1);  
static void options_clean_up(void);  
static void options_func_35D0(Gfx** arg0, s32 initialX, s32 initialY, s32 endX, s32 endY);              

// offset: 0x0 | ctor
void options_ctor(void* dll) {
    u32 i;

    gDLL_28_ScreenFade->vtbl->fade_reversed(20, 1);
    sBGTex = tex_load_deferred(TEXTABLE_2DF_Paper_BG_Sabre_Cape);
    sCropFrameHorizontal = tex_load_deferred(TEXTABLE_30E);
