#include "PR/ultratypes.h"
#include "sys/gfx/texture.h"
#include "unktypes.h"

/*0x0*/ static f32 _data_0 = 0.0;
/*0x4*/ static u32 _data_4 = 0x00000000;
/*0x8*/ static f32 _data_8 = 0.0;
/*0xC*/ static f32 _data_C = 0.0;
/*0x10*/ static u32 _data_10[] = {
    0x00000000, 0x3dcccccd
};
/*0x18*/ static f32 _data_18 = 0.0;
/*0x1C*/ static u32 _data_1C = 0x3f800000;
/*0x20*/ static u32 _data_20 = 0x00000000;
/*0x24*/ static f32 _data_24 = 0.0;
/*0x28*/ static u32 _data_28 = 0x3f800000;
/*0x2C*/ static u32 _data_2C = 0x00000000;
/*0x30*/ static u32 _data_30 = 0xffffffff;
/*0x34*/ static u32 _data_34 = 0x000000ff;
/*0x38*/ static u32 _data_38 = 0x000000ff;
/*0x3C*/ static u32 _data_3C = 0x000000ff;
/*0x40*/ static u32 _data_40 = 0x00000000;
/*0x44*/ static u32 _data_44 = 0x00000000;
/*0x48*/ static u32 _data_48 = 0x00000000;
/*0x4C*/ static u32 _data_4C = 0x00000000;
/*0x50*/ static u32 _data_50 = 0x00000000;
/*0x54*/ static u32 _data_54 = 0x00000000;
/*0x58*/ static u8 _data_58 = 0;
/*0x5C*/ static f32 _data_5C = 43200.0;
/*0x60*/ static u32 _data_60 = 0x00000000;
/*0x64*/ static u32 _data_64 = 0x00000000;
/*0x68*/ static u32 _data_68 = 0x00000000;
/*0x6C*/ static f32 _data_6C = 55.0;
/*0x70*/ static u32 _data_70[] = {
    0x425c0000, 0x42c80000, 0x43520000, 0x42fa0000, 0x425c0000, 0x425c0000, 0x425c0000, 0x425c0000, 
    0x42700000, 0x43520000, 0x42f00000, 0x425c0000, 0x425c0000, 0x425c0000, 0x425c0000, 0x42700000, 
    0x435c0000, 0x43700000, 0x425c0000, 0x425c0000
};
/*0xC0*/ static u32 _data_C0 = 0x00000000;
/*0xC4*/ static f32 _data_C4 = 1.0;
/*0xC8*/ static u32 _data_C8 = 0x00000000;
/*0xCC*/ static u32 _data_CC[] = {
    0x001da400, 0x00489b44, 0x1d0c351c, 0xff8fbfff, 0x74baffdb, 0xffffb0ff, 0xffffffe8, 0xd3ff82ff, 
    0xff4fa3ff, 0xb4ffff6f, 0xa7ffffff, 0xa5f5b78c, 0xffcd00ff, 0x9800ff81, 0x24f26021, 0x99356b68, 
    0x26660b00, 0x45070041, 0xffffffff, 0xffffca00, 0xfe4d0061, 0xff74c862, 0x003b65e0, 0x7f00532c, 
    0xfefe1300, 0x6926fffe, 0x26cd2d3d, 0xfffd00a9, 0x1339fefe, 0xfe0879d0, 0xce0000ff, 0xa100fffe, 
    0xe25c833f, 0xffff93b4, 0x5b43fffe, 0xfed23882, 0xff00007a, 0x11019800, 0x95240057, 0xff48ff65, 
    0x0665ffe6, 0x83ffb02f, 0xfe00003f, 0x00005c8e, 0xff00005c, 0x99c6ff00, 0x25acffff, 0xff3535ff, 
    0x8080537a, 0x6046c900, 0xfe4d0061, 0x1e4155c3, 0xdbf41e41, 0x55cbdb85, 0x1e41556f, 0x0c861e41, 
    0x55318ad8, 0x1e4155ff, 0xd5511e41, 0x55ff0c00
};
/*0x1BC*/ static u32 _data_1BC = 0x00000000;
/*0x1C0*/ static u32 _data_1C0 = 0x00000000;
/*0x1C4*/ static u32 _data_1C4 = 0x00000000;
/*0x1C8*/ static f32 _data_1C8 = 0.0;
/*0x1CC*/ static u32 _data_1CC[] = {
    0x00000003, 0x00020000, 0x001f0000, 0x0000000f, 0x000f0003, 0x00040002, 0x00000000, 0x001f0000, 
    0x000f000f, 0x00040001, 0x0002001f, 0x0000001f, 0x001f000f, 0x000f0001, 0x00000002, 0x001f001f, 
    0x0000001f, 0x000f000f
};
/*0x214*/ static u32 _data_214[] = {
    0xffec0014, 0x00000000, 0x03e00014, 0x00140000, 0x03e003e0, 0x00000000, 0x000001e0, 0x01e0ffec, 
    0xffec0000, 0x00000000, 0x0014ffec, 0x000003e0, 0x00000000
};
/*0x248*/ static u32 _data_248[] = {
    0xffec0014, 0x00000000, 0x07e00014, 0x00140000, 0x07e007e0, 0x00000000, 0x000003e0, 0x03e0ffec, 
    0xffec0000, 0x00000000, 0x0014ffec, 0x000007e0, 0x00000000
};
/*0x27C*/ static u32 _data_27C[] = {
    0x00000000, 0x00000000, 0x458fc000
};
/*0x288*/ static u32 _data_288[] = {
    0x00000000, 0x00000000, 0x458fc000
};
/*0x294*/ static u32 _data_294[] = {
    0x00000000, 0x00000000, 0x43480000, 0x00000000
};
/*0x2A4*/ static u32 _data_2A4 = 0x00000000;
/*0x2A8*/ static u32 _data_2A8[] = {
    0x00000000, 0x00000000
};

typedef struct
{
/*000*/ void *unk0;
/*004*/ void *unk4;
/*008*/ Texture *unk8;
/*00C*/ Texture *unkC;
/*010*/ Texture *unk10;
/*014*/ Texture *unk14;
/*018*/ Texture *unk18;
/*01C*/ Texture *unk1C;
/*020*/ UNK_TYPE_32 unk20;
/*024*/ u8 _unk20[8];
/*02C*/ f32 unk2C;
/*030*/ f32 unk30;
/*034*/ f32 unk34;
/*038*/ u8 _unk38[8];
/*040*/ f32 unk40;
/*044*/ f32 unk44;
/*048*/ f32 unk48;
/*04C*/ f32 unk4C;
/*050*/ f32 unk50;
/*054*/ f32 unk54;
/*058*/ f32 unk58;
/*05C*/ f32 unk5C;
/*060*/ f32 unk60;
/*064*/ f32 unk64;
/*068*/ f32 unk68;
/*06C*/ f32 unk6C;
/*070*/ f32 unk70;
/*074*/ f32 unk74;
/*078*/ f32 unk78;
/*07C*/ f32 unk7C;
/*080*/ f32 unk80;
/*084*/ f32 unk84;
/*088*/ f32 unk88;
/*08C*/ f32 unk8C;
/*090*/ f32 unk90;
/*094*/ f32 unk94;
/*098*/ u8 _unk98[0xc0 - 0x98];
/*0C0*/ f32 unkC0;
/*0C4*/ f32 unkC4;
/*0C8*/ f32 unkC8;
/*0CC*/ UNK_TYPE_32 unkCC;
/*0D0*/ UNK_TYPE_32 unkD0;
/*0D4*/ u8 _unkD4[8];
/*0DC*/ UNK_TYPE_32 unkDC;
/*0E0*/ UNK_TYPE_32 unkE0;
/*0E4*/ s32 unkE4;
/*0E8*/ UNK_TYPE_32 unkE8;
/*0EC*/ UNK_TYPE_32 unkEC;
/*0F0*/ UNK_TYPE_32 unkF0;
/*0F4*/ UNK_TYPE_32 unkF4;
/*0F8*/ UNK_TYPE_32 unkF8;
/*0FC*/ UNK_TYPE_32 unkFC;
/*100*/ UNK_TYPE_32 unk100;
/*104*/ UNK_TYPE_32 unk104;
/*108*/ UNK_TYPE_32 unk108;
/*10C*/ UNK_TYPE_32 unk10C;
/*110*/ u8 unk110;
/*111*/ u8 unk111;
/*112*/ u8 _unk112[2];
/*114*/ UNK_TYPE_8 unk114;
/*115*/ u8 _unk115[3];
} NewDayStruct;

/*0x0*/ static u8 _bss_0[0x26]; // DAT_810296a0
/*0x26*/ static u8 _bss_26[0x1]; // DAT_810296c6
/*0x27*/ static u8 _bss_27[0x1]; // DAT_810296c7
/*0x28*/ static u8 _bss_28[0x4]; // DAT_810296c8
/*0x2C*/ static u8 _bss_2C[0x4]; // DAT_810296cc
/*0x30*/ static NewDayStruct *_bss_30; // PTR_810296d0
/*0x34*/ static u8 _bss_34[0x28];

void dll_7_ctor(void *self) { }

void dll_7_dtor(void *self) { }

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_18.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_910.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_A10.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_C58.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_CDC.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_D08.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_D50.s")

void dll_7_func_DAC(s32 *param1) {
    if (_bss_30 != NULL) {
        *param1 = (f32)_bss_30->unkE4;
    } else {
        *param1 = 0;
    }
}

s32 dll_7_func_DF4(f32* arg0) {
    if (_bss_30 == NULL) {
        *arg0 = 0.0f;
        return 0;
    }

    if ((_data_5C >= 75600.0f) || (_data_5C < 18000.0f)) {
        if (_data_5C >= 75600.0f) {
            *arg0 = (_data_5C - 75600.0f) + 18000.0f;
        } else {
            *arg0 = 18000.0f - _data_5C;
        }

        return 1;
    }

    *arg0 = 75600.0f - _data_5C;
    return 0;
}

void dll_7_func_EA0(f32 arg0) {
    f32 var_f0;

    var_f0 = arg0;
    _data_58 = 1;
    if (var_f0 >= 86400.0f) {
        var_f0 = var_f0 / 86400.0f;
        var_f0 -= (s32) var_f0;
        var_f0 *= 86400.0f;
    }
    if (_bss_30 != NULL) {
        _bss_30->unkC0 = var_f0;
    } else {
        _data_5C = var_f0;
    }
    _data_8 = var_f0;
}

s32 dll_7_func_F24() {
    return _data_60;
}

#define SECONDS_IN_HOUR (60 * 60)
#define SECONDS_IN_MINUTE (60)
#define TICKS_IN_HOUR (SECONDS_IN_HOUR * 60)
#define TICKS_IN_MINUTE (SECONDS_IN_MINUTE * 60)
#define TICKS_IN_SECOND (60)

// F40
void dll_7_convert_ticks_to_real_time(f32 ticksF, s16 *hours, s16 *minutes, s16 *seconds) {
    s32 ticks = (s32)ticksF;
    
    *hours = ticks / TICKS_IN_HOUR;
    ticks -= *hours * TICKS_IN_HOUR;

    *minutes = ticks / TICKS_IN_MINUTE;
    ticks -= *minutes * TICKS_IN_MINUTE;

    *seconds = ticks / TICKS_IN_SECOND;
}

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_FFC.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_102C.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_20D4.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_2130.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_21CC.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_2464.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_30FC.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_3294.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_4484.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5124.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_56F8.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_57C0.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5818.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5D20.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5D6C.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5D90.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5DBC.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5E00.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5E5C.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5EB4.s")

#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/7_newday/dll_7_func_5ED0.s")
