
#include "dlls/engine/18_objfsa.h"
#include "dlls/engine/53_movelib.h"
#include "dlls/engine/6_amsfx.h"
#include "dlls/objects/713_DRearthwalk.h"
#include "game/gamebits.h"
#include "game/gametexts.h"
#include "game/objects/interaction_arrow.h"
#include "game/objects/object_id.h"
#include "sys/dll.h"
#include "sys/gfx/modgfx.h"
#include "sys/joypad.h"
#include "sys/main.h"
#include "sys/map_enums.h"
#include "sys/objprint.h"
#include "sys/print.h"
#include "sys/rand.h"
#include "sys/lfx.h"
#include "sys/objtype.h"
#include "sys/objlib.h"
#include "dll.h"

typedef struct {
/*00*/ ObjSetup base;
/*18*/ s8 rotation;
/*19*/ s8 unk19;
} DRearthwalk_Setup;

typedef struct {
/*000*/ ObjFSA_Data fsa;
/*34C*/ u8 _unk34C[0x370 - 0x34C];
/*370*/ HeadAnimation unk370;
/*394*/ HeadAnimation unk394;
/*3B8*/ MoveLibData movedata;
/*870*/ UnkCurvesStruct unk870;
/*978*/ Vec3f unk978[4];
/*9A8*/ u8 _unk9A8[0x9B4 - 0x9A8];
/*9B4*/ f32 unk9B4;
/*9B8*/ f32 unk9B8;
/*9BC*/ f32 unk9BC;
/*9C0*/ u8 _unk9C0[0xA52 - 0x9C0];
/*A52*/ s16 unkA52;
/*A54*/ u8 _unkA54[0xA56 - 0xA54];
/*A56*/ s16 energy;
/*A58*/ u16 unkA58;
/*A5A*/ u8 unkA5A;
/*A5B*/ u8 _unkA5B;
/*A5C*/ u8 unkA5C;
/*A5D*/ u8 _unkA5D;
/*A5E*/ u8 unkA5E;
/*A5F*/ u8 unkA5F;
/*A60_0*/ u8 unkA60_0 : 1;
/*A60_1*/ u8 unkA60_1 : 1;
/*A60_2*/ u8 unkA60_2 : 1;
/*A60_3*/ u8 unkA60_3 : 1;
/*A60_4*/ u8 rideable : 1;
/*A60_5*/ u8 unkA60_5 : 1;
/*A61*/ s8 unkA61;
/*A62*/ s8 talkSeq;
/*A63*/ s8 unkA63;
} DRearthwalk_Data;

enum DREWSeq {
    EWSEQ_0_EatBlueMushroom_Laying = 0,
    EWSEQ_1_EatBlueMushroom_Standing = 1,
    EWSEQ_2_LetsGoStopTheDragon = 2,
    EWSEQ_3_INeedEnergy = 3,
    EWSEQ_4 = 4,
    EWSEQ_5_SabreHopOn_Right = 5,
    EWSEQ_6_SabreHopOn_Left = 6,
    EWSEQ_7_SabreHopOff_Left = 7,
    EWSEQ_8_SabreHopOff_Right = 8,
    EWSEQ_9_IfICouldGetOutOfTheseChains = 9,
    EWSEQ_10_TeethChattering = 10
};

/*0x0*/ static u16 _data_0[] = {0x0854, 0x081a};
/*0x4*/ static u16 _data_4[] = {0x0853, 0x0852};
/*0x8*/ static s16 _data_8[][2] = {
    {0x0817, 0x0800}, 
    {0x0818, 0x0800}, 
    {0x0819, 0x1000}, 
    {0x081a, 0x1000}
};
/*0x18*/ static s16 _data_18[][2] = {
    {0x07bf, 0x1000}, 
    {0x0816, 0x1000}, 
    {0x081c, 0x1000}
};
/*0x24*/ static s16 _data_24[][2] = {
    {SOUND_8ED, 0x1000}
};
/*0x24*/ static s16 _data_28[] = {
    SOUND_855, 
    SOUND_856, 
    SOUND_857, 
    SOUND_858
};
/*0x30*/ static Vec3f _data_30[] = {
    VEC3F(-9.0f, 0.0f, -12.0f), 
    VEC3F(9.0f, 0.0f, -12.0f), 
    VEC3F(9.0f, 0.0f, 12.0f), 
    VEC3F(-9.0f, 0.0f, 12.0f)
};
/*0x60*/ static f32 _data_60[] = {
    0.0f, 0.0f, 0.0f, 0.0f
};
/*0x70*/ static Vec3f _data_70[] = {
    VEC3F(0.0f, 0.0f, 35.0f), 
    VEC3F(0.0f, 0.0f, -35.0f)
};
/*0x88*/ static f32 _data_88[] = {
    25.0f, 25.0f
};
/*0x90*/ static u32 _data_90 = 0x037b037b;
/*0x94*/ static u32 _data_94[] = {
    0x00000008, 0x00000007, 0x00000009, 0x0000000a, 0x01c80000
};
/*0xA8*/ static s16 _data_A8[] = {0x0018, 0x0000};
/*0xAC*/ static f32 _data_AC[] = {
    0.0031f, /*0x00030003*/2.7551e-40f // hmm
};
/*0xB4*/ static f32 _data_B4[][2] = {
    {0.0f, 0.03f}, 
    {0.05f, 0.7f}, 
    {0.6f, 1.2f}, 
    {0.8f, 1.93f}, 
    {1.72f, 2.7f}
};
/*0xDC*/ static s16 _data_DC[] = {
    0x0002, 0x0003, 0x0017, 0x0016, 0x0004, 0x0000
};

/*0x0*/ static ObjFSA_StateCallback sAnimStateCallbacks[8];
/*0x20*/ static ObjFSA_StateCallback sLogicStateCallbacks[1];
/*0x28*/ static MtxF _bss_28;

static void DRearthwalk_func_ABC(Object* self);
static void DRearthwalk_func_B54(Object* self, s32 arg1, s32 arg2);
static void DRearthwalk_func_1684(Object* self, DRearthwalk_Data* objdata, ObjFSA_Data* fsa);
static int DRearthwalk_func_1EBC(Object* actor, Object* animObj, AnimObj_Data* animObjData, s8 a3);
static void DRearthwalk_func_3210(Object* self, s16 arg1, s16 arg2);
static s32 DRearthwalk_func_32EC(Object* self, u8 arg1);

/*static*/ s32 DRearthwalk_func_21A8(Object* self, ObjFSA_Data* fsa, f32 updateRate);
/*static*/ s32 DRearthwalk_func_21DC(Object* self, ObjFSA_Data* fsa, f32 updateRate);
/*static*/ s32 DRearthwalk_func_2454(Object* self, ObjFSA_Data* fsa, f32 updateRate);
/*static*/ s32 DRearthwalk_func_2704(Object* self, ObjFSA_Data* fsa, f32 updateRate);
/*static*/ s32 DRearthwalk_func_2860(Object* self, ObjFSA_Data* fsa, f32 updateRate);
/*static*/ s32 DRearthwalk_func_2D80(Object* self, ObjFSA_Data* fsa, f32 updateRate);
