#include "dlls/engine/26_curves.h"
#include "dlls/engine/27.h"
#include "dlls/engine/6_amsfx.h"
#include "dlls/engine/53_movelib.h"
#include "dlls/objects/common/sidekick.h"
#include "game/gamebits.h"
#include "game/objects/interaction_arrow.h"
#include "sys/curves.h"
#include "sys/gfx/animseq.h"
#include "sys/main.h"
#include "sys/math.h"
#include "sys/objects.h"
#include "sys/objexpr.h"
#include "sys/objprint.h"
#include "sys/objtype.h"
#include "sys/rand.h"
#include "sys/joypad.h"
#include "dll.h"
#include "macros.h"

typedef struct {
/*000*/ MoveLibData movelib;
/*4B8*/ s8 unk4B8;
/*4B9*/ u8 unk4B9;
/*4BA*/ u8 flags;
/*4BB*/ u8 mapAct;
/*4BC*/ s8 unk4BC;
/*4BD*/ u8 nextSeq; // next seq in rotation to play on interact
/*4BE*/ u8 _unk4BE[0x4C0 - 0x4BE];
/*4C0*/ u8* seqRotation;
/*4C4*/ u8 seqRotationCount; // number of seqs in rotation
/*4C5*/ u8 _unk4C5[0x4D0 - 0x4C5];
/*4D0*/ s16 unk4D0;
/*4D2*/ s16 unk4D2;
/*4D4*/ s16 unk4D4;
/*4D6*/ s16 unk4D6;
/*4D8*/ s16 unk4D8;
/*4DA*/ s16 unk4DA;
/*4DC*/ s16 gamebitUnk;
/*4E0*/ s32 unk4E0;
/*4E4*/ DLL27_Data collision;
/*744*/ u8 _unk744[0x75C - 0x744];
/*75C*/ CurveSetup* unk75C;
/*760*/ CurveSetup* curveNode;
/*764*/ CurveSetup* unk764;
/*768*/ u8 _unk768[0x804 - 0x768];
/*804*/ f32 unk804;
/*808*/ f32 unk808;
/*80C*/ u8 _unk80C[0x840 - 0x80C];
/*840*/ f32 playerDist;
/*844*/ f32 unk844;
/*848*/ f32 unk848;
/*84C*/ f32 unk84C;
/*850*/ HeadAnimation unk850;
/*874*/ u8 unk874;
/*875*/ u8 _unk875[0x878 - 0x875];
} SHthorntail_Data;

typedef struct {
/*00*/ ObjSetup base;
/*18*/ u8 thornTailIndex;
} SHthorntail_Setup;

enum ThorntailSeq {
    THORNTAILSEQ_0_HaveYouWokenTheSwapStone = 0, // 0x275
    THORNTAILSEQ_1_LeaveMeAloneStranger = 1, // 0x276
    THORNTAILSEQ_2_ALogForAFish = 2, // 0x277
    THORNTAILSEQ_3_IDontWantThat = 3, // 0x278
    THORNTAILSEQ_4_NoLogsToday = 4, // 0x279
    THORNTAILSEQ_5_NoLogsToday2 = 5, // 0x27A
    THORNTAILSEQ_6_HowsRandorn = 6, // 0x27B
    THORNTAILSEQ_7_ItsANiceDay = 7, // 0x27C
    THORNTAILSEQ_8_TheSharpClawDrainedOurRiver = 8, // 0x27D
    THORNTAILSEQ_9_Unknown = 9, // 0x27E
    THORNTAILSEQ_10_ThornsBlockingBurrows = 10, // 0x27F
    THORNTAILSEQ_11_ArentLikeTheyUsedToBe = 11 // 0x280
};

/*0x0*/ static Vec3f data_0[] = {
    VEC3F(-8.0f, 0.0f, -8.0f), 
    VEC3F(8.0f, 0.0f, -8.0f), 
    VEC3F(8.0f, 0.0f, 8.0f), 
    VEC3F(-8.0f, 0.0f, 8.0f)
};
/*0x30*/ static f32 data_30[] = {0.0f, 0.0f, 0.0f, 0.0f};
/*0x40*/ static Unk80026DF4 data_40[] = {
    {SOUND_377_Metal_Smack, -1, -1, -1, 0, 0.0f, 0.0f}, 
