#include "common.h"
#include "sys/lfx.h"
#include "sys/segment_13D0.h"
#include "sys/lighting.h"
#include "macros.h"

typedef struct {
    void* unk0;
    Object* unk4;
    u8 _unk8[0x20 - 0x8];
    f32 unk20;
    f32 unk24;
    f32 unk28;
    Vec3f unk2C;
    f32 unk38;
    s32 unk3C;
    s32 unk40;
    s16 unk44;
    s16 unk46;
    s16 unk48;
    s16 unk4A;
    s16 unk4C;
    s16 unk4E;
    s16 unk50;
    s16 unk52;
    s32 unk54;
    u8 _unk58;
    u8 unk59;
    u8 unk5A;
    u8 unk5B;
    u8 _unk5C;
    u8 unk5D;
} ModgfxStruct;

// size: 0x18
typedef struct {
    s32 unk0;
    f32 unk4;
    u8 _unk8[0x10 - 0x8];
    s32 unk10;
    s16 unk14;
    u8 unk16;
} BSS0_9C;

typedef struct {
    Object* unk0;
    Object* unk4;
    void* unk8;
    s16 unkC;
    s16 unkE;
    s16 unk10;
    u8 _unk12[0x18 - 0x12];
    Vec3f unk18;
    Vec3f unk24[5];
    f32 unk60;
    f32 unk64;
    f32 unk68;
    Vec3f unk6C;
    Vtx* unk78[2];
    u8 _unk80[0x84 - 0x80];
    DLTri* unk84[2];
    u8 _unk8C[0x98 - 0x8C];
    Texture* unk98;
    BSS0_9C* unk9C;
    LightAction* unkA0;
    s32 unkA4;
    u8 _unkA8[0xAC - 0xA8];
    f32 unkAC;
    f32 unkB0;
    f32 unkB4;
    f32 unkB8;
    f32 unkBC;
    f32 unkC0;
    f32 unkC4;
    f32 unkC8;
    f32 unkCC;
    f32 unkD0;
    f32 unkD4;
    u8 _unkD8[0xEA - 0xD8];
    s16 unkEA;
    s16 unkEC;
    u8 _unkEE[0xFC - 0xEE];
    s16 unkFC;
    s16 unkFE;
    u8 _unk100[0x106 - 0x100];
    s16 unk106;
    s16 unk108;
    s16 unk10A;
    s16 unk10C;
    s16 unk10E;
    s16 unk110;
    u8 _unk112[0x120 - 0x112];
    s16 unk120;
    s16 unk122;
    s16 unk124;
    u8 unk126;
    u8 _unk127[0x12C - 0x127];
    void* unk12C;
    u8 unk130;
    u8 unk131;
    u8 unk132;
    u8 unk133;
    u8 unk134;
    u8 unk135;
    u8 unk136;
    u8 unk137;
    u8 unk138;
    s8 unk139;
    u8 unk13A;
    u8 unk13B;
    u8 unk13C;
    u8 unk13D;
    u8 unk13E;
    u8 unk13F;
} ModgfxInstance;

/*0x0*/ static u32 data_0 = 0x00000000;
/*0x4*/ static u32 data_4 = 0x00000000;
/*0x8*/ static u32 data_8 = 0x00000000;
/*0xC*/ static f32 data_C = 0.0;
/*0x10*/ static f32 data_10 = 0.0;

/*0x0*/ static ModgfxInstance* bss_0[496];
/*0x7C0*/ static u8 bss_7C0[0x300];
/*0xAC0*/ static u8 bss_AC0[0x4];
/*0xAC4*/ static u8 bss_AC4[0x4];
/*0xAC8*/ static u8 bss_AC8[0x8];
/*0xAD0*/ static u8 bss_AD0[0x46];
/*0xB16*/ static u8 bss_B16[0x2];
/*0xB18*/ static u8 _bss_B18[0x8];
/*0xB20*/ static u8 _bss_B20[0x10];

/*0x0*/ static const char str_0[] = "warning in modgfx dll no spare memory available\n";

static void dll_14_func_4C0C(s16 arg0, s32 arg1);
static void dll_14_func_4EDC(ModgfxInstance* arg0, u8 arg1);

// offset: 0x0 | ctor
void dll_14_ctor(void* dll) {
    s32 i = 0;
    while (i < ARRAYCOUNT_S(bss_0)) {
        bss_0[i++] = 0;
    }
}

// offset: 0x40 | dtor
void dll_14_dtor(void* dll) {
    dll_14_func_4C0C(0, 1);
}

// offset: 0x88 | func: 0 | export: 0
void dll_14_func_88(void) {
    s32 i;

    dll_14_func_4C0C(0, 1);
    i = 0;
    while (i < ARRAYCOUNT_S(bss_0)) {
        bss_0[i++] = 0;
    }
}

// offset: 0xF4 | func: 1 | export: 1
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/14_modgfx/dll_14_func_F4.s")

// offset: 0xC90 | func: 2 | export: 2
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/14_modgfx/dll_14_func_C90.s")

// offset: 0x21F0 | func: 3 | export: 3
void dll_14_func_21F0(void) {
    dll_14_func_4C0C(0, 1);
}

