#include "dlls/engine/33.h"
#include "dlls/objects/214_animobj.h"
#include "sys/gfx/model.h"
#include "sys/gfx/modgfx.h"
#include "sys/main.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/objmsg.h"
#include "sys/objtype.h"
#include "segment_334F0.h"
#include "prevent_bss_reordering.h"

enum KTLogicStates {
    KT_LSTATE_0 = 0,
    KT_LSTATE_1 = 1,
    KT_LSTATE_2 = 2,
    KT_LSTATE_3 = 3,
    KT_LSTATE_4 = 4,
    KT_LSTATE_5 = 5,
    KT_LSTATE_6 = 6,
    KT_LSTATE_7 = 7,
    KT_LSTATE_8 = 8,
    KT_LSTATE_9 = 9,
    KT_LSTATE_10 = 10,
    KT_LSTATE_11 = 11
};

enum KTAnimStates {
    KT_ASTATE_0 = 0,
    KT_ASTATE_1 = 1,
    KT_ASTATE_2 = 2,
    KT_ASTATE_3 = 3,
    KT_ASTATE_4 = 4,
    KT_ASTATE_5 = 5,
    KT_ASTATE_6 = 6,
    KT_ASTATE_7 = 7,
    KT_ASTATE_8 = 8
};

enum KTFlags {
    // Whether the boss is moving clockwise (0) or counter-clockwise (1) around the arena.
    KTFLAG_REVERSED = 0x1,
    // Which arena segment the boss is in.
    // Bits 1-2.
    KTFLAG_SEGMENT = 0x6,
    // Whether the boss was just damaged by the player.
    KTFLAG_DAMAGED = 0x8,
    // Whether the boss can be damaged.
    KTFLAG_VULNERABLE = 0x10,
    // Whether the boss is currently charging forward. Not used for the full lap he does after getting zapped.
    KTFLAG_CHARGING = 0x20
};

#define KTFLAG_GET_SEGMENT(ktflags) ((ktflags >> 1) & 3)
#define KTFLAG_SET_SEGMENT(segment) (segment << 1)

// Note: This is not the only object data. DLL 33 data is prepended to this in memory.
typedef struct {
/*000*/ GenericStack *stateStack;
/*004*/ f32 timer;
        // Where in the current segment the boss in, ranging from 0-1.
        // When reversed (moving counter-clockwise), this value progresses from 1 to 0 instead of 0 to 1.
/*008*/ f32 segmentPos;
/*00C*/ s32 standingUpSegment; // The last segment the boss stood up in after being knocked down.
        // The following fields are curve XYZ coords. These determine the positions used
        // for near and far sides of each segment, for both clockwise and counter-clockwise movement.
/*010*/ f32 unk10[4];
/*020*/ f32 unk20[4];
/*030*/ f32 unk30[4];
/*040*/ f32 unk40[4];
/*050*/ f32 unk50[4];
/*060*/ f32 unk60[4];
/*070*/ f32 unk70[4]; // Reversed positions start here (see above comments)
/*080*/ f32 unk80[4];
/*090*/ f32 unk90[4];
/*0A0*/ f32 unkA0[4];
/*0B0*/ f32 unkB0[4];
/*0C0*/ f32 unkC0[4];
        // The current near and far positions of each segment.
        // These are flipped when the boss is reversed (moving counter-clockwise).
/*0D0*/ f32 *segNearX;
/*0D4*/ f32 *segNearY;
/*0D8*/ f32 *segNearZ;
/*0DC*/ f32 *segFarX;
/*0E0*/ f32 *segFarY;
/*0E4*/ f32 *segFarZ;
        // World position that the boss should be in.
        // Moves to this position on the next tick.
        // Calculated by combining the current segment pos with the target curve pos.
/*0E8*/ Vec3f pos;
        // Where in the boss's current segment the player is, ranging from 0-1.
        // Note: This is *not* the pos of the player in their current segment. If the player is not in
        // the same segment as the boss, this value is not well defined.
/*0F4*/ f32 playerSegmentPos;
/*0F8*/ s16 turnStartYaw; // The yaw of the boss at the start of a turn.
/*0FA*/ u16 flags;
        // = 0 when walking around normally.
        // = 1 when charging at sabre.
        // = 2 when charging around the arena after getting zapped.
/*0FC*/ u8 anger;
/*0FD*/ u8 playerSpotted; // Whether the player was seen.
        // Which arena segment the boss is in (bitfield).
        // This is used to check if the boss is in the same segment as the player.
/*0FE*/ u8 selfSegmentBitfield;
        // Which arena segment the player is in (bitfield).
        // Determined by triggers that set/unset gamebits as the player walks around the arena.
/*0FF*/ u8 playerSegmentBitfield;
/*100*/ u8 laserWallBitfield; // Bitfield of which laser walls are active.
/*101*/ u8 fightProgress; // Increases as the player progresses the fight by damaging the boss.
/*102*/ u8 health;
/*103*/ s8 chargeCounter; // How many segments to charge down. Decrements after each turn while charging.
/*104*/ s32 fxFlags;
/*108*/ u8 unk108;
/*10C*/ SRT unk10C;
/*124*/ SRT unk124;
/*13C*/ SRT unk13C;
/*154*/ SRT unk154;
/*16C*/ Vec3f unk16C;
} KTrex_Data;

typedef struct {
/*00*/ DLL33_ObjSetup base;
/*38*/ f32 speeds[3]; // Movement speed, per "anger" level.
/*44*/ u16 chargePrepTime[3]; // Delay before charging.
/*4A*/ u16 vulnerableTime[4]; // How long the boss is vulnerable for.
/*52*/ u8 reverseChance[4]; // Chance to reverse direction.
/*56*/ u8 chargeChance[4]; // Chance to charge without seeing Sabre.
} KTrex_ObjSetup;

/*0x0*/ static u32 _data_0[] = {
    0x00000002, 0x00000002
};
/*0x8*/ static s16 _data_8[] = { // mod anim indices
    0x0009, 0x0012, 0x0012, 0x0000
};
/*0x10*/ static s16 _data_10[] = { // mod anim indices
    0x0001, 0x0002, 0x0003, 0x0000
};
/*0x18*/ static s16 _data_18[] = { // mod anim indices
    0x0004, 0x0006, 0x0006, 0x0000
};
/*0x20*/ static s16 _data_20[3][2] = { // mod anim indices
    { 0x0008, 0x000e }, 
    { 0x0010, 0x0011 }, 
    { 0x0010, 0x0011 }
};
/*0x2C*/ static u16 _data_2C[] = {
    0x0001, 0x0004, 0x0010, 0x0000
};
/*0x34*/ static u16 _data_34[] = {
    0x0002, 0x0008, 0x0020, 0x0000
};
/*0x3C*/ static u16 _data_3C[] = {
    0x4000, 0x4000, 0x4000, 0x0000
};
/*0x44*/ static u16 _data_44[] = {
    0x8000, 0x8000, 0x8000, 0x0000
};
/*0x4C*/ static u16 _data_4C[] = {
    0x0040, 0x0080, 0x0100, 0x0000
};
/*0x54*/ static f32 _data_54[] = {
    0.006, 0.003, 0.003
};
/*0x60*/ static f32 _data_60[] = {
    0.0055, 0.012, 0.012
};
/*0x6C*/ static f32 _data_6C[] = { // Segment progress to turn at when near the start of a segment.
    0, 0.025, 0.025
};
/*0x78*/ static f32 _data_78[] = { // Segment progress to turn at when near the end of a segment.
    1, 0.975, 0.975
};
/*0x84*/ static u16 _data_84[2] = {SOUND_6FA, SOUND_6FB};
/*0x88*/ static u16 _data_88[2] = {SOUND_691_KT_Rex_Roar, SOUND_6FD_KT_Rex_Roar};
/*0x8C*/ static u16 _data_8C[2] = {SOUND_6FE_KT_Rex_Roar, 0};
/*0x90*/ static u16 _data_90[2] = {SOUND_25B_Magic_Attack_Deflected, SOUND_25C_Melee_Attack_Deflected};
/*0x94*/ static u32 _data_94[] = { // curve uIDs
    0x32136, 0x3213d, 0x32128, 0x3212f
};
/*0xA4*/ static u32 _data_A4[] = { // curve uIDs
    0x32130, 0x32137, 0x32123, 0x32129
};
/*0xB4*/ static u32 _data_B4[] = { // curve uIDs
    0x32367, 0x32369, 0x3236a, 0x32365
};
/*0xC4*/ static u32 _data_C4[] = { // curve uIDs
    0x32132, 0x32139, 0x32124, 0x3212b
};
/*0xD4*/ static s16 _data_D4[] = { // game bits
    BIT_566, BIT_567, BIT_568, BIT_569
};
/*0xDC*/ static s16 _data_DC[] = { // game bits
    BIT_560, BIT_561, BIT_562, BIT_563
};
/*0xE4*/ static DLL_IModgfx *_data_E4 = NULL;

/*0x0*/ static ObjFSA_StateCallback sAnimStateCallbacks[9];
/*0x28*/ static ObjFSA_StateCallback sLogicStateCallbacks[12];
/*0x58*/ static DLL33_Data* sDLL33Data;
/*0x5C*/ static KTrex_Data *sKTData;

static s32 dll_702_anim_state_0(Object* arg1, ObjFSA_Data* arg2, f32 arg3);
static s32 dll_702_anim_state_1(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_anim_state_2(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_anim_state_3(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_anim_state_4(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_anim_state_5(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_anim_state_6(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_anim_state_7(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_anim_state_8(Object* arg1, ObjFSA_Data* arg2, f32 arg3);

static s32 dll_702_logic_state_0(Object *self, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_logic_state_1(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
static s32 dll_702_logic_state_2(Object* arg0, ObjFSA_Data* arg1, f32 arg2);
