#include "dlls/engine/33.h"
#include "dlls/objects/214_animobj.h"
#include "sys/gfx/model.h"
#include "sys/gfx/modgfx.h"
#include "sys/main.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/objmsg.h"
#include "sys/objtype.h"
#include "segment_334F0.h"
#include "prevent_bss_reordering.h"

enum {
    KTSTATE_0 = 0,
};

// Note: This is not the only object data. DLL 33 data is prepended to this in memory.
typedef struct {
/*000*/ GenericStack *stateStack;
/*004*/ f32 unk4;
/*008*/ f32 unk8; // how far along a straight (0-1 progress to next corner)
/*00C*/ s32 unkC;
/*010*/ f32 unk10[4];
/*020*/ f32 unk20[4];
/*030*/ f32 unk30[4];
/*040*/ f32 unk40[4];
/*050*/ f32 unk50[4];
/*060*/ f32 unk60[4];
/*070*/ f32 unk70[4];
/*080*/ f32 unk80[4];
/*090*/ f32 unk90[4];
/*0A0*/ f32 unkA0[4];
/*0B0*/ f32 unkB0[4];
/*0C0*/ f32 unkC0[4];
/*0D0*/ f32 *unkD0;
/*0D4*/ f32 *unkD4;
/*0D8*/ f32 *unkD8;
/*0DC*/ f32 *unkDC;
/*0E0*/ f32 *unkE0;
/*0E4*/ f32 *unkE4;
/*0E8*/ f32 unkE8;
/*0EC*/ f32 unkEC;
/*0F0*/ f32 unkF0;
/*0F4*/ f32 unkF4;
/*0F8*/ s16 unkF8;
/*0FA*/ u16 unkFA;
/*0FC*/ u8 unkFC;
/*0FD*/ u8 unkFD;
/*0FE*/ u8 unkFE;
/*0FF*/ u8 unkFF;
/*100*/ u8 unk100;
/*101*/ u8 unk101;
/*102*/ u8 unk102;
/*103*/ s8 unk103;
/*104*/ s32 unk104;
/*108*/ u8 unk108;
/*10C*/ SRT unk10C;
/*124*/ SRT unk124;
/*13C*/ SRT unk13C;
/*154*/ SRT unk154;
/*16C*/ Vec3f unk16C;
} KTrex_Data;

typedef struct {
/*00*/ DLL33_ObjSetup base;
/*38*/ f32 unk38[3];
/*44*/ u16 unk44[3];
/*4A*/ u16 unk4A[4];
/*52*/ u8 unk52[4];
/*56*/ u8 unk56[4];
} KTrex_ObjSetup;

/*0x0*/ static u32 _data_0[] = {
    0x00000002, 0x00000002
};
/*0x8*/ static s16 _data_8[] = { // mod anim indices
    0x0009, 0x0012, 0x0012, 0x0000
};
/*0x10*/ static s16 _data_10[] = { // mod anim indices
    0x0001, 0x0002, 0x0003, 0x0000
};
/*0x18*/ static s16 _data_18[] = { // mod anim indices
    0x0004, 0x0006, 0x0006, 0x0000
};
/*0x20*/ static s16 _data_20[3][2] = { // mod anim indices
    { 0x0008, 0x000e }, 
    { 0x0010, 0x0011 }, 
    { 0x0010, 0x0011 }
};
/*0x2C*/ static u16 _data_2C[] = {
    0x0001, 0x0004, 0x0010, 0x0000
};
/*0x34*/ static u16 _data_34[] = {
    0x0002, 0x0008, 0x0020, 0x0000
};
/*0x3C*/ static u16 _data_3C[] = {
    0x4000, 0x4000, 0x4000, 0x0000
};
/*0x44*/ static u16 _data_44[] = {
    0x8000, 0x8000, 0x8000, 0x0000
};
/*0x4C*/ static u16 _data_4C[] = {
    0x0040, 0x0080, 0x0100, 0x0000
};
/*0x54*/ static f32 _data_54[] = {
    0.006, 0.003, 0.003
};
/*0x60*/ static f32 _data_60[] = {
    0.0055, 0.012, 0.012
};
/*0x6C*/ static f32 _data_6C[] = {
    0, 0.025, 0.025
};
/*0x78*/ static f32 _data_78[] = {
    1, 0.975, 0.975
};
/*0x84*/ static u16 _data_84[2] = {SOUND_6FA, SOUND_6FB};
/*0x88*/ static u16 _data_88[2] = {SOUND_691_KT_Rex_Roar, SOUND_6FD_KT_Rex_Roar};
/*0x8C*/ static u16 _data_8C[2] = {SOUND_6FE_KT_Rex_Roar, 0};
/*0x90*/ static u16 _data_90[2] = {SOUND_25B_Magic_Attack_Deflected, SOUND_25C_Melee_Attack_Deflected};
/*0x94*/ static u32 _data_94[] = { // curve uIDs
    0x32136, 0x3213d, 0x32128, 0x3212f
};
/*0xA4*/ static u32 _data_A4[] = { // curve uIDs
    0x32130, 0x32137, 0x32123, 0x32129
};
/*0xB4*/ static u32 _data_B4[] = { // curve uIDs
    0x32367, 0x32369, 0x3236a, 0x32365
};
/*0xC4*/ static u32 _data_C4[] = { // curve uIDs
    0x32132, 0x32139, 0x32124, 0x3212b
};
/*0xD4*/ static s16 _data_D4[] = { // game bits
    BIT_566, BIT_567, BIT_568, BIT_569
};
/*0xDC*/ static s16 _data_DC[] = { // game bits
    BIT_560, BIT_561, BIT_562, BIT_563
};
/*0xE4*/ static DLL_IModgfx *_data_E4 = NULL;

/*0x0*/ static dll18_callback _bss_0[9];
/*0x28*/ static dll18_callback _bss_28[12];
/*0x58*/ static DLL33_Data* sDLL33Data;
/*0x5C*/ static KTrex_Data *sKTData;

static s32 dll_702_func_23EC(Object* arg1, DLL18_Data* arg2, f32 arg3);
static s32 dll_702_func_2454(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2644(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_28BC(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_29D0(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2AF0(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2BA4(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2C54(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2CF8(Object* arg1, DLL18_Data* arg2, f32 arg3);

static s32 dll_702_func_2D80(Object *self, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2D98(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2E64(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_3160(Object* arg0, DLL18_Data* arg1, f32 arg2);
