#include "common.h"
#include "dlls/engine/33.h"
#include "dlls/objects/214_animobj.h"
#include "sys/gfx/model.h"
#include "sys/gfx/modgfx.h"
#include "sys/main.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/objmsg.h"
#include "sys/objtype.h"
#include "segment_334F0.h"

typedef struct {
    GenericStack *stack;
    f32 unk4;
    f32 unk8;
    s32 unkC;
    f32 unk10[4];
    f32 unk20[4];
    f32 unk30[4];
    f32 unk40[4];
    f32 unk50[4];
    f32 unk60[4];
    f32 unk70[4];
    f32 unk80[4];
    f32 unk90[4];
    f32 unkA0[4];
    f32 unkB0[4];
    f32 unkC0[4];
    f32 *unkD0;
    f32 *unkD4;
    f32 *unkD8;
    f32 *unkDC;
    f32 *unkE0;
    f32 *unkE4;
    f32 unkE8;
    f32 unkEC;
    f32 unkF0;
    f32 unkF4;
    s16 unkF8;
    u16 unkFA;
    u8 unkFC;
    u8 unkFD;
    u8 unkFE;
    u8 unkFF;
    u8 unk100;
    u8 unk101;
    u8 unk102;
    s8 unk103;
    s32 unk104;
    u8 unk108;
    u8 _unk109[0x10c - 0x109];
    SRT unk10C;
    SRT unk124;
    SRT unk13C;
    SRT unk154;
    Vec3f unk16C;
} KTrex_ActualData;

typedef struct {
    DLL33_ObjSetup base;
    f32 unk38[3];
    u16 unk44[3];
    u16 unk4A[4];
    u8 unk52[4];
    u8 unk56[4];
} KTrex_ObjSetup;

/*0x0*/ static u32 _data_0[] = {
    0x00000002, 0x00000002
};
/*0x8*/ static s16 _data_8[] = {
    0x0009, 0x0012, 0x0012, 0x0000
};
/*0x10*/ static s16 _data_10[] = {
    0x0001, 0x0002, 0x0003, 0x0000
};
/*0x18*/ static s16 _data_18[] = {
    0x0004, 0x0006, 0x0006, 0x0000
};
/*0x20*/ static s16 _data_20[3][2] = {
    { 0x0008, 0x000e }, 
    { 0x0010, 0x0011 }, 
    { 0x0010, 0x0011 }
};
/*0x2C*/ static u16 _data_2C[] = {
    0x0001, 0x0004, 0x0010, 0x0000
};
/*0x34*/ static u16 _data_34[] = {
    0x0002, 0x0008, 0x0020, 0x0000
};
/*0x3C*/ static u16 _data_3C[] = {
    0x4000, 0x4000, 0x4000, 0x0000
};
/*0x44*/ static u16 _data_44[] = {
    0x8000, 0x8000, 0x8000, 0x0000
};
/*0x4C*/ static u16 _data_4C[] = {
    0x0040, 0x0080, 0x0100, 0x0000
};
/*0x54*/ static f32 _data_54[] = {
    0.006, 0.003, 0.003
};
/*0x60*/ static f32 _data_60[] = {
    0.0055, 0.012, 0.012
};
/*0x6C*/ static f32 _data_6C[] = {
    0, 0.025, 0.025
};
/*0x78*/ static f32 _data_78[] = {
    1, 0.975, 0.975
};
/*0x84*/ static u16 _data_84[2] = {0x06fa, 0x06fb};
/*0x88*/ static u16 _data_88[2] = {0x0691, 0x06fd};
/*0x8C*/ static u16 _data_8C[2] = {0x06fe, 0x0000};
/*0x90*/ static u16 _data_90[2] = {0x025b, 0x025c};
/*0x94*/ static u32 _data_94[] = { //uIDs?
    0x00032136, 0x0003213d, 0x00032128, 0x0003212f
};
/*0xA4*/ static u32 _data_A4[] = {
    0x00032130, 0x00032137, 0x00032123, 0x00032129
};
/*0xB4*/ static u32 _data_B4[] = {
    0x00032367, 0x00032369, 0x0003236a, 0x00032365
};
/*0xC4*/ static u32 _data_C4[] = {
    0x00032132, 0x00032139, 0x00032124, 0x0003212b
};
/*0xD4*/ static s16 _data_D4[] = {
    0x0566, 0x0567, 0x0568, 0x0569
};
/*0xDC*/ static s16 _data_DC[] = {
    0x0560, 0x0561, 0x0562, 0x0563
};
/*0xE4*/ static DLL_IModgfx *_data_E4 = NULL;
/*0xE8*/ static u32 _data_E8 = 0x02080104;
/*0xEC*/ static u32 _data_EC[] = {
    0x00000006, 0x00000069, 0x00000069, 0x000000ff, 0x00000000
};

/*0x0*/ static dll18_callback _bss_0[9];
/*0x28*/ static dll18_callback _bss_28[12];
/*0x58*/ static DLL33_Data* _bss_58;
/*0x5C*/ static KTrex_ActualData *_bss_5C;
/*0x60*/ static u8 _bss_60[0x2];
/*0x62*/ static u8 _bss_62[0x2];
/*0x64*/ static u8 _bss_64[0x4];
/*0x68*/ static u8 _bss_68[0x4];
/*0x6C*/ static u8 _bss_6C[0x4];
/*0x70*/ static u8 _bss_70[0x4];
/*0x74*/ static u8 _bss_74[0x4];
/*0x78*/ static u8 _bss_78[0x8];

static s32 dll_702_func_23EC(Object* arg1, DLL18_Data* arg2, f32 arg3);
static s32 dll_702_func_2454(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2644(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_28BC(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_29D0(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2AF0(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2BA4(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2C54(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_2CF8(Object* arg1, DLL18_Data* arg2, f32 arg3);

static u32 dll_702_func_2D80(Object *self, DLL18_Data* arg1, f32 arg2);
static s16 dll_702_func_2D98(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s16 dll_702_func_2E64(Object* arg0, DLL18_Data* arg1, f32 arg2);
static s32 dll_702_func_3160(Object* arg0, DLL18_Data* arg1, f32 arg2);
