#include "libc/string.h"
#include "dlls/engine/18_objfsa.h"
#include "dlls/engine/33.h"
#include "dlls/engine/6_amsfx.h"
#include "dlls/objects/214_animobj.h"
#include "game/gamebits.h"
#include "sys/dll.h"
#include "sys/generic_stack.h"
#include "sys/gfx/model.h"
#include "sys/gfx/modgfx.h"
#include "sys/main.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/objmsg.h"
#include "sys/objtype.h"
#include "segment_334F0.h"
#include "sys/rand.h"
#include "dll.h"
#include "functions.h"
#include "prevent_bss_reordering.h"

enum KTLogicStates {
    KT_LSTATE_0 = 0,
    KT_LSTATE_1_DEFEATED = 1,
    KT_LSTATE_2_WALK = 2,
    KT_LSTATE_3_TURN_CORNER = 3,
    KT_LSTATE_4_ROAR = 4,
    KT_LSTATE_5_CHARGE = 5,
    KT_LSTATE_6_CHARGE_END = 6,
    KT_LSTATE_7_ZAPPED = 7,
    KT_LSTATE_8_ON_GROUND = 8,
    KT_LSTATE_9_STAND_UP = 9,
    KT_LSTATE_10_FULL_CHARGE = 10,
    KT_LSTATE_11_REVERSE = 11
};

enum KTAnimStates {
    KT_ASTATE_0 = 0,
    KT_ASTATE_1_MOVING_STRAIGHT = 1,
    KT_ASTATE_2_TURN_90 = 2,
    KT_ASTATE_3_TURN_180 = 3,
    KT_ASTATE_4_ROAR = 4,
    KT_ASTATE_5_CHARGE_END = 5,
    KT_ASTATE_6_ZAPPED = 6,
    KT_ASTATE_7_ON_GROUND = 7,
    KT_ASTATE_8_STAND_UP = 8
};

enum KTFlags {
    // Whether the boss is moving clockwise (0) or counter-clockwise (1) around the arena.
    KTFLAG_REVERSED = 0x1,
    // Which arena segment the boss is in.
    // Bits 1-2.
    KTFLAG_SEGMENT = 0x6,
    // Whether the boss was just damaged by the player.
    KTFLAG_DAMAGED = 0x8,
    // Whether the boss can be damaged.
    KTFLAG_VULNERABLE = 0x10,
    // Whether the random chance reverse/charge was already rolled for the current logic state.
    KTFLAG_ROLLED_CHANCE = 0x20
};

#define KTFLAG_GET_SEGMENT(ktflags) ((ktflags >> 1) & 3)
#define KTFLAG_SET_SEGMENT(segment) (segment << 1)

// Note: This is not the only object data. DLL 33 data is prepended to this in memory.
typedef struct {
/*000*/ GenericStack *stateStack;
/*004*/ f32 timer;
        // Where in the current segment the boss in, ranging from 0-1.
        // When reversed (moving counter-clockwise), this value progresses from 1 to 0 instead of 0 to 1.
/*008*/ f32 segmentPos;
/*00C*/ s32 standingUpSegment; // The last segment the boss stood up in after being knocked down.
        // The following fields are curve XYZ coords. These determine the positions used
        // for the A and B sides of each arena segment, for both clockwise and counter-clockwise movement.
/*010*/ f32 segStartCW_X[4];
/*020*/ f32 segStartCW_Y[4];
/*030*/ f32 segStartCW_Z[4];
/*040*/ f32 segEndCW_X[4];
/*050*/ f32 segEndCW_Y[4];
/*060*/ f32 segEndCW_Z[4];
/*070*/ f32 segEndCCW_X[4]; // Reversed positions start here (see above comments)
/*080*/ f32 segEndCCW_Y[4];
/*090*/ f32 segEndCCW_Z[4];
/*0A0*/ f32 segStartCCW_X[4];
/*0B0*/ f32 segStartCCW_Y[4];
/*0C0*/ f32 segStartCCW_Z[4];
        // The current A and B positions of each segment.
        // These are flipped when the boss is reversed (moving counter-clockwise).
/*0D0*/ f32 *segA_X;
/*0D4*/ f32 *segA_Y;
/*0D8*/ f32 *segA_Z;
/*0DC*/ f32 *segB_X;
/*0E0*/ f32 *segB_Y;
/*0E4*/ f32 *segB_Z;
        // World position that the boss should be in.
        // Moves to this position on the next tick.
        // Calculated by combining the current segment pos with the target curve pos.
/*0E8*/ Vec3f pos;
        // Where in the boss's current segment the player is, ranging from 0-1.
        // Note: This is *not* the pos of the player in their current segment. If the player is not in
        // the same segment as the boss, this value is not well defined.
/*0F4*/ f32 playerSegmentPos;
/*0F8*/ s16 turnStartYaw; // The yaw of the boss at the start of a turn.
/*0FA*/ u16 flags;
        // = 0 when walking around normally.
        // = 1 when charging at sabre.
        // = 2 when charging around the arena after getting zapped.
/*0FC*/ u8 anger;
/*0FD*/ u8 roarType;
        // Which arena segment the boss is in (bitfield).
        // This is used to check if the boss is in the same segment as the player.
/*0FE*/ u8 selfSegmentBitfield;
        // Which arena segment the player is in (bitfield).
        // Determined by triggers that set/unset gamebits as the player walks around the arena.
/*0FF*/ u8 playerSegmentBitfield;
/*100*/ u8 laserWallBitfield; // Bitfield of which laser walls are active.
/*101*/ u8 fightProgress; // Increases as the player progresses the fight by damaging the boss.
/*102*/ u8 health;
/*103*/ s8 chargeCounter; // How many segments to charge down. Decrements after each turn while charging.
/*104*/ s32 fxFlags;
/*108*/ u8 breathingSfxIndex;
/*10C*/ SRT unk10C;
/*124*/ SRT unk124;
/*13C*/ SRT unk13C;
/*154*/ SRT unk154;
/*16C*/ Vec3f unk16C;
} KTrex_Data;

typedef struct {
/*00*/ DLL33_ObjSetup base;
/*38*/ f32 speeds[3]; // Movement speed, per "anger" level.
/*44*/ u16 roarTime[3]; // How long a roar lasts.
/*4A*/ u16 vulnerableTime[4]; // How long the boss is vulnerable for.
/*52*/ u8 reverseChance[4]; // Chance to reverse direction.
/*56*/ u8 chargeChance[4]; // Chance to charge without seeing Sabre.
} KTrex_ObjSetup;

enum KTModAnims {
    KTANIM_Idle = 0,
    KTANIM_Walk1 = 1, // anger level 0
    KTANIM_Walk2 = 2, // anger level 1
    KTANIM_Walk3 = 3, // anger level 2
    KTANIM_Roar_Small = 4,
    KTANIM_Roar_VeryBig = 5, // unused
    KTANIM_Roar_Big = 6,
    KTANIM_Walk_Slow = 7, // creepy, unused
    KTANIM_Turn_90_CW_Normal = 8,
    KTANIM_Roar_ChargeEnd1 = 9, // referenced but unused due to logic
    KTANIM_Roar_10 = 10, // unused
    KTANIM_FallDown = 11,
    KTANIM_FlailOnGround = 12,
    KTANIM_GetBackUp = 13,
    KTANIM_Turn_90_CCW_Normal = 14,
    KTANIM_Turn_180 = 15,
    KTANIM_Turn_90_CW_Fast = 16,
    KTANIM_Turn_90_CCW_Fast = 17,
    KTANIM_Roar_ChargeEnd2 = 18
};

enum KTModAnimEvents {
    KTANIM_EVT_0_Speak = 0,
    KTANIM_EVT_1_Footfall_Left = 1,
    KTANIM_EVT_2_Footfall_Right = 2,
    KTANIM_EVT_7 = 7,
    KTANIM_EVT_9_Spit_Partfx_Enable = 9,
    KTANIM_EVT_10_Spit_Partfx_Disable = 10
};

enum KTFxFlags {
    KTFX_Footfall_Right1 = 0x1,
    KTFX_Footfall_Left1 = 0x2,
    KTFX_Footfall_Right2 = 0x4,
    KTFX_Footfall_Left2 = 0x8,
    KTFX_Footfall_Right3 = 0x10,
    KTFX_Footfall_Left3 = 0x20,
    KTFX_Sound_68E = 0x40,
    KTFX_Sound_BigRoar = 0x80,
    KTFX_Sound_IntroRoar = 0x100,
    KTFX_Sound_ChargeEndRoar = 0x200,
    KTFX_Spit_Partfx = 0x800,
    KTFX_Spit_Partfx_Disable = 0x1000,
    KTFX_Sound_FlailRoar = 0x2000,
    KTFX_Sound_Breathing1 = 0x4000,
    KTFX_Sound_Breathing2 = 0x8000,
    KTFX_Sound_WallSlam = 0x10000,
    KTFX_Sound_Explosion = 0x20000,
    KTFX_Sound_GroundScrape = 0x40000,
    KTFX_Sound_PainRoar = 0x80000,
    KTFX_EnablePartFx = 0x100000
};

/*0x0*/ static u32 _data_0[] = {
    0x00000002, 0x00000002
};
/*0x8*/ static s16 sChargeEndModAnims[] = { // mod anim indices (charge end)
    KTANIM_Roar_ChargeEnd1, KTANIM_Roar_ChargeEnd2, KTANIM_Roar_ChargeEnd2, 0
};
/*0x10*/ static s16 sWalkModAnims[] = { // mod anim indices (walking)
    KTANIM_Walk1, KTANIM_Walk2, KTANIM_Walk3, 0
};
/*0x18*/ static s16 sRoarModAnims[] = { // mod anim indices (roars)
    KTANIM_Roar_Small, KTANIM_Roar_Big, KTANIM_Roar_Big, 0
};
/*0x20*/ static s16 sTurn90ModAnims[3][2] = { // mod anim indices (90 degree turns (CW, CCW))
    { KTANIM_Turn_90_CW_Normal, KTANIM_Turn_90_CCW_Normal }, 
    { KTANIM_Turn_90_CW_Fast, KTANIM_Turn_90_CCW_Fast }, 
    { KTANIM_Turn_90_CW_Fast, KTANIM_Turn_90_CCW_Fast }
};
/*0x2C*/ static u16 sFootfallRightFxFlags[] = {
    KTFX_Footfall_Right1, KTFX_Footfall_Right2, KTFX_Footfall_Right3, 0x0000
};
/*0x34*/ static u16 sFootfallLeftFxFlags[] = {
    KTFX_Footfall_Left1, KTFX_Footfall_Left2, KTFX_Footfall_Left3, 0x0000
};
/*0x3C*/ static u16 sBreathingFxFlags1[] = {
    KTFX_Sound_Breathing1, KTFX_Sound_Breathing1, KTFX_Sound_Breathing1, 0x0000
};
/*0x44*/ static u16 sBreathingFxFlags2[] = {
    KTFX_Sound_Breathing2, KTFX_Sound_Breathing2, KTFX_Sound_Breathing2, 0x0000
};
/*0x4C*/ static u16 sRoarFxFlags[] = {
    KTFX_Sound_68E, KTFX_Sound_BigRoar, KTFX_Sound_IntroRoar, 0x0000
};
/*0x54*/ static f32 sRoarAnimTickDeltas[] = {
    0.006, 0.003, 0.003
};
/*0x60*/ static f32 sTurn90AnimTickDeltas[] = {
    0.0055, 0.012, 0.012
};
/*0x6C*/ static f32 _data_6C[] = { // Segment progress to turn at when near the start of a segment.
    0, 0.025, 0.025
};
/*0x78*/ static f32 _data_78[] = { // Segment progress to turn at when near the end of a segment.
    1, 0.975, 0.975
};
/*0x84*/ static u16 sSndScrapeGround[2] = {SOUND_6FA, SOUND_6FB};
/*0x88*/ static u16 sSndRoars[3] = {SOUND_691_KT_Rex_Roar, SOUND_6FD_KT_Rex_Roar, SOUND_6FE_KT_Rex_Roar};
/*0x90*/ static u16 sSndDeflectAttack[2] = {SOUND_25B_Magic_Attack_Deflected, SOUND_25C_Melee_Attack_Deflected};
/*0x94*/ static u32 sSegEndCurvesCW[] = { // curve uIDs
    0x32136, // end of segment 0 (cw), more in
    0x3213d, // end of segment 1 (cw), more in
    0x32128, // end of segment 2 (cw), more in
    0x3212f  // end of segment 3 (cw), more in
};
/*0xA4*/ static u32 sSegStartCurvesCW[] = { // curve uIDs
    0x32130, // start of segment 0 (cw), more out
    0x32137, // start of segment 1 (cw), more out
    0x32123, // start of segment 2 (cw), more out 
    0x32129  // start of segment 3 (cw), more out
};
/*0xB4*/ static u32 sSegStartCurvesCCW[] = { // curve uIDs
    0x32367, // end of segment 0 (cw), more out
    0x32369, // end of segment 1 (cw), more out
    0x3236a, // end of segment 2 (cw), more out
    0x32365  // end of segment 3 (cw), more out
};
/*0xC4*/ static u32 sSegEndCurvesCCW[] = { // curve uIDs
    0x32132, // start of segment 0 (cw), more in
    0x32139, // start of segment 1 (cw), more in 
    0x32124, // start of segment 2 (cw), more in 
    0x3212b  // start of segment 3 (cw), more in
};
/*0xD4*/ static s16 sPlayerSegmentGamebits[] = {
    BIT_KT_Player_In_Segment_2, BIT_KT_Player_In_Segment_0, BIT_KT_Player_In_Segment_3, BIT_KT_Player_In_Segment_1
};
/*0xDC*/ static s16 sLaserWallGamebits[] = {
    BIT_KT_Lazerwall_1, BIT_KT_Lazerwall_2, BIT_KT_Lazerwall_3, BIT_KT_Lazerwall_4
};
/*0xE4*/ static DLL_IModgfx *_data_E4 = NULL;

/*0x0*/ static ObjFSA_StateCallback sAnimStateCallbacks[9];
/*0x28*/ static ObjFSA_StateCallback sLogicStateCallbacks[12];
/*0x58*/ static DLL33_Data* sDLL33Data;
/*0x5C*/ static KTrex_Data *sKTData;

static s32 dll_702_anim_state_0(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_1(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_2(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_3(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_4(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_5(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_6(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_7(Object* self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_anim_state_8(Object* self, ObjFSA_Data* fsa, f32 updateRate);

static s32 dll_702_logic_state_0(Object *self, ObjFSA_Data* fsa, f32 updateRate);
static s32 dll_702_logic_state_1(Object* self, ObjFSA_Data* fsa, f32 updateRate);
