#include "PR/ultratypes.h"
#include "dlls/engine/29_gplay.h"
#include "dlls/objects/325_trigger.h"
#include "game/gamebits.h"
#include "game/objects/object_id.h"
#include "libnaudio/n_libaudio.h"
#include "sys/asset_thread.h"
#include "sys/audio.h"
#include "sys/fs.h"
#include "sys/main.h"
#include "sys/memory.h"
#include "dll.h"
#include "functions.h"

extern s32 D_800967A0[127];
extern f32 D_8009699C[100];

// size:0x24C
typedef struct {
/*000*/ u8 unk0;
/*004*/ N_ALCSPlayer seqp;
/*090*/ ALCSeq seq;
/*118*/ void *midiData;
/*18C*/ u8 currentSeqID;
/*18E*/ s16 bpm;
/*190*/ s16 volume;
/*192*/ u16 unk192;
/*194*/ u16 unk194; // enabled channels?
/*196*/ u16 unk196; // dirty channels?
/*198*/ u16 unk198; // ignore channels?
/*19A*/ u8 volUpRate; // volume per tick
/*19B*/ u8 volDownRate; // volume per tick
/*19C*/ s16 channelVolumes[16];
/*1BC*/ u8 _unk1BC[0x1FC - 0x1BC];
/*1FC*/ u8 nextSeqID; // current music/ambient id?
/*1FE*/ s16 nextBPM;
/*200*/ u16 unk200;
/*202*/ s16 targetVolume;
/*204*/ u16 unk204;
/*206*/ u16 unk206;
/*208*/ u16 unk208;
/*20A*/ u8 nextVolUpRate; // volume per tick
/*20B*/ u8 nextVolDownRate; // volume per tick
/*20C*/ u8 _unk20C[0x24C - 0x20C];
} AMSEQPlayer;

typedef struct {
/*0*/ s32 unk0;
/*4*/ u8 _unk4[4];
} AMSEQBss18; 

typedef struct {
/*00*/ Object *obj;
/*04*/ MusicAction action;
/*24*/ s16 actionNo;
/*26*/ s16 unk26;
/*28*/ s16 unk28;
} AMSEQHandle;

/*0x0*/ static u8 _data_0 = 0;
/*0x4*/ static u8 _data_4 = 0;
/*0x8*/ static Object *sFocusObj = NULL;
/*0xC*/ static MusicAction* sMusicAction = NULL;

/*0x0*/ static AMSEQPlayer **sSeqPlayers; // pointer to array of 4 pointers
/*0x4*/ static ALBankFile **sBankFiles;
/*0x8*/ static ALSeqFile *sSeqFiles[2];
/*0x10*/ static struct oscstate *sOscStates;
/*0x14*/ static struct oscstate *sFreeOscStateList;
/*0x18*/ static AMSEQBss18 *_bss_18;
/*0x1C*/ static s32 _bss_1C;
/*0x20*/ static AMSEQHandle *sSeqHandles;
/*0x24*/ static s32 sNumSeqHandles; // current number of sequence handles
/*0x28*/ static u16 sVolumeGameOption; // set by game options, scales amseq volume
/*0x2A*/ static u16 sUnkVolume; // set to 256 and never changed, scales amseq volume
/*0x2C*/ static u16 sCurrGlobalVolume;

void amseq_play_ex(u8 arg0, u8 arg1, s16 arg2, s16 arg3, u16 arg4);
/*static*/ void amseq_update_dist_falloff(void);
/*static*/ void amseq_start_next_sequence(u8 arg0);
/*static*/ void amseq_update_fade(u8 arg0);
static void amseq_determine_vols(u8 arg0, u8 arg1, u16 arg2, u16 arg3, u16 arg4, s8* arg5);
static void amseq_func_14A0(AMSEQPlayer *arg0);
/*static*/ AMSEQPlayer* amseq_func_135C(s32 arg0, s32 maxChannels, s32 maxVoices, s32 arg3, s32 maxEvents);
/*static*/ ALMicroTime amseq_initOscMain(void **oscState,f32 *initVal, u8 oscType,
                                   u8 oscRate, u8 oscDepth, u8 oscDelay, u8 unk07);
/*static*/ ALMicroTime amseq_updateOscMain(void *oscState, f32 *updateVal);
/*static*/ void amseq_stopOscMain(void *oscState);
static s32 amseq_func_1E8C(MusicAction *action, s8 a1, s16 actionNo);

// offset: 0x0 | ctor
#ifndef NON_MATCHING
void amseq_ctor(void *dll);
