#include "PR/ultratypes.h"
#include "dlls/engine/29_gplay.h"
#include "dlls/objects/325_trigger.h"
#include "game/gamebits.h"
#include "game/objects/object_id.h"
#include "libnaudio/n_libaudio.h"
#include "sys/asset_thread.h"
#include "sys/audio.h"
#include "sys/fs.h"
#include "sys/main.h"
#include "sys/memory.h"
#include "dll.h"
#include "functions.h"

extern s32 D_800967A0[127];
extern f32 D_8009699C[100];

// size:0x24C
typedef struct {
/*000*/ u8 unk0;
/*004*/ N_ALCSPlayer seqp;
/*090*/ ALCSeq seq;
/*118*/ void *midiData;
/*18C*/ u8 currentSeqID;
/*18E*/ s16 bpm;
/*190*/ s16 volume;
/*192*/ u16 unk192;
/*194*/ u16 unk194;
/*196*/ u16 unk196;
/*198*/ u16 unk198;
/*19A*/ u8 volUpRate; // volume per tick
/*19B*/ u8 volDownRate; // volume per tick
/*19C*/ s16 channelVolumes[16];
/*1BC*/ u8 _unk1BC[0x1FC - 0x1BC];
/*1FC*/ u8 nextSeqID; // current music/ambient id?
/*1FE*/ s16 nextBPM;
/*200*/ u16 unk200;
/*202*/ s16 targetVolume;
/*204*/ u16 unk204;
/*206*/ u16 unk206;
/*208*/ u16 unk208;
/*20A*/ u8 nextVolUpRate; // volume per tick
/*20B*/ u8 nextVolDownRate; // volume per tick
/*20C*/ u8 _unk20C[0x24C - 0x20C];
} AMSEQPlayer;

typedef struct {
/*0*/ s32 unk0;
/*4*/ u8 _unk4[4];
} AMSEQBss18; 

typedef struct MusicAction {
/*00*/ u8 unk0; // unused, always 0
/*01*/ u8 unk1; // unused, always 0
/*02*/ u8 unk2; // does something if 2, always 0 in this build tho
/*03*/ u8 unk3; // does something if 1 or 2, always 0 in this build EXCEPT for action 6 (which is 2)
/*04*/ u16 unk4;
/*06*/ u16 unk6;
/*08*/ u32 unk8; // unused, always 0
/*0C*/ u32 unkC; // unused, always 0
/*10*/ u8 playerNo; // amseq channel? 0-3?
/*11*/ u8 seqID; // music/ambient ID
/*12*/ u8 volume; // 0-127
/*13*/ u8 bpm;
/*14*/ u8 unk14; // unused, by set by some actions
/*15*/ u8 fadeTimeDs; // the time it takes to fade volume in/out in tenths of a second (deciseconds)
/*16*/ u16 unk16;
/*18*/ u16 unk18;
/*1A*/ u16 unk1A;
/*1C*/ u32 unk1C; // unused, always 0
} MusicAction;

typedef struct {
/*00*/ Object *unk0;
/*04*/ MusicAction action;
/*24*/ s16 unk24;
/*26*/ s16 unk26;
/*28*/ s16 unk28;
} AMSEQHandle;

/*0x0*/ static u8 _data_0 = 0;
/*0x4*/ static u8 _data_4 = 0;
/*0x8*/ static Object *_data_8 = NULL;
/*0xC*/ static MusicAction* _data_C = NULL;

/*0x0*/ static AMSEQPlayer **sSeqPlayers; // pointer to array of 4 pointers
/*0x4*/ static ALBankFile **sBankFiles;
/*0x8*/ static ALSeqFile *sSeqFiles[2];
/*0x10*/ static struct oscstate *sOscStates;
/*0x14*/ static struct oscstate *sFreeOscStateList;
/*0x18*/ static AMSEQBss18 *_bss_18;
/*0x1C*/ static s32 _bss_1C;
/*0x20*/ static AMSEQHandle *sSeqHandles;
/*0x24*/ static s32 sNumSeqHandles; // current number of sequence handles
/*0x28*/ static u16 sVolumeGameOption; // set by game options, scales amseq volume
/*0x2A*/ static u16 sUnkVolume; // set to 256 and never changed, scales amseq volume
/*0x2C*/ static u16 sCurrGlobalVolume;

void dll_5_func_CC8(u8 arg0, u8 arg1, s16 arg2, s16 arg3, u16 arg4);
/*static*/ void dll_5_func_26D0(void);
/*static*/ void dll_5_func_1514(u8 arg0);
/*static*/ void dll_5_func_1924(u8 arg0);
static void dll_5_func_2AE0(u8 arg0, u8 arg1, u16 arg2, u16 arg3, u16 arg4, s8* arg5);
static void dll_5_func_14A0(AMSEQPlayer *arg0);
/*static*/ AMSEQPlayer* dll_5_func_135C(s32 arg0, s32 maxChannels, s32 maxVoices, s32 arg3, s32 maxEvents);
/*static*/ ALMicroTime dll_5_func_2C44(void **oscState,f32 *initVal, u8 oscType,
                                   u8 oscRate, u8 oscDepth, u8 oscDelay, u8 unk07);
/*static*/ ALMicroTime dll_5_func_3038(void *oscState, f32 *updateVal);
/*static*/ void dll_5_func_3434(void *oscState);
static s32 dll_5_func_1E8C(MusicAction *a0, s8 a1, s16 a2);

// offset: 0x0 | ctor
#ifndef NON_MATCHING
void dll_5_ctor(void *dll);
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/5_AMSEQ/dll_5_ctor.s")
#else
