#include "common.h"
#include "dlls/objects/325_trigger.h"
#include "libnaudio/n_libaudio.h"
#include "sys/audio.h"

extern s32 D_800967A0[127];
extern f32 D_8009699C[100];

// size:0x24C
typedef struct {
    u8 unk0;
    N_ALCSPlayer seqp;
    ALCSeq unk90;
    void *unk188;
    u8 unk18C;
    s16 unk18E;
    s16 unk190;
    u16 unk192;
    u16 unk194;
    u16 unk196;
    u16 unk198;
    u8 unk19A;
    u8 unk19B;
    s16 unk19C[16];
    u8 _unk1BC[0x1FC - 0x1BC];
    u8 unk1FC;
    s16 unk1FE;
    u16 unk200;
    s16 unk202;
    u16 unk204;
    u16 unk206;
    u16 unk208;
    u8 unk20A;
    u8 unk20B;
    u8 _unk20C[0x24C - 0x20C];
} AMSEQBss0;

typedef struct {
    s32 unk0;
    u8 _unk4[4];
} AMSEQBss18; 

typedef struct MusicAction {
    u8 unk0;
    u8 unk1;
    u8 unk2;
    u8 unk3;
    u16 unk4;
    u16 unk6;
    u32 unk8;
    u32 unkC;
    u8 unk10; // amseq channel? 0-3?
    u8 unk11; // music/ambient ID
    u8 unk12;
    u8 unk13;
    u8 unk14;
    u8 unk15;
    u16 unk16;
    u16 unk18;
    u16 unk1A;
    u32 unk1C;
} MusicAction;

typedef struct {
    Object *unk0;
    MusicAction unk4;
    s16 unk24;
    s16 unk26;
    u16 unk28;
} AMSEQBss20; 

/*0x0*/ static u8 _data_0 = 0;
/*0x4*/ static u8 _data_4 = 0;
/*0x8*/ static Object *_data_8 = NULL;
/*0xC*/ static MusicAction* _data_C = NULL;

/*0x0*/ static AMSEQBss0 **_bss_0; // pointer to array of 4 pointers
/*0x4*/ static ALBankFile **_bss_4;
/*0x8*/ static ALSeqFile *_bss_8[2];
/*0x10*/ static struct oscstate *_bss_10;
/*0x14*/ static struct oscstate *_bss_14;
/*0x18*/ static AMSEQBss18 *_bss_18;
/*0x1C*/ static s32 _bss_1C;
/*0x20*/ static AMSEQBss20 *_bss_20;
/*0x24*/ static s32 _bss_24;
/*0x28*/ static u16 _bss_28;
/*0x2A*/ static u16 _bss_2A;
/*0x2C*/ static u16 _bss_2C;

void dll_5_func_CC8(u8 arg0, u8 arg1, s16 arg2, s16 arg3, u16 arg4);
/*static*/ void dll_5_func_26D0(void);
/*static*/ void dll_5_func_1514(u8 arg0);
/*static*/ void dll_5_func_1924(u8 arg0);
static void dll_5_func_2AE0(u8 arg0, u8 arg1, u16 arg2, u16 arg3, u16 arg4, s8* arg5);
static void dll_5_func_14A0(AMSEQBss0 *arg0);
/*static*/ AMSEQBss0* dll_5_func_135C(s32 arg0, s32 maxChannels, s32 maxVoices, s32 arg3, s32 maxEvents);
/*static*/ ALMicroTime dll_5_func_2C44(void **oscState,f32 *initVal, u8 oscType,
                                   u8 oscRate, u8 oscDepth, u8 oscDelay, u8 unk07);
/*static*/ ALMicroTime dll_5_func_3038(void *oscState, f32 *updateVal);
/*static*/ void dll_5_func_3434(void *oscState);
/*static*/ s32 dll_5_func_1E8C(MusicAction *a0, s8 a1, s16 a2);

// offset: 0x0 | ctor
#ifndef NON_MATCHING
void dll_5_ctor(void *dll);
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/engine/5_AMSEQ/dll_5_ctor.s")
#else
// https://decomp.me/scratch/aRlW8
