#include "PR/ultratypes.h"
#include "PR/gbi.h"
#include "dll.h"
#include "types.h"
#include "game/gamebits.h"
#include "game/objects/interaction_arrow.h"
#include "game/objects/object_id.h"
#include "game/objects/object.h"
#include "sys/dll.h"
#include "sys/joypad.h"
#include "sys/main.h"
#include "sys/gfx/model.h"
#include "sys/gfx/modgfx.h"
#include "sys/objects.h"
#include "sys/objmsg.h"
#include "sys/objprint.h"
#include "sys/objtype.h"
#include "sys/rand.h"

#include "dlls/objects/common/collectable.h"
#include "dlls/objects/210_player.h"
#include "dlls/objects/297_scarab.h"
#include "dlls/objects/615_crawler.h"

typedef struct {
/*00*/ ObjSetup base;
/*18*/ s8 yaw;
/*19*/ s8 storedItemID;
/*1A*/ s16 storedItemQuantity;
/*1C*/ s16 unk1C;                   //some time (in seconds)
/*1E*/ s16 gamebit;
/*20*/ s16 autoThrowRadius;
} SmallBasket_Setup;

typedef struct{
/*00*/ s32 unk0;                //timer
/*04*/ s32 unk4;                //timer value to set for unk0
/*08*/ u32 soundHandle;
/*0C*/ s16 playerMessageLo;
/*0E*/ s16 playerMessageHi;
/*10*/ s16 unk10;               //timer
/*12*/ s16 autoThrowRadius;
/*14*/ s16 shakeSoundTimer;
/*16*/ s16 soundID;
/*18*/ s8 unused18;
/*19*/ s8 unused19;
/*1A*/ s16 unk1A;               //timer
/*1C*/ s16 unused1C;
/*1E*/ s16 gamebit;             //When gamebit is set, causes basket to disappear immediately after setup
/*20*/ s8 unused20;
/*21*/ s8 carryFlags;
/*22*/ s8 beingCarried;
/*23*/ s8 throwFlags;                //flags/modes?
/*24*/ s8 unused24;
/*25*/ u8 storedItemType;
/*26*/ u8 storedItemCount;
} SmallBasket_Data;

/** Contents of the basket */
typedef enum {
    SmallBasket_ITEM_Scorpion = 0,
    SmallBasket_ITEM_Scarab_Green = 1,
    SmallBasket_ITEM_Scarab_Red = 2,
    SmallBasket_ITEM_Scarab_Gold = 3,
    SmallBasket_ITEM_Scarab_Rainbow = 4,
    SmallBasket_ITEM_Energy_Egg = 5,
    SmallBasket_ITEM_Apple = 6,
    SmallBasket_ITEM_Prioritise_Health = 7  //Contents determined by player health (apples/Scarabs/nothing), with randomised counts
} SmallBasket_Items;

typedef enum {
    Basket_NOT_CARRIED = 0,
    Basket_FLAG_1 = 1,
    Basket_STOP_CARRYING = 2
} SmallBasket_Carry_Flags;

typedef enum {
    Basket_NOT_THROWN = 0,
    Basket_THROWN = 1,
    Basket_THROWN_No_Items = 2
} SmallBasket_Throw_Flags;

/*0x0*/ static DLL_IModgfx* dModGfxDLL = NULL;
/*0x4*/ static s32 _data_4[4] = {0, 0, 0, 0};

static s32 smallbasket_handle_being_lifted(Object* self, Object* player, SmallBasket_Data* objData);
static int smallbasket_handle_collision(Object* self);
static s32 smallbasket_create_items(Object* self, Object* player, SmallBasket_Data* objData);
static void smallbasket_handle_attack_collisions(Object* arg0, Object* arg1, SmallBasket_Data* arg2);

/*0x0*/ static Vec4f sVec;

// offset: 0x0 | ctor
void smallbasket_ctor(void *dll) { }

// offset: 0xC | dtor
void smallbasket_dtor(void *dll) { }

// offset: 0x18 | func: 0 | export: 0
void smallbasket_setup(Object* self, SmallBasket_Setup* setup, s32 arg2) {
    SmallBasket_Data* objData;

    objData = self->data;
    self->objhitInfo->unk44 = 0x10;
    self->objhitInfo->unk40 = 0x10;
    func_800267A4(self);
    obj_add_object_type(self, OBJTYPE_18);

    if (setup->unk1C == 0) {
        objData->unk4 = 0;
    } else {
        objData->unk4 = setup->unk1C * 60;
    }

    dModGfxDLL = dll_load_deferred(DLL_ID_107, 1);

    objData->shakeSoundTimer = rand_next(0, 100) + 300;
    objData->storedItemCount = setup->storedItemQuantity;
    self->srt.yaw = setup->yaw << 8;
    objData->gamebit = setup->gamebit;

    objData->autoThrowRadius = setup->autoThrowRadius;
    if (objData->autoThrowRadius == 0) {
        objData->autoThrowRadius = 20;
    }
    
    objData->unk1A = 800;
