//May have been stored as "game/anim.c" (based off leftover string at 0x2F1560 in SFA Kiosk's "default.dol")

#include "common.h"

#include "dlls/objects/214_animobj.h"
#include "prevent_bss_reordering.h"

s32* func_800349B0(void);

typedef enum {
/*00*/    ANIMCURVES_CHANNEL_headRotateZ = 0,
/*01*/    ANIMCURVES_CHANNEL_headRotateX = 1,
/*02*/    ANIMCURVES_CHANNEL_headRotateY = 2,
/*03*/    ANIMCURVES_CHANNEL_opacity = 3,
/*04*/    ANIMCURVES_CHANNEL_dayTime = 4,
/*05*/    ANIMCURVES_CHANNEL_scale = 5,
/*06*/    ANIMCURVES_CHANNEL_rotateZ = 6,
/*07*/    ANIMCURVES_CHANNEL_rotateY = 7,
/*08*/    ANIMCURVES_CHANNEL_rotateX = 8,
/*09*/    ANIMCURVES_CHANNEL_animSpeed = 9,
/*0A*/    ANIMCURVES_CHANNEL_animBlendSpeed = 10,
/*0B*/    ANIMCURVES_CHANNEL_translateZ = 11,
/*0C*/    ANIMCURVES_CHANNEL_translateY = 12,
/*0D*/    ANIMCURVES_CHANNEL_translateX = 13,
/*0E*/    ANIMCURVES_CHANNEL_fieldOfView = 14,
/*0F*/    ANIMCURVES_CHANNEL_eyeX = 15,
/*10*/    ANIMCURVES_CHANNEL_eyeY = 16,
/*11*/    ANIMCURVES_CHANNEL_jaw = 17,
/*12*/    ANIMCURVES_CHANNEL_soundVolume = 18
} AnimCurvesKeyframeChannels;

typedef enum {
/*FF*/    ANIMCURVES_EVENTS_setDuration = -1,
/*00*/    ANIMCURVES_EVENTS_timing = 0,
/*01*/    ANIMCURVES_EVENTS_unk1 = 1,
/*02*/    ANIMCURVES_EVENTS_playAnimation = 2,
/*03*/    ANIMCURVES_EVENTS_setObj = 3,
/*04*/    ANIMCURVES_EVENTS_blendShape = 4,
/*05*/    ANIMCURVES_EVENTS_unk5 = 5,
/*06*/    ANIMCURVES_EVENTS_sound = 6,
/*07*/    ANIMCURVES_EVENTS_unk7 = 7,
/*08*/    ANIMCURVES_EVENTS_unk8 = 8,
/*09*/    ANIMCURVES_EVENTS_unk9 = 9,
/*0A*/    ANIMCURVES_EVENTS_unkA = 10,
/*0B*/    ANIMCURVES_EVENTS_subEvent = 11,
/*0C*/    ANIMCURVES_EVENTS_unkC = 12,
/*0D*/    ANIMCURVES_EVENTS_setObjParam = 13,
/*0E*/    ANIMCURVES_EVENTS_setLoop = 14,
/*0F*/    ANIMCURVES_EVENTS_soundOther = 15,
/*7F*/    ANIMCURVES_EVENTS_stopSoundOther = 127
} AnimCurvesEvents;

typedef struct {
Vec3f unk0; 
s8 unkC;
} CameraFunc15Unk_unk74;

typedef struct {
    s8 unk0[0x74 - 0];
    CameraFunc15Unk_unk74* unk74; 
} CameraFunc15Unk;

typedef struct {
    s32 unk0;
    s32 unk4;
} AnimBSS0;

typedef struct {
    s16 unk0;
    s16 unk2;
    s16 unk4;
} SequenceBoneStructUnk;

typedef struct {
    Object *unk0;
    s32 unk4;
} ANIMBSSUnk0;

typedef struct{
    Object* object;
    Object* overrideObject;
} ANIMActorOverride;

typedef struct {
    u16 unk0;
    u16 unk2;
    u16 totalActors; //maybe?
} ANIMUnk698;

/*0x0*/ static const char str_0[] = "Max activates reached\n";
/*0x18*/ static const char str_18[] = "CODE OVERFLOW\n";
/*0x28*/ static const char str_28[] = "MAX_DECISION reached\n";
/*0x40*/ static const char str_40[] = "st->messages overflow\n";
/*0x58*/ static const char str_58[] = " MODEL NO %i \n";
/*0x68*/ static const char str_68[] = " Could Not FInd Obj %i  over %i \n";
/*0x8C*/ static const char str_8C[] = "****END\n";
/*0x98*/ static const char str_98[] = "endObjSequence: too many obj frees\n";
/*0xBC*/ static const char str_BC[] = "preemptSequenceTime() Overflow!!\n";

/*0x0*/ static u32 _data_0 = 0x00000000;
/*0x4*/ static u32 _data_4[] = {
    0x00000000, 0xff000000
};
/*0xC*/ static f32 _data_C[] = {
    60.0, 0.0
};
/*0x14*/ static s16 _data_14[] = {
    0, 0
};
/*0x18*/ static s16 _data_18[] = {
    0, 0
};
/*0x1C*/ static s8 _data_1C[4] = {0,0,0,0};
/*0x20*/ static s32 _data_20 = -1;
/*0x24*/ static Object *_data_24 = 0;
/*0x28*/ static s8 _data_28[] = {
    0, 0, 0, 0
};
/*0x2C*/ static s32 _data_2C = {
    0
};
/*0x30*/ static u32 _data_30[] = {
    0x00000000
};
/*0x34*/ static u32 _data_34[] = {
    0x00008000, 0x00004000, 0x00000002, 0x00000001, 0x00000004, 0x00000008, 0xffffffff
};
/*0x50*/ static u32 _data_50[] = {
    0x00050001, 0x00050002, 0x00050003, 0x00060001, 0x00060002, 0x000a0001, 0x000a0002, 0x000a0003, 
    0x00000008, 0x00000009, 0x00030002, 0x00030003, 0x000a0004, 0x000a0005, 0x000a0006, 0x000f000b, 
    0x000f000c, 0x000f000d, 0x000f000e, 0x000f000f, 0x000f0010, 0x00130001, 0x00130002
};
/*0xAC*/ static u32 _data_AC[] = {
    0x00000000, 0x00000000, 0x00000202, 0x00000001, 0x01010101, 0x01000000
};
/*0xC4*/ static u32 _data_C4[] = {
    0x00000000
};
/*0xC8*/ static u32 _data_C8[] = {
    0x00000000, 0x00000000
};

/*0x0*/ static ANIMBSSUnk0 _bss_0[4];
/*0x20*/ static s8 _bss_20; //count of items in bss0?
/*0x24*/ static u32 _bss_24;
/*0x28*/ static u8 _bss_28[0x4];
/*0x2C*/ static u8 _bss_2C[0x4];
/*0x30*/ static u8 _bss_30[0x2];
/*0x32*/ static u8 _bss_32[0x1];
/*0x33*/ static u8 _bss_33[0x1];
/*0x34*/ static u8 _bss_34[0x4];
/*0x38*/ static u8 _bss_38[0x8];
/*0x40*/ static u8 _bss_40[0x48];
/*0x88*/ static u8 _bss_88[0x1];
/*0x89*/ static u8 _bss_89[0x1];
/*0x8A*/ static u8 _bss_8A[0x1];
/*0x8B*/ static s8 _bss_8B;
/*0x8C*/ static s32 _bss_8C;
/*0x90*/ static s32 _bss_90;
/*0x94*/ static s32 _bss_94;
/*0x98*/ static s32 _bss_98;
/*0x9C*/ static u8 _bss_9C[0x4];
/*0xA0*/ static f32 _bss_A0;
/*0xA4*/ static s8 _bss_A4[0x4];
/*0xA8*/ static s8 _bss_A8[ANIMCURVES_SCENES_MAX];
/*0xD8*/ static s8 _bss_D8[ANIMCURVES_SCENES_MAX];
/*0x108*/ static s8 _bss_108[ANIMCURVES_SCENES_MAX];
/*0x138*/ static s8 _bss_138[ANIMCURVES_SCENES_MAX];
/*0x168*/ static s8 _bss_168[ANIMCURVES_SCENES_MAX];
/*0x198*/ static s8 _bss_198[ANIMCURVES_SCENES_MAX];
/*0x1C8*/ static s8 _bss_1C8[ANIMCURVES_SCENES_MAX];
/*0x1F8*/ static s16 _bss_1F8[ANIMCURVES_SCENES_MAX];
/*0x258*/ static s16 _bss_258[ANIMCURVES_SCENES_MAX];
/*0x2B8*/ static u8 _bss_2B8[0x8];
/*0x2C0*/ static u8 _bss_2C0[0x58];
/*0x318*/ static u16 _bss_318[0x4];
/*0x320*/ static u8 _bss_320[0x58];
/*0x378*/ static s8 _bss_378[ANIMCURVES_SCENES_MAX];
/*0x3A8*/ static u8 _bss_3A8[0x8];
/*0x3B0*/ static u8 _bss_3B0[0x28];
/*0x3D8*/ static s32 _bss_3D8[ANIMCURVES_SCENES_MAX];
/*0x490*/ static s8 _bss_490[ANIMCURVES_SCENES_MAX];
/*0x4C0*/ static u8 _bss_4C0[0x30];
/*0x4F0*/ static u8 _bss_4F0[0xb4];
/*0x5A4*/ static u8 _bss_5A4[0x4];
/*0x5A8*/ static u8 _bss_5A8[0x4];
/*0x5AC*/ static u8 _bss_5AC[0x4];
/*0x5B0*/ static u8 _bss_5B0[0x8];
/*0x5B8*/ static Vec3f _bss_5B8;
/*0x5C4*/ static u8 _bss_5C4[0x4];
/*0x5C8*/ static u8 _bss_5C8[0x4];
/*0x5CC*/ static u8 _bss_5CC[0x4];
/*0x5D0*/ static u8 _bss_5D0[0x4];
/*0x5D4*/ static u8 _bss_5D4[0x4];
/*0x5D8*/ static void* _bss_5D8; //sequence file buffer
/*0x5DC*/ static u8 _bss_5DC[0x4];
/*0x5E0*/ static u8 _bss_5E0[0x4];
/*0x5E4*/ static u8 _bss_5E4[0x4];
/*0x5E8*/ static u8 _bss_5E8[0x8];
/*0x5F0*/ static u8 _bss_5F0[0xa0];
/*0x690*/ static u8 _bss_690[0x8];
/*0x698*/ static ANIMUnk698 _bss_698[1];
/*0x69E*/ static u8 _bss_69E[0x2];
/*0x6A0*/ static u8 _bss_6A0[0x58];
/*0x6F8*/ static s8 _bss_6F8;
/*0x6FC*/ static s32 _bss_6FC;
/*0x700*/ static s16 _bss_700[2];
/*0x708*/ static ANIMActorOverride _bss_708[44][16];
/*0x1D0C*/ static u8 _bss_1D0C[0x7C];
/*0x1D88*/ static u8 _bss_1D88[8];

void dll_3_func_98(void);
static s32 dll_3_func_4BAC(Object* animObj, Object *parent, f32 x, f32 y, f32 z, f32* yOut, f32 ySetup);
void dll_3_func_7B64(AnimObj_Data*);
s32 dll_3_func_9524(Object * arg0, AnimObj_Data *arg1, s32 arg2, s32 arg3, s32 arg4, s32 arg5, s32 arg6);

// offset: 0x0 | ctor
void dll_3_ctor(void *dll) {
    _bss_5D8 = mmAlloc(0x10, ALLOC_TAG_ANIMSEQ_COL, 0);
    dll_3_func_98();
}

// offset: 0x58 | dtor
void dll_3_dtor(void *dll) {
    mmFree(_bss_5D8);
}

// offset: 0x98 | func: 0 | export: 0
void dll_3_func_98(void) {
    s32 i;

    for (i = 0; i < ANIMCURVES_SCENES_MAX; i++) {
        _bss_108[i] = 0;
        _bss_138[i] = 0;
        _bss_168[i] = 0;
        _bss_A8[i] = 0;
        _bss_D8[i] = 0;
        _bss_198[i] = 0;
        _bss_1C8[i] = 0;
        _bss_1F8[i] = 0;
        _bss_258[i] = -1;
        _bss_378[i] = 0;
        _bss_3D8[i] = 0;
        _bss_490[i] = 0;
    }

    _bss_20 = 0;
    _bss_8C = 0;
