#include "PR/ultratypes.h"
#include "dlls/objects/210_player.h"
#include "game/objects/interaction_arrow.h"
#include "game/objects/object.h"
#include "game/objects/object_id.h"
#include "sys/gfx/animseq.h"
#include "sys/asset_thread.h"
#include "sys/curves.h"
#include "sys/dll.h"
#include "sys/fs.h"
#include "sys/joypad.h"
#include "sys/memory.h"
#include "sys/menu.h"
#include "sys/objlib.h"
#include "sys/objmsg.h"
#include "sys/segment_13D0.h"
#include "sys/segment_1460.h"
#include "sys/framebuffer_fx.h"
#include "sys/gfx/projgfx.h"
#include "macros.h"
#include "dll.h"
#include "dongle.h"

// official filename: game/anim.c (default.dol)

// Maximum number of active object sequences
#define MAX_SEQSLOTS 45
// Maximum number of actors in an object sequence
#define MAX_ACTORS 16
#define MAX_ACTIVATES 16
#define ANIMCURVES_IS_OBJSEQ2CURVE_INDEX 0x8000

// Some names inferred from default.dol
enum AnimEventType {
    ANIM_EVT_SETDURATION = -1,
    ANIM_EVT_SETTIME = 0,
    ANIM_EVT_MOVEMODE = 1,
    ANIM_EVT_ANIM = 2,
    ANIM_EVT_OVERRIDE = 3,
    ANIM_EVT_VTXANIM = 4,
    ANIM_EVT_SOFTWARE = 5,
    ANIM_EVT_SFX = 6,
    ANIM_EVT_GROUND_MODE = 7,
    ANIM_EVT_TUNE = 8,
    ANIM_EVT_ANGLE_MODE = 9,
    ANIM_EVT_LOOK_AT = 10,
    ANIM_EVT_CODE = 11,
    ANIM_EVT_SPEECH = 12,
    ANIM_EVT_ENVFX = 13, // TODO: "ENVFX" is presumably the official name but maybe we can do better?
    ANIM_EVT_STORYBOARD = 14,
    ANIM_EVT_SFX_WITH_DURATION = 15
};

// Subtypes for ANIM_EVT_ENVFX

    ANIM_SCREEN_FX_FBFX_FADE_OUT_DOWN_FADE_IN = FBFX_FADE_OUT_DOWN_FADE_IN,
    ANIM_SCREEN_FX_FBFX_FADE_OUT_UP_FADE_IN = FBFX_FADE_OUT_UP_FADE_IN,
    ANIM_SCREEN_FX_FBFX_FBFX_FADE_OUT = FBFX_FADE_OUT

};

// Subtypes for ANIM_EVT_CODE
enum AnimCodeEventType {
    ANIM_CODE_EVT_JUMPTOTIME = 1,
    ANIM_CODE_EVT_SET = 2,
    ANIM_CODE_EVT_COUNTER_ADD = 3,
    ANIM_CODE_EVT_PAUSE = 4,
    ANIM_CODE_EVT_CONTINUE = 5,
    ANIM_CODE_EVT_6 = 6,
    ANIM_CODE_EVT_MESSAGE = 7,
    ANIM_CODE_EVT_DECISION = 8,
    ANIM_CODE_EVT_JUMPTARGET = 9,
    ANIM_CODE_EVT_JUMPTOLABEL = 10
};

// Subtypes for ANIM_CODE_EVT_SET
enum AnimSetCodeEventType {
    ANIM_CODE_EVT_SET_MESSAGE = 0,
    ANIM_CODE_EVT_SET_COUNTER = 1,
    ANIM_CODE_EVT_SET_ANIMCOUNT1 = 3,
    ANIM_CODE_EVT_SET_ANIMCOUNT2 = 4,
    ANIM_CODE_EVT_SET_FLAGS = 5,
    ANIM_CODE_EVT_SET_BIT = 6
};

// Subtypes for ANIM_CODE_EVT_COUNTER_ADD
enum AnimCounterAddCodeEventType {
    ANIM_CODE_EVT_COUNTER_ADD_ENABLED = 0,
    ANIM_CODE_EVT_COUNTER_ADD_DISABLED = 1
};

// Subtypes for ANIM_CODE_EVT_6
enum Anim6CodeEventType {
    ANIM_CODE_EVT_6_END = 0, // signal end of seq for the current object
    ANIM_CODE_EVT_6_2 = 2, // curve related
    ANIM_CODE_EVT_6_5 = 5, // sfx related, noop
    ANIM_CODE_EVT_6_6 = 6, // sfx related, noop
    ANIM_CODE_EVT_6_CAMERA_SHAKE = 7,
    ANIM_CODE_EVT_6_9 = 9,
    ANIM_CODE_EVT_6_COUNTUP_TIMER = 10,
    ANIM_CODE_EVT_6_COUNTDOWN_TIMER = 11,
    ANIM_CODE_EVT_6_COUNTDOWN_TIMER_SFX = 12,
    ANIM_CODE_EVT_6_SFX_STOP = 13,
    ANIM_CODE_EVT_6_14 = 14,
    ANIM_CODE_EVT_6_15 = 15,
    ANIM_CODE_EVT_6_16 = 16,
    ANIM_CODE_EVT_6_TOGGLE_LETTERBOX = 18,
    ANIM_CODE_EVT_6_ENABLE_LETTERBOX = 19,
    ANIM_CODE_EVT_6_PATH_CAMERA = 20,
    ANIM_CODE_EVT_6_SET_MODEL = 23,
    ANIM_CODE_EVT_6_24 = 24,
    ANIM_CODE_EVT_6_25 = 25,
    ANIM_CODE_EVT_6_NORMAL_CAMERA = 26,
    ANIM_CODE_EVT_6_ENABLE_OBJ_GROUP = 27,
    ANIM_CODE_EVT_6_DISABLE_OBJ_GROUP = 28,
    ANIM_CODE_EVT_6_SET_ACT = 29,
    ANIM_CODE_EVT_6_DISABLE_LETTERBOX = 30,
    ANIM_CODE_EVT_6_RESTART_CLEAR = 31,
    ANIM_CODE_EVT_6_RESTART_GOTO = 32,
    ANIM_CODE_EVT_6_33 = 33,
    ANIM_CODE_EVT_6_34 = 34,
    ANIM_CODE_EVT_6_SAVEPOINT = 35,
    ANIM_CODE_EVT_6_SAVEPOINT_NO_LOCATION = 36,
    ANIM_CODE_EVT_6_TOGGLE_PLAYER_CONTROL = 37
};

enum AnimCurvesKeyframeChannels {
/*00*/ CHANNEL_headRotateZ = 0,
/*01*/ CHANNEL_headRotateX = 1,
/*02*/ CHANNEL_headRotateY = 2,
/*03*/ CHANNEL_opacity = 3,
/*04*/ CHANNEL_dayTime = 4,
/*05*/ CHANNEL_scale = 5,
/*06*/ CHANNEL_rotateZ = 6,
/*07*/ CHANNEL_rotateY = 7,
/*08*/ CHANNEL_rotateX = 8,
/*09*/ CHANNEL_animSpeed = 9,
/*0A*/ CHANNEL_animBlendSpeed = 10,
/*0B*/ CHANNEL_translateZ = 11,
/*0C*/ CHANNEL_translateY = 12,
/*0D*/ CHANNEL_translateX = 13,
/*0E*/ CHANNEL_fieldOfView = 14,
/*0F*/ CHANNEL_eyeX = 15,
/*10*/ CHANNEL_eyeY = 16,
/*11*/ CHANNEL_jaw = 17,
/*12*/ CHANNEL_soundVolume = 18
};

enum KeyframeInterpolationType {
    KF_INTERP_Hermite = 0,
    KF_INTERP_Linear = 1,
    KF_INTERP_Stepped = 2
};

typedef union {
    struct {
        f32 start;
        f32 end;
        f32 outTangentStart;
        f32 inTangentEnd;
    };
    f32 v[4];
} SplinePoints;

#define KEY_TYPE(keyframe) (keyframe.interpolation & 3)
#define KEY_EASE(keyframe) (keyframe.interpolation >> 2)

enum AnimEventConditionType {
    ANIM_EVTCOND_COUNTER_LTE_ZERO = 1,
    ANIM_EVTCOND_COUNTER_GT_ZERO = 2,
    ANIM_EVTCOND_DAYTIME = 3,
    ANIM_EVTCOND_NIGHTTIME = 4,
    ANIM_EVTCOND_EVENTFLAG_FALSE = 5,
    ANIM_EVTCOND_EVENTFLAG_TRUE = 6,
    ANIM_EVTCOND_7 = 7,
    ANIM_EVTCOND_8 = 8,
    ANIM_EVTCOND_ANIMCOUNTER1_LTE_ZERO = 9,
    ANIM_EVTCOND_ANIMCOUNTER1_GT_ZERO = 10,
    ANIM_EVTCOND_ANIMCOUNTER2_LTE_ZERO = 11,
    ANIM_EVTCOND_ANIMCOUNTER2_GT_ZERO = 12,
    ANIM_EVTCOND_13 = 13, // countdown timer related
    ANIM_EVTCOND_14 = 14, // countdown timer related
    ANIM_EVTCOND_16 = 16,
    ANIM_EVTCOND_17 = 17
};

enum ActorSettings {
    ACTORSETTING_UNK4000 = 0x4000, // look for existing obj to override
    ACTORSETTING_UNK8000 = 0x8000
};

// TODO: better name
enum ActorUpperSettings {
    ACTORUSETTING_DONT_OVERRIDE_POS = 0x1,
    ACTORUSETTING_DONT_OVERRIDE_ROT = 0x2,
    ACTORUSETTING_ZERO_YAW = 0x4,
    ACTORUSETTING_SKIPPABLE = 0x8, // whether the seq can be skipped with L trigger
    ACTORUSETTING_NO_LETTERBOX = 0x10,
    ACTORUSETTING_UNK20 = 0x20
};

// size:0x8
typedef struct {
    u32 uid;
    u16 settings;
    u16 objID;
} Actor;

typedef struct {
    Vec3f coord; 
    s8 unkC;
} CameraFunc15Unk_unk74; //Related to CameraAction and Unk_DLL2_Func888? TO-DO: figure out

typedef struct {
    Object *obj;
    s32 preemptTime;
} PreemptTime;

typedef struct{
    Object* object;
    Object* overrideObject;
} ANIMActorOverride;

typedef struct {
    s16 seqSlot;
    s16 startTime;
    u16 numActors;
} Activate;

typedef struct {
    Object* actor;
    s16 value;
    s8 type;
} QueuedEnvFx;

typedef struct {
    s32* events; // pointer to list of code events
    s16 numEvents;
    s16 time; // timestamp of code event
} CodeEventList;

/*0x0*/ static s16 _data_0 = 0;
/*0x4*/ static s16 _data_4 = 0;
/*0x8*/ static s16 _data_8 = 0xff00;
/*0xC*/ static f32 _data_C = 60.0;
/*0x10*/ static f32 _data_10 = 0.0f;
/*0x14*/ static s16 sAnimCounter1 = 0;
/*0x18*/ static s16 sAnimCounter2 = 0;
/*0x1C*/ static u8 _data_1C = 0;
/*0x20*/ static s32 sVariableObjID = -1; // object ID of the thing the player should hold when playing the first time pickup sequence
/*0x24*/ static Object* _data_24 = 0;
/*0x28*/ static s8 _data_28 = 0;
/*0x2C*/ static s32 _data_2C = 0;
/*0x30*/ static s8 _data_30 = 0;
/*0x34*/ static s32 sButtonMasks[] = {
    A_BUTTON, 
    B_BUTTON, 
    L_CBUTTONS, 
    R_CBUTTONS, 
    D_CBUTTONS, 
    U_CBUTTONS, 
    -1
};
/*0x50*/ static u32 sObjMesgIDs[] = {
    0x00050001, 0x00050002, 0x00050003, 0x00060001, 0x00060002, 0x000a0001, 0x000a0002, 0x000a0003, 
    0x00000008, 0x00000009, 0x00030002, 0x00030003, 0x000a0004, 0x000a0005, 0x000a0006, 0x000f000b, 
    0x000f000c, 0x000f000d, 0x000f000e, 0x000f000f, 0x000f0010, 0x00130001, 0x00130002
};
/*0xAC*/ static s8 _data_AC[] = {
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
    0x00, 0x00, 0x02, 0x02, 0x00, 0x00, 0x00, 0x01, 
    0x01, 0x01, 0x01, 0x01, 0x01, 0x00, 0x00, 0x00
};
/*0xC4*/ static s16 _data_C4 = 0;

/*0x0*/ static PreemptTime sPreemptTimeList[4];
/*0x20*/ static s8 sPreemptTimeListCount;
/*0x24*/ static f32 _bss_24;
/*0x28*/ static f32 _bss_28;
/*0x2C*/ static f32 _bss_2C;
/*0x30*/ static s16 _bss_30;
/*0x32*/ static s8 _bss_32;
/*0x33*/ static s8 _bss_33;
/*0x38*/ static QueuedEnvFx sEnvFxQueue[10];
/*0x88*/ static s8 sEnvFxQueueCount;
/*0x89*/ static s8 _bss_89;
/*0x8A*/ static s8 _bss_8A;
/*0x8B*/ static s8 _bss_8B;
/*0x8C*/ static s32 sCameraModule;
/*0x90*/ static s32 _bss_90;
/*0x94*/ static s32 _bss_94;
/*0x98*/ static s32 _bss_98;
/*0x9C*/ static s16 sPendingWarpID;
/*0xA0*/ static f32 _bss_A0;
/*0xA4*/ static s8 sSeqEnded; // when true, the seq for the current object ended
/*0xA8*/ static s8 _bss_A8[MAX_SEQSLOTS];
/*0xD8*/ static s8 _bss_D8[MAX_SEQSLOTS];
/*0x108*/ static s8 _bss_108[MAX_SEQSLOTS];
/*0x138*/ static s8 sEventFlags[MAX_SEQSLOTS];
/*0x168*/ static s8 sSlotInUse[MAX_SEQSLOTS];
/*0x198*/ static s8 _bss_198[MAX_SEQSLOTS];
/*0x1C8*/ static s8 _bss_1C8[MAX_SEQSLOTS];
/*0x1F8*/ static s16 _bss_1F8[MAX_SEQSLOTS];
/*0x258*/ static s16 _bss_258[MAX_SEQSLOTS];
/*0x2B8*/ static s16 _bss_2B8[MAX_SEQSLOTS];
/*0x318*/ static s16 _bss_318[MAX_SEQSLOTS];
/*0x378*/ static u8 _bss_378[MAX_SEQSLOTS];
/*0x3A8*/ static u8 _bss_3A8[MAX_SEQSLOTS];
/*0x3D8*/ static s32 sSlotObjID[MAX_SEQSLOTS]; // TODO: also ends up being the UID of the first actor?
/*0x490*/ static u8 _bss_490[MAX_SEQSLOTS];
/*0x4C0*/ static u8 _bss_4C0[MAX_SEQSLOTS];
/*0x4F0*/ static f32 _bss_4F0[MAX_SEQSLOTS];
/*0x5A4*/ static f32 _bss_5A4;
/*0x5A8*/ static f32 _bss_5A8;
/*0x5AC*/ static u8 _bss_5AC;
/*0x5B0*/ static f32 _bss_5B0;
/*0x5B8*/ static Vec3f _bss_5B8;
/*0x5C4*/ static f32 _bss_5C4;
/*0x5C8*/ static s32 _bss_5C8;
/*0x5CC*/ static s8 sProcessedAnimCallback;
/*0x5D0*/ static s32 _bss_5D0;
/*0x5D4*/ static s32 _bss_5D4;
/*0x5D8*/ static void* sTempBuffer; //sequence file buffer
/*0x5DC*/ static f32 _bss_5DC;
/*0x5E0*/ static f32 _bss_5E0;
/*0x5E4*/ static f32 _bss_5E4;
/*0x5E8*/ static f32 _bss_5E8;
/*0x5F0*/ static CodeEventList sCodeEvtQueue[20];
/*0x690*/ static s32 sCodeEvtQueueCount;
/*0x694*/ static u8 _bss_694[0x4]; // unused gap
/*0x698*/ static Activate sActivates[MAX_ACTIVATES];
/*0x6F8*/ static s8 sActivatesCount;
/*0x6FC*/ static Object *_bss_6FC; // camera animobj (AnimCamera)?
/*0x700*/ static s16 _bss_700;
/*0x708*/ static ANIMActorOverride sOverrides[MAX_SEQSLOTS][16];
typedef struct {
    u32 unk0_8: 1;
    u32 unk0_1: 31; // unused
} UnkBss1D88;
/*0x1D88*/ static UnkBss1D88 _bss_1D88;

void anim_init(void);
static s32 anim_find_obj_ground_y(Object* animObj, Object *parent, f32 x, f32 y, f32 z, f32* yOut, f32 ySetup);
void anim_init_curve_keyframes(AnimObj_Data* st);
s32 anim_func_9524(Object* actor, AnimObj_Data* st, s16 arg2, s16 arg3, s16 arg4, s16 arg5, s16 arg6);
static void anim_func_9DD4(void);
static void anim_func_9B70(Object* arg1, Object* animObj, AnimObj_Data* st);
static void anim_override_list_clear(s32 slot);
void anim_end_obj_sequence(s32 slot);
static s32 anim_get_preempt_time(Object* obj);
static void anim_func_9CE8(s32 arg0);
static Object* anim_override_list_get(s32 seqSlot, Object* searchObject);
static Object* anim_find_animobj_target_in_world(Object* animObj);
s32 anim_func_8878(void);
static f32 anim_calc_channel_value_at_time(AnimCurvesKeyframe* keyframes, s32 count, s32 time);
static void anim_func_5A48(UnkAnimStruct* arg0, CurveSetup* a2, CurveSetup* a3, f32 a4, s8 a5);
