#include "dlls/engine/27.h"
#include "dlls/engine/4_race.h"
#include "dlls/objects/214_animobj.h"
#include "game/gamebits.h"
#include "game/objects/object_id.h"
#include "sys/dll.h"
#include "sys/gfx/modgfx.h"
#include "sys/joypad.h"
#include "sys/main.h"
#include "sys/objtype.h"
#include "sys/objanim.h"
#include "sys/rand.h"
#include "dll.h"
#include "functions.h"
#include "prevent_bss_reordering.h"

typedef struct {
/*00*/ Vec3f unk0;
/*0C*/ Vec3f unkC;
/*18*/ f32 unk18; // also gravity kinda?
/*1C*/ f32 unk1C;
/*20*/ f32 unk20;
/*24*/ f32 _unk24;
/*28*/ f32 unk28; // gravity?
/*2C*/ f32 unk2C;
/*30*/ f32 unk30; // friction?
} IMSnowBike_Data_2AC;

typedef struct {
/*00*/ u8 _unk0[0xE - 0x0];
/*0E*/ s8 turnInput; // for players, this is joystick X
/*0F*/ s8 thrustInput; // for players, this is joystick Y
/*10*/ s32 unk10;
} IMSnowBike_Data_2E0;

typedef struct {
/*000*/ SRT unk0;
/*018*/ RaceStruct unk18; // racePos
/*03C*/ u8 _unk3C[0x48 - 0x3C];
/*048*/ u8 unk48;
/*049*/ u8 unk49;
/*04A*/ u8 _unk4A[0x4C - 0x4A];
/*04C*/ DLL27_Data unk4C;
/*2AC*/ IMSnowBike_Data_2AC unk2AC;
/*2E0*/ IMSnowBike_Data_2E0 unk2E0;
/*2F4*/ DLL_IModgfx *unk2F4;
/*2F8*/ DLL_IModgfx *unk2F8;
/*2FC*/ u8 _unk2FC[0x32C - 0x2FC];
/*32C*/ Vec3f unk32C[5];
/*368*/ u8 _unk368[0x380 - 0x368];
/*380*/ f32 unk380;
/*384*/ f32 unk384;
/*388*/ f32 unk388;
/*38C*/ f32 unk38C;
/*390*/ f32 unk390;
/*394*/ f32 unk394;
/*398*/ f32 unk398;
/*39C*/ f32 unk39C;
/*3A0*/ f32 unk3A0;
/*3A4*/ f32 unk3A4;
/*3A8*/ f32 unk3A8;
/*3AC*/ f32 unk3AC;
/*3B0*/ f32 unk3B0;
/*3B4*/ u32 unk3B4; // sound handle
/*3B8*/ u32 unk3B8;
/*3BC*/ u32 unk3BC;
/*3C0*/ u32 unk3C0;
/*3C4*/ s32 unk3C4;
/*3C8*/ s16 unk3C8;
/*3CA*/ s16 unk3CA;
/*3CC*/ s16 unk3CC;
/*3CE*/ s16 unk3CE;
/*3D0*/ s16 unk3D0;
/*3D2*/ s16 unk3D2; // downward tilt while in air?
/*3D4*/ u8 _unk3D4[0x3D6 - 0x3D4];
/*3D6*/ s16 unk3D6;
/*3D8*/ s16 unk3D8;
/*3DA*/ s8 unk3DA;
/*3DB*/ u8 unk3DB;
/*3DC*/ u8 unk3DC;
/*3DD*/ u8 flags;
/*3DE*/ s8 unk3DE; // state?
/*3DF*/ s8 unk3DF;
/*3E0*/ s8 unk3E0;
/*3E1*/ s8 unk3E1;
} IMSnowBike_Data;

typedef struct {
/*00*/ ObjSetup base;
/*18*/ u8 unk18;
/*19*/ u8 unk19;
/*1A*/ s16 unk1A;
/*1C*/ u8 unk1C;
/*1D*/ u8 unk1D;
/*1E*/ s16 unk1E;
} IMSnowBike_Setup;

enum IMSnowBikeFlags {
    SNOWBIKEFLAG_NONE = 0x0,
    SNOWBIKEFLAG_1 = 0x1,
    SNOWBIKEFLAG_2 = 0x2,
    SNOWBIKEFLAG_GROUNDED = 0x4, // at least one test point touching the ground
    SNOWBIKEFLAG_8 = 0x8,
    SNOWBIKEFLAG_10 = 0x10, // currently in sequence?
    SNOWBIKEFLAG_IS_CPU = 0x20 // is SharpClaw
};

/*0x0*/ static Vec3f _data_0[] = {
    {-6.5f, 0.0f, -7.0f}, 
    { 6.5f, 0.0f, -7.0f}, 
    { 6.5f, 0.0f,  7.0f}, 
    {-6.5f, 0.0f,  7.0f}
};
/*0x30*/ static f32 _data_30[] = {
    0.0f, 0.0f, 0.0f, 0.0f
};
/*0x40*/ static Vec3f _data_40[] = {
    {0.0f, 1.0f, -18.0f}, 
    {-6.5f, 1.0f, -7.0f}, 
    {6.5f, 1.0f, -7.0f}, 
    {-6.0f, 1.0f, 11.0f}, 
    {6.0f, 1.0f, 11.0f}
};
/*0x7C*/ static f32 _data_7C[] = {
    5.0f, 4.0f, 4.0f, 4.5f, 4.5f
};
/*0x90*/ static Vec3f _data_90[] = {
    {14.5f, 0.0f, 9.0f}, 
    {-14.5f, 0.0f, 9.0f}
};
/*0xA8*/ static DLL_IModgfx *_data_A8 = NULL;

/*0x0*/ static Texture *_bss_0;
/*0x4*/ static Texture *_bss_4;
/*0x8*/ static SRT _bss_8;

void dll_711_func_1760(Object *self);
static void dll_711_func_1870(Object *self, IMSnowBike_Data *objdata, Gfx **gdl, Mtx **mtxs, Vertex **vtxs, Triangle **pols);
static void dll_711_func_1ED0(Object *self, IMSnowBike_Data_2AC *a1);
static void dll_711_func_1F54(Object *self, IMSnowBike_Data *objdata, IMSnowBike_Data_2AC *arg2, f32 updateRate, s32 arg4);
static void dll_711_func_2BA0(Object *self, IMSnowBike_Data *objdata, IMSnowBike_Data_2AC *arg2, f32 updateRate, s32 arg4);
static void dll_711_func_33B4(Object *self, IMSnowBike_Data_2E0 *arg1, u8 port, s32 buffer);
static void dll_711_func_3430(Object *self, IMSnowBike_Data *objdata, MtxF *a2, s32 a3, s32 a4, s32 a5);
static void dll_711_func_34E4(Object *self, IMSnowBike_Data *objdata);
static int dll_711_func_3598(Object *a0, Object *a1, AnimObj_Data *a2, s8 a3);
static void dll_711_func_3780(Object *self, IMSnowBike_Data *objdata, DLL27_Data *arg2);
