#include "PR/ultratypes.h"
#include "dlls/engine/6_amsfx.h"
#include "dlls/objects/214_animobj.h"
#include "game/objects/object.h"
#include "sys/gfx/model.h"
#include "sys/objects.h"
#include "sys/objtype.h"
#include "game/objects/object_id.h"
#include "functions.h"
#include "dll.h"
#include "sys/main.h"
#include "sys/map_enums.h"
#include "sys/dll.h"
#include "dlls/modgfx/139.h"
#include "dlls/objects/573_SB_Cloudrunner.h"
#include "sys/joypad.h"
#include "sys/rand.h"
#include "game/gamebits.h"
#include "game/gametexts.h"

#define HINT_COUNTER_MAX 200
// 80 in map_enums.h is MOBILE_MAP_DIM2ICEFLOE2...
#define SOME_MAP_ID 80

typedef struct {
/*00*/ f32 x1;
/*04*/ f32 y1;
/*08*/ f32 z1;
/*0C*/ f32 cloudrunnerZ;
/*10*/ s8 _unk10[0x1C - 0x10];
/*1C*/ f32 unk1C;
/*20*/ s16 unk20;
/*22*/ s16 unk22;
/*24*/ s16 unk24;
/*26*/ s16 unk26;
/*28*/ s8 unk28;
/*29*/ s8 unk29;
/*2A*/ s8 unk2A;
/*2B*/ s8 unk2B;
/*2C*/ f32 x2;
/*30*/ f32 y2;
/*34*/ f32 z2;
/*38*/ f32 unk38;
/*3C*/ f32 unk3C;
/*40*/ f32 unk40;
/*44*/ f32 unk44;
/*48*/ Object *cloudrunner;
/*4C*/ Object *shiphead;
/*50*/ void *dll;
/*54*/ f32 x3;
/*58*/ f32 y3;
/*5C*/ f32 z3;
/*60*/ f32 x4;
/*64*/ f32 y4;
/*68*/ f32 z4;
/*6C*/ u32 soundHandle;
/*70*/ u32 soundHandle2;
/*74*/ s16 unk74;
/*76*/ s16 unk76;
/*78*/ s16 unk78;
/*7A*/ s16 unk7A;
/*7C*/ s8 state;
/*7D*/ s8 unk7D;
/*7E*/ s16 mapID;
/*80*/ u8  unk80;
/*82*/ s16 unk82;
/*84*/ s8 unk84;
/*85*/ s8 unk85;
/*86*/ s8 unk86;
/*88*/ s16 _unk88;
/*8A*/ u8 unk8A;
/*8B*/ u8 unk8B;
/*8C*/ s16 hintCounter;
/*8E*/ s8 unk8E;
} SB_Galleon_Data;

typedef struct {
/*00*/ Texture *tex1;
/*04*/ Texture *tex2;
/*08*/ s8 fadeoutStarted;
} Data0;

/*0x0*/ static Data0 _data_0 = { NULL, NULL, FALSE };

enum SB_Galleon_State {
    STATE_0,
    STATE_1,
    STATE_2,
    STATE_3,
    STATE_4
};

static int SB_Galleon_anim_callback(Object *self, Object *animObj, AnimObj_Data *animObjData, s8 arg3);
static void SB_Galleon_func_B5C(Object *self, Object *override, AnimObj_Data *arg2);

// offset: 0x0 | ctor
void SB_Galleon_ctor(void *dll) { }

// offset: 0xC | dtor
void SB_Galleon_dtor(void *dll) { }

// offset: 0x18 | func: 0 | export: 0
void SB_Galleon_setup(Object *self, ObjSetup *setup, s32 arg2) {
    SB_Galleon_Data *objdata;

    objdata = self->data;
    obj_add_object_type(self, OBJTYPE_4);
    obj_set_update_priority(self, 90);
    self->animCallback = SB_Galleon_anim_callback;
    objdata->x2 = self->srt.transl.x;
    objdata->y2 = self->srt.transl.y;
    objdata->z2 = self->srt.transl.z;
    objdata->unk2A = 1;
    objdata->unk26 = 240;
    objdata->unk7A = 240;
    objdata->unk80 = 0;
