#include "PR/ultratypes.h"
#include "PR/gbi.h"
#include "PR/gu.h"
#include "dlls/objects/210_player.h"
#include "game/objects/object.h"
#include "game/objects/object_id.h"
#include "sys/asset_thread.h"
#include "sys/camera.h"
#include "sys/dll.h"
#include "sys/gfx/model.h"
#include "sys/main.h"
#include "sys/math.h"
#include "sys/objects.h"
#include "sys/objtype.h"
#include "sys/gfx/gx.h"
#include "dll.h"
#include "types.h"
#include "functions.h"
#include "prevent_bss_reordering.h"

static const char str_1[] = "triggers: unknown trigger object %d.\n";
static const char str_2[] = "TRIGGER: warning Script overflow\n";
static const char str_3[] = "Trigger [%d], Gamplay Vulnerable";
static const char str_4[] = "Trigger [%d], Music Action,       Action Num [%d] Free";
static const char str_5[] = "Trigger [%d], Music Action,       Action Num [%d] Set";
static const char str_6[] = "Trigger [%d], Sound FX,           Action Num [%d],Handle Num [%d]";
static const char str_7[] = "Trigger [%d], Camera,             Action [%d], Camera Num [%d], PassDir [%d]";
static const char str_8[] = "Trigger [%d], Track Sky On";
static const char str_9[] = "Trigger [%d], Track Sky Off";
static const char str_10[] = "Trigger [%d], Track AntiAlias On";
static const char str_11[] = "Trigger [%d], Track AntiAlias Off";
static const char str_12[] = "Trigger [%d], Track SkyObjects On";
static const char str_13[] = "Trigger [%d], Track SkyObjects Off";
static const char str_14[] = "Trigger [%d], Track Dome On";
static const char str_15[] = "Trigger [%d], Track Dome Off";
static const char str_16[] = "Trigger [%d], Track MrSheen On %d";
static const char str_17[] = "Trigger [%d], Track MrSheen Off";
static const char str_18[] = "Trigger [%d], Environment Effect, Action Num [%d], Range [%d]";
static const char str_19[] = "Trigger [%d], Lighting,           Action      [%d], Range [%d], PassDir [%d]";
static const char str_20[] = "Trigger [%d], Anim Sequence,      SequenceID [%d], Activate";
static const char str_21[] = "Trigger [%d], Anim Sequence,      SequenceID [%d], Flag = 1";
static const char str_22[] = "Trigger [%d], Anim Sequence,      SequenceID [%d], Flag = 0";
static const char str_23[] = "Trigger [%d], Trigger,            Local ID   [%d]";
static const char str_24[] = "Storyboard disabled, please remove trigger\n";
static const char str_25[] = "Trigger [%d], LOD Model [%d]";
static const char str_26[] = "Trigger [%d], Setup Point,        Level      [%d], SetupPoint [%d]";
static const char str_27[] = "Trigger [%d], Bits\n";
static const char str_28[] = "Trigger [%d], Object Load\n";
static const char str_29[] = "Trigger [%d], Object Free\n";
static const char str_30[] = "Trigger [%d], Object Toggle\n";
static const char str_31[] = "Trigger [%d], Tex Load\n";
static const char str_32[] = "Trigger [%d], Tex Free\n";
static const char str_33[] = "TRIGGER: warning DLL not loaded\n";
static const char str_34[] = "Script [%d], Subscript [%d]\n";
static const char str_35[] = "Trigger [%d], Object Load\n";
static const char str_36[] = "Trigger [%d], Object Free\n";
static const char str_37[] = "Restart Set [%d]\n";
static const char str_38[] = "Restart Clear [%d]\n";
static const char str_39[] = "Restart Goto [%d]\n";
static const char str_40[] = "killing sidekick\n";
static const char str_41[] = "findobj %i \n";
static const char str_42[] = "Trigger [%d], amSfxWaterFallsSetFlags,   Action [%d], PassDir [%d]";

typedef struct {
    u8 unk0;
    u8 unk1;
    u8 unk2;
    u8 unk3;
} TriggerCreateInfo_18;

typedef struct {
/*00*/ ObjCreateInfo base;
/*18*/ TriggerCreateInfo_18 unk18[8];
/*38*/ s16 unk38;
/*3A*/ u8 unk3A;
/*3B*/ u8 unk3B;
/*3C*/ u8 unk3C;
/*3D*/ u8 unk3D;
/*3E*/ u8 unk3E;
/*3F*/ u8 _unk3F[4];
/*43*/ u8 unk43;
/*44*/ s16 bitstringID;
/*46*/ u16 unk46;
/*48*/ s16 unk48;
/*4A*/ s16 unk4A;
/*4C*/ s16 unk4C;
/*4E*/ s16 unk4E;
} TriggerCreateInfo;

typedef struct DLLInst_TriggerScript DLLInst_TriggerScript;
struct DLLInst_TriggerScript {
  struct {
    unsigned long _pad;
    /*0*/ void (*subscripts[1])(Object*,Object*,s8,s32);
    } *exports;
};

typedef struct {
/*00*/ u8 unk0;
/*01*/ u8 _unk1[3];
/*04*/ f32 unk4;
/*08*/ u8 _unk8[4];
/*0C*/ s32 unkC;
/*10*/ Vec3f unk10;
/*1C*/ f32 unk1C;
/*20*/ Vec3f unk20;
/*2C*/ Vec3f unk2C;
/*38*/ f32 unk38;
/*3C*/ f32 unk3C;
/*40*/ f32 unk40;
/*44*/ f32 unk44;
/*48*/ f32 unk48;
/*4C*/ f32 unk4C;
/*50*/ u8 _unk50[8];
/*58*/ s16 bitstringID;
/*5A*/ s16 bitstringIDList[4];
/*62*/ u8 _unk62[2];
/*64*/ s32 unk64[8];
/*84*/ DLLInst_TriggerScript *dlls[8];
} TriggerState;

static ModelInstance *sPointModel = NULL;
static ModelInstance *sPlaneModel = NULL;

static s16 sPointModelRefCount;
static s16 sPlaneModelRefCount;

/*static*/ void trigger_update_effects(Object *self, Object *param2, s8 param3, s32 param4);
/*static*/ void trigger_func_1754(u8 param1, u8 param2);
/*static*/ void trigger_func_1764(u16 param1);
/*static*/ void trigger_func_17FC(u16 param1);
/*static*/ void trigger_func_1868(u16 param1);
/*static*/ void trigger_func_1920(u16 param1);

static void trigger_point_setup(Object *obj, TriggerCreateInfo *createInfo);
/*static*/ void trigger_test_point(Object *self, Object *param2);

static void trigger_cylinder_setup(Object *obj, TriggerCreateInfo *createInfo);
/*static*/ void trigger_test_cylinder(Object* self, Object* param2);

static void trigger_plane_setup(Object *obj, TriggerCreateInfo *createInfo);
/*static*/ void trigger_test_plane(Object* self, Object* param2);

