#include "PR/ultratypes.h"
#include "PR/gbi.h"
#include "game/objects/object.h"
#include "game/objects/object_id.h"
#include "game/gamebits.h"
#include "sys/asset_thread.h"
#include "sys/camera.h"
#include "sys/dll.h"
#include "sys/objmsg.h"
#include "sys/gfx/model.h"
#include "sys/gfx/gx.h"
#include "sys/gfx/texture.h"
#include "sys/main.h"
#include "sys/math.h"
#include "sys/objects.h"
#include "sys/objtype.h"
#include "dll.h"
#include "dll_def.h"
#include "types.h"
#include "functions.h"
#include "dlls/objects/common/sidekick.h"
#include "dlls/objects/210_player.h"

static const char str_1[] = "triggers: unknown trigger object %d.\n";
static const char str_2[] = "TRIGGER: warning Script overflow\n";
static const char str_3[] = "Trigger [%d], Gamplay Vulnerable";
static const char str_4[] = "Trigger [%d], Music Action,       Action Num [%d] Free";
static const char str_5[] = "Trigger [%d], Music Action,       Action Num [%d] Set";
static const char str_6[] = "Trigger [%d], Sound FX,           Action Num [%d],Handle Num [%d]";
static const char str_7[] = "Trigger [%d], Camera,             Action [%d], Camera Num [%d], PassDir [%d]";
static const char str_8[] = "Trigger [%d], Track Sky On";
static const char str_9[] = "Trigger [%d], Track Sky Off";
static const char str_10[] = "Trigger [%d], Track AntiAlias On";
static const char str_11[] = "Trigger [%d], Track AntiAlias Off";
static const char str_12[] = "Trigger [%d], Track SkyObjects On";
static const char str_13[] = "Trigger [%d], Track SkyObjects Off";
static const char str_14[] = "Trigger [%d], Track Dome On";
static const char str_15[] = "Trigger [%d], Track Dome Off";
static const char str_16[] = "Trigger [%d], Track MrSheen On %d";
static const char str_17[] = "Trigger [%d], Track MrSheen Off";
static const char str_18[] = "Trigger [%d], Environment Effect, Action Num [%d], Range [%d]";
static const char str_19[] = "Trigger [%d], Lighting,           Action      [%d], Range [%d], PassDir [%d]";
static const char str_20[] = "Trigger [%d], Anim Sequence,      SequenceID [%d], Activate";
static const char str_21[] = "Trigger [%d], Anim Sequence,      SequenceID [%d], Flag = 1";
static const char str_22[] = "Trigger [%d], Anim Sequence,      SequenceID [%d], Flag = 0";
static const char str_23[] = "Trigger [%d], Trigger,            Local ID   [%d]";
static const char str_24[] = "Storyboard disabled, please remove trigger\n";
static const char str_25[] = "Trigger [%d], LOD Model [%d]";
static const char str_26[] = "Trigger [%d], Setup Point,        Level      [%d], SetupPoint [%d]";
static const char str_27[] = "Trigger [%d], Bits\n";
static const char str_28[] = "Trigger [%d], Object Load\n";
static const char str_29[] = "Trigger [%d], Object Free\n";
static const char str_30[] = "Trigger [%d], Object Toggle\n";
static const char str_31[] = "Trigger [%d], Tex Load\n";
static const char str_32[] = "Trigger [%d], Tex Free\n";
static const char str_33[] = "TRIGGER: warning DLL not loaded\n";
static const char str_34[] = "Script [%d], Subscript [%d]\n";
static const char str_35[] = "Trigger [%d], Object Load\n";
static const char str_36[] = "Trigger [%d], Object Free\n";
static const char str_37[] = "Restart Set [%d]\n";
static const char str_38[] = "Restart Clear [%d]\n";
static const char str_39[] = "Restart Goto [%d]\n";
static const char str_40[] = "killing sidekick\n";
static const char str_41[] = "findobj %i \n";
static const char str_42[] = "Trigger [%d], amSfxWaterFallsSetFlags,   Action [%d], PassDir [%d]";

typedef struct {
    u8 condition; // TriggerCommandConditionFlags enum
    u8 id;
    // For some commands, param1 and 2 are read as a single u16, but 
    // in code they are read individually and then combined with bit math.
    u8 param1;
    u8 param2;
} TriggerCommand;

typedef struct {
/*00*/ ObjSetup base;
/*18*/ TriggerCommand commands[8];
/*38*/ s16 localID; // TODO: needs verification
/*3A*/ u8 sizeX; // unit depends on trigger type
/*3B*/ u8 sizeY; // unit depends on trigger type
/*3C*/ u8 sizeZ; // unit depends on trigger type
/*3D*/ u8 rotationY; // unit depends on trigger type
/*3E*/ u8 rotationX; // unit depends on trigger type
/*3F*/ u8 _unk3F[4];
/// The object type of the object that can activate the trigger.
/// If multiple instances of the given type exist in the scene, the one
/// closest to the trigger will be used.
/// Exceptions:
/// 0 - Always the primary player (even if multiple player instances exist)
/// 1 - Always the primary sidekick (even if multiple sidekick instances exist)
/// 2 - The camera(?)
/*43*/ u8 activatorObjType;
// Game bit flag to save the entered state of the trigger in.
// This flag will be set the first time the trigger is entered. If the flag is already
// set upon object creation, the entered state of the trigger will be restored, possibly
// running commands on the next update that support being restored.
/*44*/ s16 bitFlagID;
// Number of game ticks from object creation to wait before activating a 
// TriggerTime instance.
/*46*/ u16 timerDuration;
// Game bit flags that must be *all* set before the trigger can activate.
// Only supported by TriggerPlane and TriggerBits (plane only supports one flag to check).
// A negative ID indicates that there is no flag to check for that condition slot. 
/*48*/ s16 conditionBitFlagIDs[4];
} Trigger_Setup;

DLL_INTERFACE(DLL_TriggerScript) {
    /*:*/ DLL_INTERFACE_BASE(DLL);
    // Array length will vary
    void (*subscripts[1])(Object *trigger, Object *activator, s8 dir, s32 activatorDistSquared);
};

typedef struct {
/*00*/ u8 flags; // TriggerFlags enum
/*01*/ u8 _unk1[3];
/*04*/ f32 radiusSquared;
/*08*/ u8 _unk8[4];
/*0C*/ s32 elapsedTicks; // for TriggerTime
/*10*/ Vec3f lookVector; // for TriggerPlane
/*1C*/ f32 lookVectorNegDot;
/*20*/ Vec3f activatorPrevPos;
/*2C*/ Vec3f activatorCurrPos;
/*38*/ Vec3f planeMin;
/*44*/ Vec3f planeMax;
/*50*/ u8 _unk50[8];
/*58*/ s16 bitFlagID;
/*5A*/ s16 conditionBitFlagIDs[4];
/*62*/ u8 _unk62[2];
/*64*/ u32 soundHandles[8];
// Special "script" DLLs where each export is a "subscript".
/*84*/ DLL_TriggerScript *scripts[8];
} Trigger_Data;

typedef enum {
    // Activator entered at least once
    TRG_ACTIVATOR_ENTERED = 0x1,
    // Activator exited at least once
    TRG_ACTIVATOR_EXITED = 0x2,
    TRG_RESTORE_ENTERED_STATE = 0x4,
    TRG_FIRST_TICK = 0x40
} TriggerFlags;

typedef enum {
    // When activator is "inside" the trigger
    CMD_COND_IN = 0x1,
    // When activator is "outside" of the trigger
    CMD_COND_OUT = 0x2,
    // Command can be activated if trigger is entered more than once
    CMD_COND_RE_ENTER = 0x4,
    // Command can be activated if trigger is exited more than once
    CMD_COND_RE_EXIT = 0x8,
    // Command is activated every game tick the in/out conditions are met,
    // and not just on the initial entry/exit tick
    CMD_COND_CONTINUOUS = 0x10,
    // Activate the command when restoring the trigger's entered state
    CMD_COND_RESTORE = 0x20
} TriggerCommandConditionFlags;

typedef enum {
