#ifndef _SYS_GAME_OBJECTS_HITBOX_H
#define _SYS_GAME_OBJECTS_HITBOX_H

#include "sys/math.h"

/** Object hit detection system
 */

typedef struct {
    /*0x00*/ u8 unk_0x0[4];
    /*0x04*/ s16 unk_0x4;
    /*0x06*/ s16 unk_0x6;
    /*0x08*/ s32 unk_0x8;
    /*0x0c*/ f32 unk_0xc;
    /*0x10*/ Vec3f unk_0x10;
    /*0x1c*/ u8 unk_0x1c[0x20 - 0x1c];
    /*0x20*/ Vec3f unk_0x20;
    /*0x2c*/ f32 unk_0x2c;
    /*0x30*/ f32 unk_0x30;
    /*0x34*/ u8 unk_0x34[0x40 - 0x34];
    /*0x40*/ s32 unk_0x40;
    /*0x44*/ s32 unk_0x44;
    /*0x48*/ s32 unk_0x48;
    /*0x4c*/ s32 unk_0x4c;
    /*0x50*/ s16 unk_0x50;
    /*0x52*/ s16 unk_0x52;
    /*0x54*/ s16 unk_0x54;
    /*0x56*/ s16 unk_0x56;
    /*0x58*/ s16 unk_0x58;
    /*0x5a*/ u8 unk_0x5a;
    /*0x5b*/ u8 unk_0x5b;
    /*0x5c*/ u8 unk_0x5c;
    /*0x5d*/ u8 unk_0x5d[0x5f - 0x5d];
    /*0x5f*/ u8 unk_0x5f;
    /*0x60*/ u8 unk_0x60;
    /*0x61*/ u8 unk_0x61;
    /*0x62*/ s8 unk_0x62;
    /*0x63*/ s8 unk_0x63[3];
    /*0x66*/ s8 unk_0x66[3];
    /*0x69*/ u8 unk_0x69[3];
    /*0x6c*/ s32 unk_0x6c[3];
    /*0x78*/ f32 unk_0x78[3];
    /*0x84*/ f32 unk_0x84[3];
    /*0x90*/ f32 unk_0x90[3];
    /*0x9c*/ u8 pad_0x9c[0x9E - 0x9C];
    /*0x9e*/ s8 unk_0x9e;
    /*0x9f*/ s8 unk_0x9f;
    /*0xa0*/ u8 unk_0xa0;
} ObjectHitInfo;

#endif
