#include "common.h"

#define RGBA8(r, g, b, a) (((u32)(r) << 24) | ((u32)(g) << 16) | ((u32)(b) << 8) | (u32)(a))

typedef struct
{
/*0000*/    s16 uls0;
/*0002*/    s16 ult0;
/*0004*/    u8 unk_0x4[0x10 - 0x4];
/*0010*/    s16 uls1;
/*0012*/    s16 ult1;
/*0014*/    u8 unk_0x14[0x22 - 0x14];
} Struct0x22;

typedef struct
{
/*0000*/    Texture *texture;
/*0004*/    u32 unk_0x4;
/*0008*/    u32 flags;
/*000C*/    s16 refCount;
/*000E*/    u8 unk_0x14;
/*000F*/    u8 unk_0x15;
} BlockTexture; // FIXME: better name

typedef struct
{
/*0000*/    Texture *texture;
/*0004*/    u8 unk_0x4[0xc - 0x4];
} Block_0x0Struct;

typedef struct
{
/*0000*/    s16 texIdx;
/*0002*/    u8 unk_0x2;
/*0003*/    u8 unk_0x3;
} Block_0x28Struct;

typedef struct
{
/*0000*/    u32 flags;
/*0004*/    s16 vtxBase;
/*0006*/    s16 triBase;
/*0008*/    u8 unk_0x8[0x12 - 0x8];
/*0012*/    u8 tileIdx0;
/*0013*/    u8 alpha;
/*0014*/    u8 unk_0x14;
/*0015*/    u8 tileIdx1;
/*0016*/    u8 unk_0x16;
/*0017*/    u8 unk_0x17;
} BlockShape;

typedef struct
{
/*0000*/    u32 d0;
/*0004*/    u32 d1;
} EncodedTri;

typedef struct
{
/*0000*/    Block_0x0Struct *tiles;
/*0004*/    Vtx_t *vertices;
/*0008*/    EncodedTri *encodedTris;
/*000C*/    BlockShape *shapes;
/*0010*/    u8 unk_0x10[0x20 - 0x10];
/*0020*/    Vtx_t *vertices2[2];
/*0028*/    void *unk_0x28;
/*002C*/    Gfx *gdlGroups; // In groups of 3 per shape; used to set up materials.
/*0030*/    s16 vtxFlags;
/*0032*/    u8 unk_0x32[0x36 - 0x32];
/*0036*/    s16 shapeCount;
/*0038*/    u8 unk_0x38[0x40 - 0x38];
/*0040*/    s16 elevation;
} Block;

typedef struct
{
/*0000*/    Gfx gfx0;
/*0008*/    Gfx gfx1;
/*0010*/    u32 unk_0x10;
/*0014*/    u32 primColor;
/*0018*/    u32 envColor;
/*001C*/    u32 fogColor;
/*0020*/    u32 fillColor;
/*0024*/    u32 blendColor;
/*0028*/    u8 needsPipeSync;
/*0029*/    u8 dirtyFlags;
} DLBuilder;

typedef struct
{
/*0000*/    u8 unk_0x0;
/*0001*/    u8 v0;
/*0002*/    u8 v1;
/*0003*/    u8 v2;
/*0004*/    u8 unk_0x4[0x10 - 0x4];
} DLTri;

extern u32 UINT_80092a98;
extern DLBuilder *gDLBuilder;

typedef struct
{
/*0000*/    f32 x;
/*0004*/    f32 y;
/*0008*/    f32 z;
/*000C*/    f32 d;
/*0010*/    u8 unk_0x14[4];
} Plane;

extern f32 gWorldX;
extern f32 gWorldZ;
extern Plane gFrustumPlanes[5];
#define MAX_RENDER_LIST_LENGTH 400
extern u32 gRenderList[MAX_RENDER_LIST_LENGTH];
extern s16 gRenderListLength;
#define MAX_BLOCKS 40
extern Block *gBlocks[MAX_BLOCKS];
extern s16 gBlocksIdx;

#pragma GLOBAL_ASM("asm/nonmatchings/map/dl_set_all_dirty.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80040FF8.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80041028.s")

#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80041040.s")
#else
void _func_80041040(Gfx **gdl)
{
    Gfx *currGfx = &gDLBuilder->gfx0;
    u8 dirty;

    if (gDLBuilder->dirtyFlags & 0x1)
    {
        gDLBuilder->dirtyFlags &= ~0x1;
        dirty = TRUE;
    }
    else
    {
        dirty = gDLBuilder->gfx0.words.w0 != (**gdl).words.w0 || gDLBuilder->gfx0.words.w1 != (**gdl).words.w1;
    }

    if (dirty)
    {
        *currGfx = **gdl;

        if (gDLBuilder->needsPipeSync)
        {
