#include "common.h"
#include "sys/map.h"

void dl_set_all_dirty(void) {
    gDLBuilder->dirtyFlags = 0xFF;
    gDLBuilder->needsPipeSync = 1;
}

void func_80040FF8(void) {
    gDLBuilder = &D_800B4A20;
    gDLBuilder->dirtyFlags = 0xFF;
    gDLBuilder->needsPipeSync = 1;
}

void func_80041028(void) {
    gDLBuilder = &D_800B49F0;
}

#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/map/dl_apply_combine.s")
#else
void _dl_apply_combine(Gfx **gdl)
{
    Gfx *currGfx = &gDLBuilder->gfx0;
    u8 dirty;

    if (gDLBuilder->dirtyFlags & 0x1)
    {
        gDLBuilder->dirtyFlags &= ~0x1;
        dirty = TRUE;
    }
    else
    {
        dirty = gDLBuilder->gfx0.words.w0 != (**gdl).words.w0 || gDLBuilder->gfx0.words.w1 != (**gdl).words.w1;
    }

    if (dirty)
    {
        *currGfx = **gdl;

        if (gDLBuilder->needsPipeSync)
        {
            gDLBuilder->needsPipeSync = FALSE;

            gDPPipeSync((*gdl)++);

            **gdl = *currGfx;
        }

        (*gdl)++;
    }
}
#endif

#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/map/dl_apply_other_mode.s")
#else
void _dl_apply_other_mode(Gfx **gdl)
{
    Gfx *currGfx = &gDLBuilder->gfx1;
    u8 dirty;

    if (UINT_80092a98 & 0x2000) {
        (**gdl).words.w1 &= ~0x30;
    }

    if (gDLBuilder->dirtyFlags & 0x2) {
        gDLBuilder->dirtyFlags &= ~0x2;
        dirty = TRUE;
    } else {
        dirty = gDLBuilder->gfx1.words.w0 != (**gdl).words.w0 || gDLBuilder->gfx1.words.w1 != (**gdl).words.w1;
    }

    if (dirty)
    {

    if (var_v0 > 0) {
        //var_a0 = &sp20[0];
        while (cellIndex_2 != var_v0){
            mapID = *var_a0;
            cellIndex_2 += 1;
            temp_v1 = gLoadedMapsDataTable[mapID];
            if (temp_v1 != NULL) {
                object_ptr = (u8*)temp_v1->objectInstanceFile_ptr;
                objects_data_end = (u32)(temp_v1->objectInstancesFileLength + object_ptr);
    
                while (*object_ptr < objects_data_end){ //iterate through objects list
                    obj = (ObjCreateInfo*)object_ptr;
                    if (*object_ptr == arg0) //checking for particular object/offset in the object instance file?
                        return mapID;
                    object_ptr += obj->unk2 << 2; //move to next object in list
                }
                
            }
            var_a0 += 2;
        }
    }
    return -1;
}
#endif

MapHeader* func_80044A10(void) {
    return (MapHeader*)gLoadedMapsDataTable;
}

/** Assign object instance file length and get object instance file from map */
s32 func_80044A20(f32 worldX, f32 worldZ, s32* objectsFileLength) {
    s32 mapID;
    MapHeader *map;

    mapID = map_get_map_id_from_xz_ws(worldX, worldZ);
    if (mapID != -1){
      *objectsFileLength = gLoadedMapsDataTable[mapID]->objectInstancesFileLength;
      return (s32)gLoadedMapsDataTable[mapID]->objectInstanceFile_ptr;
    }
    return 0;
}

/** Assign blockIndex from worldX/Z */
s32 func_80044A7C(s32 worldX, s32 worldZ, s32* blockIndex) {
    s8 *blocksLayer;
    s32 *new_var2;
      
    blocksLayer = gBlockIndices[0];
      
    worldX = floor_f((f32) worldX / BLOCKS_GRID_UNIT);
    worldZ = floor_f((f32) worldZ / BLOCKS_GRID_UNIT);
  
    new_var2 = &gMapCurrentStreamCoordsX;
      
    *blockIndex = blocksLayer[(worldZ - gMapCurrentStreamCoordsZ) * 16 + (worldX - *new_var2)];
    return 1;
}

/** Get Block from visGrid cell */
BlocksModel* func_80044B18(s32 visGridX, s32 visGridZ, s32 mapLayer) { 
    s8 *blocksLayer;
    s8 blockIndex;

    blocksLayer = gBlockIndices[mapLayer];
    
    if (visGridX < 0 || visGridZ < 0 || visGridX >= 0x10 || visGridZ >= 0x10){
        return 0;
    }

    blockIndex = blocksLayer[visGridZ*16 + visGridX];
    
    if (blockIndex < 0 || blockIndex >= gLoadedBlockCount)
        return 0;
    return (BlocksModel*)gLoadedBlocks[blockIndex];
}

/** Get visGrid layer */
s8* func_80044B98(s32 arg0) {
    return gBlockIndices[arg0];
}

/** Get Block from blockIndex */
BlocksModel* func_80044BB0(s32 blockIndex) {
    if (blockIndex < 0 || blockIndex >= gLoadedBlockCount) {
        return 0;
    }
    return gLoadedBlocks[blockIndex];
}

//Camera and frustum related?
#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80044BEC.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_800451A0.s")

void func_8004530C(void) {
    D_800B979E = 0;
    D_800B9794 = 0;
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/some_cell_func.s")

#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80045600.s")
#else
typedef struct {
    /*0x0*/  u8 *data;
    /*0x4*/  s32 byteLength;
    /*0x8*/  s32 bitLength;
    /*0xC*/  s32 capacity;
    /*0x10*/ s32 bitPos;
} BitStream;

s32 bitstream_read(s32, u8);
void bitstream_set_pos(s32, s32, s16, s16);
extern char D_8009A614;
extern s8 *D_800B9700;
extern s16 *D_800B97A0;

s32 func_80045600(s32 arg0, BitStream *stream, s16 arg2, s16 arg3, s16 arg4) {
    s8 bitPosIndex;

    
    bitPosIndex = *(arg2 + (arg3 * 0x10) + &D_800B9700[arg4]);
    
    if (bitPosIndex >= 0) {
        bitstream_set_pos((s32)stream, D_800B97A0[bitPosIndex] + arg0, arg2, arg3);
        return bitstream_read((s32)stream, 1);
    }
    diPrintf(&D_8009A614, arg2, arg3);
    return 0;
}
#endif

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_800456AC.s")

u8 is_sphere_in_frustum(Vec3f *v, f32 radius)
{
    u8 i;

    for (i = 0; i < 5; i++)
    {
        if (gFrustumPlanes[i].x * (v->x - gWorldX) +
            gFrustumPlanes[i].y * v->y +
            gFrustumPlanes[i].z * (v->z - gWorldZ) +
            gFrustumPlanes[i].d +
            radius
            < 0.0f)
        {
            return FALSE;
        }
    }

    return TRUE;
}

#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/map/map_load_streammap.s")
#else
void func_8004BD40(MAPSHeader*, s32, s32, s32); //Unsure of argument types, especially last one
extern s32 *gFile_MAPS_TAB;
extern MAPSHeader *gMapActiveStreamMap;

typedef struct {
/*00*/ u32 header;
/*04*/ u32 blockIDs;
/*08*/ u32 gridA1;
/*0c*/ u32 gridA2;
/*10*/ u32 objCreateInfo;
/*14*/ u32 gridB1;
/*18*/ u32 gridB2;
/*1c*/ u32 end;
} MapTab;

/* 
    arg1 = 0 when I was testing!
*/
MAPSHeader* map_load_streammap(s32 mapID, s32 arg1) {
    s32 new_var;
    s32 map_size;
    s32 temp_a0;
    s32 map_start;
    s32 objectsCount_oneEighth;
    s32 temp_t4;
    s32 temp_t6;
    s32 gridB_size;
    int objectsMallocSize;
    s32 var_v0;
    MapTab *mapTab;
    s8 *temp_t7_2;
    u8 *map;
    void *temp_t3;


    
    mapTab = (MapTab *)(&gFile_MAPS_TAB + (mapID * 7));
    
    map_start = mapTab->header;
    map_size = mapTab->end - map_start;
    queue_load_file_region_to_ptr((void *) gMapReadBuffer, MAPS_BIN, map_start, sizeof(MAPSHeader));
    gMapActiveStreamMap = (MAPSHeader *) gMapReadBuffer;
    
    gridB_size = gMapActiveStreamMap->gridB_sixteenthSize * 16;
    objectsCount_oneEighth = gMapActiveStreamMap->objectInstanceCount >> 3;
    objectsMallocSize = objectsCount_oneEighth + 1;
    map = malloc(((gridB_size << 1) + map_size) + objectsMallocSize, 5, 0);
    
    gMapActiveStreamMap = (MAPSHeader *) map;
    queue_load_file_region_to_ptr((void *) map, MAPS_BIN, map_start, map_size);
    
    temp_a0 = objectsCount_oneEighth + 1;
    temp_t4 = objectsMallocSize & 3;

    //Setting up pointers to the 7 MAPS files (excluding the header) (and EOF)
    gMapActiveStreamMap->blockIDs_ptr = (u32 *) gMapActiveStreamMap + mapTab->blockIDs;
    gMapActiveStreamMap->grid_A1_ptr = (s8 *) gMapActiveStreamMap + mapTab->gridA1;
    gMapActiveStreamMap->grid_A2_ptr = (s8 *) gMapActiveStreamMap + mapTab->gridA2;
    gMapActiveStreamMap->objectInstanceFile_ptr = (s32 *) gMapActiveStreamMap + mapTab->objCreateInfo;
    new_var = temp_t4;
    gMapActiveStreamMap->grid_B1_ptr = (s8 *) gMapActiveStreamMap + mapTab->gridB1;
    gMapActiveStreamMap->grid_B2_ptr = (s8*)(gMapActiveStreamMap->grid_B1_ptr + gridB_size);    
    gMapActiveStreamMap->end_ptr = (s8*)(gMapActiveStreamMap->grid_B2_ptr + gridB_size);

    //Ack, this section needs reworking
    for (var_v0 = 0; var_v0 != temp_a0; var_v0++){
        gMapActiveStreamMap->end_ptr[var_v0] = 0;
    }
    
    gMapActiveStreamMap->originWorldX = 0.0f;
    gMapActiveStreamMap->originWorldZ = 0.0f;
    gMapActiveStreamMap->unk18 = 0;
    gMapActiveStreamMap->unk19 = 0;
    //It ignores the asset's stored length and calculates it instead
    gMapActiveStreamMap->objectInstancesFileLength = (u32)gMapActiveStreamMap->grid_B2_ptr - (u32)gMapActiveStreamMap->objectInstanceFile_ptr;
    gLoadedMapsDataTable[mapID] = gMapActiveStreamMap;
    
    if (arg1 == 0){
        func_80045FC4(gMapActiveStreamMap, (mapID * 0x8C) + (&D_800B5508), mapID, 0);
        gDLL_29_gplay->exports->func_15B8(mapID);
    }
    else{
        func_8004BD40(gMapActiveStreamMap, mapID, mapID, 0);
    }
    return gMapActiveStreamMap;
}

#endif

#pragma GLOBAL_ASM("asm/nonmatchings/map/map_load_streammap_add_to_table.s")

/** Returns one of the loaded maps' mapID (as defined in MAPINFO.bin) */
s32 func_80045D58(void) {
    return D_80092A94;
}

s32 map_find_streammap_index(s32 mapID_to_find) {
    s32 index;
    
    for (index = 0; index < gMapNumStreamMaps; index++){
        if ((gMapStreamMapTable[index].header != NULL) && (mapID_to_find == gMapStreamMapTable[index].mapID)) {
            return index;
        }
    }

    return -1;
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80045DC0.s")

/** free_mapID? */
void func_80045F48(s32 mapID) {
    if (gLoadedMapsDataTable[mapID]){
        func_80045FC4(gLoadedMapsDataTable[mapID], (mapID * 0x8C) + (&D_800B5508), mapID, 1);
        free(gLoadedMapsDataTable[mapID]);
        gLoadedMapsDataTable[mapID] = 0;
    }
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80045FC4.s")

void func_800462B0(){
}

/** Iterates over all the ObjCreateInfo in a map's object instance file, transforming the objects' coordinates from local coordinates to world-space coordinates */
void map_convert_objpositions_to_ws(MapHeader *map, f32 X, f32 Z) {
    u8 *ptr;
    s32 offset;
    ObjCreateInfo *obj;

    if (!map){
        return;
    }
    
    ptr = (u8*)map->objectInstanceFile_ptr;
    offset = 0; // current offset in MAPS object instance file data
    
    while (offset < map->objectInstancesFileLength){
        obj = (ObjCreateInfo*)ptr;
        obj->x += X;
        obj->z += Z;

        offset += obj->quarterSize << 2;
        ptr += obj->quarterSize << 2;
    }
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80046320.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80046428.s")

void func_80046688(s32 arg0, s32 arg1) {
}

GlobalMapCell* func_80046698(s32 gridX, s32 gridZ) {
    GlobalMapCell *layer;    
    s32 cellIndex;
    
    layer = (GlobalMapCell *)&gDecodedGlobalMap[0];
    cellIndex = (gridZ * 16) + gridX;
    
    return &layer[cellIndex];
}

MapHeader* func_800466C0() {
    MapHeader* map;
    GlobalMapCell *layer;
    s32 mapID;

    layer = gDecodedGlobalMap[0];
    mapID = layer[119].mapID; //There should be 16*16 cells, so why this one specifically... centre cell?
    if (mapID < 0) {
        mapID = D_80092BBC;
    }
    if (mapID < 0) {
        return NULL;
    }
    
    map = gLoadedMapsDataTable[mapID];
    if (map != NULL) {
        D_80092BBC = (s32) mapID;
        gMapActiveStreamMap = map;
    }
    return map;
}

extern s16 gNumTRKBLKEntries;
s16 func_80046718() {
    return gNumTRKBLKEntries;
}

/** map_get_mapID_blocks_count? (Calculated by quickly comparing base blockID for this map and next map) */
s32 func_80046728(s32 mapID) {
    if (mapID < 0 || mapID >= gNumTRKBLKEntries)
        return 0;
    return gFile_TRKBLK[mapID + 1] - gFile_TRKBLK[mapID];
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/init_global_map.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/map_read_layout.s")

void map_update_streaming();

void func_80046B58(f32 x, f32 y, f32 z) {
    u32 temp_t8;
    
    temp_t8 = UINT_80092a98;
    if (!(temp_t8 & 2) || temp_t8 & 0x800){
        D_800B97AC = x;
        D_800B97B0 = y;
        D_800B97B4 = z;
        UINT_80092a98 = temp_t8 | 2;
        if (UINT_80092a98 & 0x800){
            map_update_streaming();
        }
    }
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/map_update_streaming.s")

/** Increment something */
void func_80047374(void) {
    D_80092A8C += 1;
    if (D_80092A8C >= 3) {
        D_80092A8C = 2;
    }
    UINT_80092a98 |= 0x4000;
}

/** Decrement something */
void func_800473BC(void) {
    D_80092A8C -= 1;
    if (D_80092A8C < -2) {
        D_80092A8C = -2;
    }
    UINT_80092a98 |= 0x4000;
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80047404.s")

void func_80047710(s32 arg0, s32 arg1, s32 arg2) {
}

void func_80047724(s32 arg0, s32 arg1, s32 arg2, s32 arg3) {
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_8004773C.s")

s32 func_80048024() {
    return D_800B96A8;
}

void func_80048034(void) {
    D_800B96A8 = 0;
    D_800B4A70 = 0;
    D_800B4A72 = 0;
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80048054.s")

/** read_mapinfo_of_map_at_xz */
void func_800483BC(f32 worldX, f32 worldY, f32 worldZ) {
    s32 mapID;
    s32 mapInfoCount;
    MapInfo* mapInfo;

    mapID = map_get_map_id_from_xz_ws(worldX, worldZ);
    mapInfoCount = get_file_size(MAPINFO_BIN) / sizeof(MapInfo);

    if (mapID < 0 || !(mapID < mapInfoCount)) {
        D_800B96A8 = 0;
    } else {
        mapInfo = (MapInfo *)gMapReadBuffer;
        queue_load_file_region_to_ptr((void *) mapInfo, MAPINFO_BIN, mapID * (sizeof(MapInfo)), sizeof(MapInfo));
        D_800B96A8 = mapInfo->type;
    } 
    
    D_800B4A72 = 0;
    
    //Set values if it's a "mobile map" (the Galleon, "wctemplelift", etc)
    if (D_800B96A8 == 1) {
        D_800B4A70 = mapID;
        D_800B4A72 = mapInfo->mobileMapUnknown;
    }
}

s16 func_80048478(s32* arg0) {
    if (arg0) {
        *arg0 = (s32) D_800B4A70;
    }
    return D_800B4A72;
}

s8 func_80048498(void) {
    return D_80092A8C;
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_800484A8.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_800485FC.s")

#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/map/block_load.s")
#else
extern u32 *gFile_BLOCKS_TAB;
extern u8 *gMapReadBuffer;
void block_load(s32 id, s32 param_2, s32 globalMapIdx, u8 queue)
{
    u32 allocSize;
    u32 offset;
    u32 compressedSize;
    u32 uncompressedSize;
    u8 *compressedData;
    Block *block;
    u8 *p;
    s32 n;
    s32 i;

    offset = gFile_BLOCKS_TAB[id];
    compressedSize = gFile_BLOCKS_TAB[id + 1] - offset;
    read_file_region(BLOCKS_BIN, gMapReadBuffer, offset, 0x10);

    uncompressedSize = *(u32*)gMapReadBuffer;
    allocSize = uncompressedSize + hits_get_size(id) + 0x8;
    block = malloc(allocSize, 5, NULL);
    if (block == NULL) {
        return;
    }

    compressedData = (u8*)block + allocSize - compressedSize - 0x10;
    compressedData = (u8*)((s32)compressedData - ((s32)compressedData % 16));
    // if ((s32)compressedData < 0) {
    //     // Align to 16 bytes
    //     u32 align = (u32)compressedData & 0xf;
    //     if (align != 0) {
    //         align -= 16;
    //     }
    //     compressedData -= align;
    // }

    read_file_region(BLOCKS_BIN, compressedData, offset, compressedSize);
    rarezip_uncompress(compressedData + 4, (u8*)block, allocSize);

    // Convert offsets to pointers
    block->vertices = (Vtx_t*)((u32)block->vertices + (u32)block);
    block->encodedTris = (EncodedTri*)((u32)block->encodedTris + (u32)block);
    block->shapes = (BlockShape*)((u32)block->shapes + (u32)block);
    block->unk_0x10 = (void*)((u32)block->unk_0x10 + (u32)block);
    block->tiles = (Block_0x0Struct*)((u32)block->tiles + (u32)block);

    func_8003CD6C(7);

    for (i = 0; i < block->textureCount; i++) {
        block->tiles[i].texture = texture_load(-((s32)block->tiles[i].texture | 0x8000), queue);
    }

    func_8003CD6C(6);

    block_setup_vertices(block);

    block->gdlGroups = (Gfx*)(block->gdlGroupsOffset + (u32)block);
    block_setup_gdl_groups(block);

    p = block->gdlGroups + block->shapeCount * 3;
    func_80048B14(block);

    if (block->vtxFlags & 0x8)
    {
        Vtx_t *vtx = align_8(p);
        Vtx_t *srcvtx = block->vertices;
        BlockShape *shape;

        block->vertices2[0] = vtx;
        block->vertices2[1] = &vtx[block->vtxCount];

        p = vtx + block->vtxCount * 2;

        shape = block->shapes;
        for (i = 0; i < block->vtxCount; i++)
        {
            if (shape->flags & 0x20000000) {
                vtx[i].ob[0] = (f32)srcvtx[i].ob[0];
                vtx[i].ob[1] = (srcvtx[i].ob[1] - block->elevation) * 20.0f;
                vtx[i].ob[2] = (f32)srcvtx[i].ob[2];
            } else {
                vtx[i].ob[0] = srcvtx[i].ob[0];
                vtx[i].ob[1] = srcvtx[i].ob[1];
                vtx[i].ob[2] = srcvtx[i].ob[2];
            }

            vtx[i].cn[0] = srcvtx[i].cn[0];
            vtx[i].cn[1] = srcvtx[i].cn[1];
            vtx[i].cn[2] = srcvtx[i].cn[2];
            vtx[i].cn[3] = srcvtx[i].cn[3];
            vtx[i].tc[0] = srcvtx[i].tc[0];
            vtx[i].tc[1] = srcvtx[i].tc[1];
            vtx[i].flag = srcvtx[i].flag;

            if (i >= shape[1].vtxBase) {
                shape++;
            }
        }

        bcopy(block->vertices2[0], block->vertices2[1], block->vtxCount * sizeof(Vtx_t));
    }
    else
    {
        block->vertices2[0] = block->vertices;
        block->vertices2[1] = block->vertices;
    }

    p = align_4(p);
    block->unk_0x28 = p;

    n = block_setup_textures(block);

    p = align_2(p + n);
    block->xzBitmap = p;
    block_setup_xz_bitmap(block);

    p = align_8(p + block->unk_0x34 * sizeof(s16));
    block_load_hits(block, id, queue, p);

    if (queue) {
        queue_block_emplace(1, block, id, param_2, globalMapIdx);
    } else {
        block_emplace(block, id, param_2, globalMapIdx);
    }
}
#endif

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80048B14.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80048C24.s")

typedef struct {
/*00*/ u8 unk0;
/*01*/ u8 unk1;
/*02*/ u8 unk2;
/*03*/ u8 unk3;
/*04*/ u8 unk4;
/*05*/ u8 unk5;
/*06*/ u8 unk6;
/*07*/ u8 unk7;
/*08*/ u8 unk8;
/*09*/ u8 unk9;
} MapsUnk_800B97C0;

extern MapsUnk_800B97C0 *D_800B97C0;
extern s16 D_800B97C4;

s32 func_80048D58(u8 arg0, u8 arg1, u8 arg2, u8 arg3) {
    MapsUnk_800B97C0 *temp;
    s32 index;
    
    for (index = 0; index < D_800B97C4; index++){
        if ((arg0 == D_800B97C0[index].unk0) && 
            (arg1 == D_800B97C0[index].unk1) && 
            (arg2 == D_800B97C0[index].unk2) && 
            (arg3 == D_800B97C0[index].unk6)){
            return index;
        }
    }
    
    return -1;
}

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80048E04.s")

#pragma GLOBAL_ASM("asm/nonmatchings/map/func_80048F58.s")

void block_emplace(BlocksModel *block, s32 id, s32 param_3, s32 globalMapIdx)
{
    s32 slot;
    s8 *ptr;

    for (slot = 0; slot < gLoadedBlockCount; slot++) {
        if (gLoadedBlockIds[slot] == -1) {
            break;
        }
    }


    if (slot == gLoadedBlockCount) {
        gLoadedBlockCount++;
    }

    ptr = gBlockIndices[globalMapIdx];
