#include "common.h"
#include "sys/rarezip.h"

#define ALIGN8(a) (((u32) (a) & ~0x7) + 0x8)
#define ALIGN16(a) (((u32) (a) & ~0xF) + 0x10)

typedef struct
{
/*0000*/    s32 id;
/*0004*/    Model *model;
} ModelSlot;

typedef struct
{
    // TODO
/*0000*/    u32 unk_0x0;
/*0004*/    u32 unk_0x4;
/*0008*/    u32 unk_0x8;
/*000C*/    u32 unk_0xc;
/*0010*/    u32 unk_0x10;
/*0014*/    u32 unk_0x14;
/*0018*/    u32 unk_0x18;
} ModelStats;

typedef struct
{
/*0000*/    s16 animCount;
/*0002*/    s16 unk_0x2;
/*0004*/    s16 unk_0x4;
/*0006*/    s16 unk_0x6;
/*0008*/    u32 uncompressedSize; // CAUTION: little-endian
} ModelHeader;

extern s16 *SHORT_ARRAY_800b17d0;

void func_8001AF04(ModelInstance *modelInst, s8 param2, s8 param3, f32 param4, s32 param5, u8 param6);

#pragma GLOBAL_ASM("asm/nonmatchings/model/init_models.s")

#pragma GLOBAL_ASM("asm/nonmatchings/model/func_80017D2C.s")

#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/model/model_load_create_instance.s")
#else
#define MAX_LOADED_MODELS 70
extern void *gAuxBuffer;
extern s32 gNumLoadedModels;
extern s32 gNumModelsTabEntries;
extern s32 *gFile_MODELS_TAB;
extern s32 gNumFreeModelSlots;
extern s32 *gFreeModelSlots;
extern ModelSlot *gLoadedModels;
void model_destroy(Model *model);
s32 model_load_anim_remap_table(s32 id, s32 param_2, s32 param_3);
ModelInstance *createModelInstance(Model *model, u32 flags, s32 initial);
u32 modanim_load(Model *model, u32 id, void *modanim);
Texture *texture_load(s32 id);
void func_800186CC(Model *model);
