#include "common.h"
#include "sys/newshadows.h"

static const char str_8009aa70[] = "Sorry Background Block list has been exceeded\n";
static const char str_8009aaa0[] = "1: track/intersect.c: OVERFLOW error\n";
static const char str_8009aac8[] = "2: track/intersect.c: OVERFLOW error\n";
static const char str_8009aaf0[] = "3: track/intersect.c: OVERFLOW error\n";
static const char str_8009ab18[] = "TrackGetHeight()-Overflow!!!\n";
static const char str_8009ab38[] = "trackIntersect: FUNC OVERFLOW %d\n";
static const char str_8009ab5c[] = "intersectModLineBuild point list overflow, %d/%d\n";
static const char str_8009ab90[] = "trackIntersect: FUNC OVERFLOW %d\n";
static const char str_8009abb4[] = "insertPoint array overrun %d/%d\n";
static const char str_8009abd8[] = "NO FREE LAST LINE\n";

typedef struct {
/*00*/ s16 unk0;    
/*02*/ s16 unk2;    
/*04*/ s16 unk4;    
/*06*/ s16 unk6;    
/*08*/ s16 unk8;    
/*0A*/ s16 unkA;    
/*0C*/ s16 unkC;    
/*0E*/ s16 unkE;    
/*10*/ s16 unk10;    
/*12*/ s16 unk12;    
/*14*/ u8 unk14;    
/*15*/ s8 unk15;    
/*16*/ s16 unk16;    
} HitsUnk;

/** HitsLines seem to end up reencoded into this format
  * The point data seems to be missing and index values are introduced,
  * so maybe they're combining coincident points across different lines,
  * and referencing those verts by index?
*/
typedef struct{
/*00*/    s8 heightA;
/*01*/    s8 heightB;
/*02*/    s8 settingsA;
/*03*/    s8 settingsB;  
/*04*/    s16 indexA; 
/*06*/    s16 indexB; 
/*08*/    s16 indexC; 
/*0a*/    s16 indexD;
/*0c*/    s16 animatorID;
/*0e*/    s16 unkE;
} HitsLineReencoded; //0x10

typedef struct {
    s16 unk0;
    u8 _unk2[14];
} D_800BB26C_Struct;

s32 func_80055458(Object*, UnkFunc80051D68Arg3 *, UnkFunc80051D68Arg3 *, f32*, f32 *, s32, s8*, s32);
s32 func_800564C8(UnkFunc80051D68Arg3 *, UnkFunc80051D68Arg3 *, f32 *, s32, s8*, s32);
void func_80058F8C(void);

UnkFunc80051D68Arg3* func_80053B24(UnkFunc80051D68Arg3*, s32, s32, s32, s32, s32, s32, u8);
UnkFunc80051D68Arg3* func_8005471C(UnkFunc80051D68Arg3*, Unk8005341C*, ModelInstance*, f32, f32, f32, f32, f32, f32, u8);
void func_80054DF8(UnkFunc80051D68Arg3*, UnkFunc80051D68Arg3*, u8);

// move to objhits.h
Object **func_80025DD4(s32 *arg0);

// .bss 800bb200-800bb540
Vec3s32 D_800BB200[7];
// extra 0xC bytes?
UnkFunc80051D68Arg3* D_800BB260;
s16 D_800BB264;
Unk8005341C D_800BB268[2]; // unknown size
u8 _bss_800BB288[0x800BB3A8 - 0x800BB288];
u8 D_800BB3A8; // count for D_800BB268
u8 _bss_800BB3A9[0x800BB4D6 - 0x800BB3A9];
s16 D_800BB4D6;
s16 D_800BB4D8;
