#include "common.h"

#define CAMERA_COUNT 12

typedef struct
{
/*0000*/    SRT srt;
/*0018*/    f32 unk_0x18;
/*001C*/    u32 unk_0x1c;
/*0020*/    f32 unk_0x20;
/*0024*/    f32 unk_0x24;
/*0028*/    f32 unk_0x28;
/*002C*/    f32 dty;
/*0030*/    f32 unk_0x30;
/*0034*/    f32 unk_0x34;
/*0038*/    f32 unk_0x38;
/*003C*/    f32 unk_0x3c;
/*0040*/    TActor *actor;
/*0044*/    f32 tx;
/*0048*/    f32 ty;
/*004C*/    f32 tz;
/*0050*/    s16 yaw;
/*0052*/    s16 pitch;
/*0054*/    s16 roll;
/*0056*/    u16 unk_0x56;
/*0058*/    u16 unk_0x58;
/*005A*/    s16 dpitch;
/*005C*/    s8 unk_0x5c;
/*005D*/    s8 unk_0x5d;
} Camera;

typedef union
{
    Mtx m;
    MtxF mf;
} Mtx_MtxF;

typedef struct
{
/*0000*/    Mtx_MtxF *mtx;
/*0004*/    s16 count;
} MatrixSlot;

typedef struct
{
/*0000*/    s32 unk_0x0[8];
/*0020*/    s32 ulx;
/*0024*/    s32 uly;
/*0028*/    s32 lrx;
/*002C*/    s32 lry;
/*0030*/    u32 flags;
} Viewport;

extern SRT gCameraSRT;
extern MtxF gViewMtx;
extern MtxF gViewProjMtx;
extern Mtx *gRSPMtxList;
extern f32 gWorldX;
extern f32 gWorldZ;
extern Mtx *gRSPMatrices[2];
extern MtxF gViewMtx2;
extern Mtx gRSPViewMtx2;
extern Viewport gViewports[2]; // FIXME: how many?
extern Vp gRSPViewports[2]; // FIXME: how many?
extern u32 gCameraGroupSelector;
extern MatrixSlot gMatrixPool[2]; // FIXME: how many?
extern u32 gMatrixCount;
extern Camera gCameras[CAMERA_COUNT];
extern s8 gTriggerUseAlternateCamera;
extern s8 gUseAlternateCamera;
extern s32 gCameraSelector;
extern MtxF gActorMatrices[2]; // FIXME: how many items are there?
extern MtxF gInverseActorMatrices[2]; // FIXME: how many items are there?
extern f32 FLOAT_8008c52c;
extern f32 gFovY;
extern f32 gAspect;
extern f32 gNearPlane;
extern f32 gFarPlane;
extern MtxF gProjectionMtx;
extern Mtx gRSPProjectionMtx;
extern u16 gPerspNorm;

void vec3_transform_no_translate(MtxF *mf, Vec3f *v, Vec3f *ov);
