#include "common.h"
#include "game/objects/object.h"
#include "game/objects/interaction_arrow.h"
#include "sys/dll.h"
#include "sys/memory.h"
#include "sys/menu.h"
#include "sys/voxmap.h"
#include "dlls/engine/2_camcontrol.h"
#include "unktypes.h"
#include "prevent_bss_reordering.h"

/** Related to gametext that appears when holding R? */
static s16 _data_0[] = {
    0xffff, 0x0000, 0x00f9, 0x00fc, 0x0102, 0x0104, 0x0106, 0x0108, 0x00fa, 0x00fd, 0x0103, 0x0105, 0x0107, 0x0109, 0xff00, 0x0000
};

typedef struct {
    s32 unk0;
    s8 unk4;
} Unk_DLL2_Func888; //Used in similar situations as CameraAction, but has different shorter structure (CameraFunc15Unk_unk74 seems related to all this, too!)

typedef enum {
    LockIcon_STATE_Hidden = 0,
    LockIcon_STATE_Vanish = 1,
    LockIcon_STATE_Highlight_Start = 2,
    LockIcon_STATE_Highlighted = 3,
    LockIcon_STATE_Lock_On = 4
} LockIcon_States;

/*0x0*/ static CamControl_Data sCamDataStruct;
/*0x11C*/ static CamControl_Data* sCamData;
/*0x120*/ static CamControl_Module* sCamModules[20]; //Camera module DLLs (camtalk, camclimb, cam1stperson, etc.)
/*0x170*/ static u8 sCamModuleCount;     //Number of slots currently occupied in the `sCamModules` array
/*0x174*/ static CamControl_Module* sActiveModule; //Active module: the camera module DLL currently in use
/*0x178*/ static s32 sActiveID;          //Active module: DLL ID
/*0x17C*/ static s32 sActiveLoadedIndex; //Active module: The loaded index of the camera module DLL currently in use
/*0x180*/ static s32 sNextID;            //Ease (End Module): DLL ID of next module (when switching camera DLLs)
/*0x184*/ static s32 sActiveFree;        //Active module: free setting
/*0x188*/ static s32 sActiveSetupVal;    //Active Module: arg1 for DLL's setup function (TO-DO: figure this out)
/*0x18C*/ static UNK_PTR* sCamAction;    //Often a CameraAction*, but sometimes points to a shorter 8-byte struct? (TO-DO: figure this out)
/*0x190*/ static u8 sEaseSetupNeeded;    //Boolean, starts a new camera ease
/*0x191*/ static s8 sNextSetupVal;       //Ease (End Module): arg1 for next module's setup function
/*0x192*/ static s8 sNextFree;           //Ease (End Module): free setting for next module
/*0x194*/ static s32 sEaseDuration;      //Duration of easing between camera modules, in frames
/*0x198*/ static u8 sEaseFlags;          //Which components to lerp during ease (x/y/z/yaw/pitch/roll)
/*0x19C*/ static s32 sPreviousID;        //Ease (Start Module): DLL ID of previous module
/*0x1A0*/ static s32 sPreviousFree;      //Ease (Start Module): free setting for previous module
/*0x1A4*/ static s32 sPreviousSetupVal;  //Ease (Start Module): arg1 for previous module's setup function
/*0x1A8*/ static f32 sPlayerX;
/*0x1AC*/ static f32 sPlayerY;
/*0x1B0*/ static f32 sPlayerZ;
/*0x1B4*/ static f32 sPlayerGlobalPositionX;
/*0x1B8*/ static f32 sPlayerGlobalPositionY;
/*0x1BC*/ static f32 sPlayerGlobalPositionZ;
/*0x1C0*/ static f32 sFov;
/*0x1C4*/ static s32 _bss_1C4;          //Set to -1 in ctor/dctor, but otherwise unused?
/*0x1C8*/ static s8 _bss_1C8;           //Set to -1 in ctor/dctor, but otherwise unused?
/*0x1C9*/ static s8 sIconRapidTimer;    //LockIcon spins rapidly for this long at start of lock-on, before decelerating to lower speed
/*0x1CA*/ static s8 sIconState;         //State Machine value for OBJ_LockIcon
/*0x1CC*/ static s16 sIconRotateSpeed;  //Rotation of lock-on icon
/*0x1D0*/ static Object* sLockIcon;     //OBJ_LockIcon
/*0x1D4*/ static s16 sLetterboxHeight;  //Controls the letterboxing at the top/bottom of frame

CamControl_Module* CamControl_get_camnormal_module(void);
void CamControl_change_camera_module(s32 dllID, s32 arg1, s32 arg2, s32 size, void* arg4, s32 easeDuration, u8 easeFlags);
CameraAction* CamControl_get_camera_action(s32 index);
static s32 CamControl_get_loaded_module_index(u16 arg0);
static void CamControl_free_module(s32 arg0);
static s32 CamControl_load_module(u16 arg0, s32 arg1);
static void CamControl_update_camera(CamControl_Data* arg0);
static void CamControl_replace_active_module(u16 camDLLID, CameraAction* camAction);
static void CamControl_store_player_coords(Object* arg0);
static void CamControl_restore_player_coords(Object* obj);
static void CamControl_average_player_speed(CamControl_Data* arg0, Object* arg1);
static Object* CamControl_find_highlight_object(CamControl_Data* arg0, Object* arg1);
static void CamControl_create_LockIcon(void);
