#include "PR/ultratypes.h"
#include "game/objects/object.h"
#include "sys/print.h"
#include "sys/objects.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/gfx/gx.h"
#include "sys/camera.h"
#include "sys/menu.h"
#include "sys/objmsg.h"
#include "sys/map.h"
#include "functions.h"

#include "dll.h"
#include "dlls/objects/210_player.h"
#include "segment_334F0.h"

static void dll_210_func_14B70(Object* arg0, u32 arg1);
static void dll_210_func_7260(Object* arg0, PlayerState* arg1);

// These funcs are static funcs but can only be made static once the funcs they are used in are matched
/* static */ void dll_210_func_1D8EC(Object* arg0, PlayerState* arg1, s32 arg2);
/* static */ void dll_210_func_41F4(Object* arg0, PlayerState* arg1);
/* static */ void dll_210_func_9E00(Object* arg0);
/* static */ void dll_210_func_1CEFC(Object* player, s32 arg1);
/* static */ void dll_210_func_363C(Object* arg0, PlayerState* arg1, Gfx** arg2, Mtx** arg3, Vertex** arg4);
/* static */ void dll_210_func_3B40(Object* arg0, Gfx** arg1, Mtx** arg2, Vertex** arg3, Triangle** arg4);
/* static */ void dll_210_func_1BC0(Object* arg0, PlayerState* arg1);
/* static */ void dll_210_func_1DB6C(Object* arg0, f32 arg1);
/* static */ f32 dll_210_func_63F0(PlayerState* arg0, f32 arg1);
/* static */ void dll_210_func_9F1C(Object* arg0, s32 arg1);
/* static */ void dll_210_func_60A8(Object* arg0, UNK_TYPE_32 arg1, UNK_TYPE_32 arg2);
/* static */ void dll_210_func_1DE64(s32 arg0);

    0x04150415
};
/*0x5A0*/ static u32 _data_5A0[] = {
    0x002d002e, 0x00380039, 0x002f0030, 0x00310032
};
/*0x5B0*/ static u32 _data_5B0[] = {
    0x00250029, 0x00330034
};
/*0x5B8*/ static u32 _data_5B8[] = {
    0x003a003e
};
/*0x5BC*/ static u32 _data_5BC[] = {
    0x006e00b6, 0x00ba00b8, 0x006f00b7, 0x00b900b5, 0x00bb0068, 0x006c006a, 0x00bc006b, 0x006d0069
};
/*0x5DC*/ static u32 _data_5DC[] = {
    0x00660071
};
/*0x5E0*/ static u32 _data_5E0[] = {
    0x00720403
};
/*0x5E4*/ static u32 _data_5E4[] = {
    0x04040070
};
/*0x5E8*/ static u32 _data_5E8[] = {
    0x00bd0000, 0x007700e4, 0x007500e3, 0x00d100e6, 0x00cc00e5, 0x00770075, 0x0078007e, 0x0076007d, 
    0x007b007c, 0x0079007a, 0x007f0080, 0x00840085, 0x00810082, 0x00860087, 0x0083007f, 0x008000e4, 
    0x00e30000, 0x00d100cc, 0x00d200d3, 0x00cd00ce, 0x00d800d9, 0x00d600d7, 0x00da00db, 0x00df00e0, 
    0x00dc00dd, 0x00e100e2, 0x00de00da, 0x00db00e6, 0x00e500d4, 0x00d40000, 0x3f800000, 0x3f800000, 
    0x3f800000, 0x3f800000, 0x3f800000, 0x3f800000, 0x3f800000, 0x3f800000, 0x3f800000, 0x3f800000, 
    0x3f800000, 0x40400000, 0x3f800000, 0x40400000, 0xbf800000
};
/*0x69C*/ static u32 _data_69C[] = {
    0x000e0010, 0x005c0047, 0x00140015, 0x0021005c, 0x005d0000
};
/*0x6B0*/ static u32 _data_6B0[] = {
    0x005a005b, 0x005a005b, 0x005c005d, 0x00140014
};
/*0x6C0*/ static u32 _data_6C0[] = {
    0x005a005b, 0x00140014
};
/*0x6C8*/ static u32 _data_6C8[] = {
    0x005a005b, 0x001c001d
};
/*0x6D0*/ static u32 _data_6D0[] = {
    0x00250026, 0x00270028, 0x0029002a, 0x002b002c
};
/*0x6E0*/ static u32 _data_6E0[] = {
    0x003a003b, 0x003c003d, 0x003e003f, 0x00400041
};
/*0x6F0*/ static u32 _data_6F0[] = {
    0x00660067
};
/*0x6F4*/ static u32 _data_6F4[] = {
    0x00ed00ee
};
/*0x6F8*/ static f32 _data_6F8 = {
    0.005
};
/*0x6FC*/ static u32 _data_6FC[] = {
    0x3d4ccccd, 0x3cf5c28f, 0x3f0a3d71, 0x3f051eb8, 0x3f70a3d7, 0x3f6b851f, 0x3fa8f5c3, 0x3fa66666, 
    0x3fd33333, 0x3ba3d70a
};
/*0x724*/ static u32 _data_724[] = {
    0x3d4ccccd
};
/*0x728*/ static u32 _data_728[] = {
    0x3cf5c28f, 0x3f0a3d71, 0x3f051eb8, 0x3f70a3d7, 0x3f6b851f, 0x3fa8f5c3, 0x3fa66666, 0x3fd33333
};
/*0x748*/ static u32 _data_748[] = {
    0x3ba3d70a, 0x3d4ccccd, 0x3cf5c28f, 0x3f0ccccd, 0x3f07ae14, 0x3fd33333
};
/*0x760*/ static u32 _data_760[] = {
    0x3ba3d70a, 0x3d4ccccd, 0x3cf5c28f, 0x3f0ccccd, 0x3f07ae14, 0x3fd33333
};
/*0x778*/ static u32 _data_778[] = {
    0x00000166, 0x00000167, 0x00000256, 0x0000036e, 0x0000037f, 0x00000380, 0x00000381, 0x00000543, 
    0x00000544, 0x00000545, 0x00000546, 0x0000012e, 0x00000169, 0x000001d0, 0x000001d6, 0x000001ed, 
    0x000001fd
};
/*0x7BC*/ static s8 _data_7BC = 0;
/*0x7C0*/ static DLL_Unknown *_data_7C0 = NULL;
/*0x7C4*/ static s16 _data_7C4[2] = { 0, 0 };
/*0x7C8*/ static u8 _data_7C8[] = { 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0xFF, 0x00, 0x00, 0x00 };
/*0x7D4*/ static u8 _data_7D4[] = { 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x08, 0x00, 0x00, 0x00 };

/*0x0*/ static u8 _bss_0[0x2];
/*0x2*/ static u8 _bss_2[0x2];
/*0x4*/ static u8 _bss_4[0x4];
/*0x8*/ static u8 _bss_8[0x8];
/*0x10*/ static u8 _bss_10[0x4];
/*0x14*/ static u8 _bss_14[0x4];
/*0x18*/ static u8 _bss_18[0x4];
/*0x1C*/ static u8 _bss_1C[0x4];
/*0x20*/ static f32 _bss_20;
/*0x24*/ static f32 _bss_24;
/*0x28*/ static f32 _bss_28;
/*0x2C*/ static f32 _bss_2C;
/*0x30*/ static f32 _bss_30;
/*0x34*/ static u8 _bss_34[0x4];
/*0x38*/ static u8 _bss_38[0x4];
/*0x3C*/ static f32 _bss_3C;
/*0x40*/ static u8 _bss_40[0xc]; // srt *?
/*0x4C*/ static f32 _bss_4C; // obj x
/*0x50*/ static f32 _bss_50; // obj y
/*0x54*/ static f32 _bss_54; // obj z
/*0x58*/ static u8 _bss_58[0x8];
/*0x60*/ static u8 _bss_60[0x13c];
/*0x19C*/ static u8 _bss_19C[0x4];
/*0x1A0*/ static u8 _bss_1A0[0x4];
/*0x1A4*/ static u8 _bss_1A4[0x4];
/*0x1A8*/ static u8 _bss_1A8[0x2];
/*0x1AA*/ static u8 _bss_1AA[0x2];
/*0x1AC*/ static f32 _bss_1AC;
/*0x1B0*/ static u8 _bss_1B0[0x4];
/*0x1B4*/ static u8 _bss_1B4[0x4];
/*0x1B8*/ static u8 _bss_1B8[0x4];
/*0x1BC*/ static u8 _bss_1BC[0x4];
/*0x1C0*/ static u8 _bss_1C0[0x8];
/*0x1C8*/ static u8 _bss_1C8[0x8];
/*0x1D0*/ static u8 _bss_1D0[0xc];
/*0x1DC*/ static u8 _bss_1DC[0x4];
/*0x1E0*/ static u8 _bss_1E0[0x18];
/*0x1F8*/ static u8 _bss_1F8[0x8];
/*0x200*/ static s16 _bss_200;
/*0x202*/ static u8 _bss_202[0x2];
/*0x204*/ static u8 _bss_204[0x4];
/*0x208*/ static u8 _bss_208[0x4];
/*0x20C*/ static u8 _bss_20C[0x4];
/*0x210*/ static Object *_bss_210[4];
/*0x220*/ static s16 _bss_220[2];
/*0x224*/ static s32 _bss_224[1];
/*0x228*/ static u8 _bss_228[0x8];

// offset: 0x0 | func: 0
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_func_0.s")

// offset: 0x3F8 | ctor
#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_ctor.s")
#else
static void dll_210_func_0();

void dll_210_ctor(s32 arg0) {
    dll_210_func_0();
}
#endif

// offset: 0x438 | dtor
void dll_210_dtor(s32 arg0) {
}

// offset: 0x444 | func: 1 | export: 0
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_func_444.s")

// offset: 0x934 | func: 2 | export: 1
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_func_934.s")

// offset: 0x11A0 | func: 3
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_func_11A0.s")

// offset: 0x1BC0 | func: 4
void dll_210_func_1BC0(Object* arg0, PlayerState* arg1) {
    Object* linkedObj;

    arg0->unk0xb0 &= ~3;
    if (arg1->unk8A8 == 2) {
        arg0->unk0xb0 |= 3;
    } else if (arg1->unk8A8 == 0) {
