#include "PR/ultratypes.h"
#include "PR/gbi.h"
#include "PR/os.h"
#include "game/objects/object.h"
#include "game/objects/object_id.h"
#include "game/objects/unknown_setups.h"
#include "game/gamebits.h"
#include "sys/gfx/model.h"
#include "sys/gfx/animation.h"
#include "sys/joypad.h"
#include "sys/objects.h"
#include "sys/print.h"
#include "sys/objanim.h"
#include "sys/objhits.h"
#include "sys/objtype.h"
#include "sys/objmsg.h"
#include "sys/gfx/gx.h"
#include "sys/rand.h"
#include "sys/camera.h"
#include "sys/main.h"
#include "sys/menu.h"
#include "sys/math.h"
#include "sys/map.h"
#include "sys/gfx/map.h"
#include "sys/dll.h"
#include "sys/memory.h"
#include "sys/joypad.h"
#include "sys/newshadows.h"
#include "functions.h"
#include "dll.h"
#include "types.h"
#include "dlls/objects/210_player.h"
#include "dlls/objects/214_animobj.h"
#include "dlls/objects/277_iceblast.h"
#include "dlls/objects/338_LFXEmitter.h"
#include "dlls/objects/793_BWLog.h"
#include "dlls/engine/6_amsfx.h"
#include "dlls/engine/18_objfsa.h"
#include "dlls/engine/27.h"
#include "dlls/modgfx/106.h"
#include "unktypes.h"
#include "segment_334F0.h"

static void dll_210_func_1BC0(Object* arg0, Player_Data* arg1);
static void dll_210_func_618C(Object* arg0, Player_Data* arg1, s32 arg2, f32 arg3);
static void dll_210_func_7260(Object* arg0, Player_Data* arg1);
static s32 dll_210_func_7300(Object* arg0, Player_Data* arg1, Func_80059C40_Struct* arg2, Player_Data490* arg3, Vec3f* arg4, f32 arg5);

/*0x5A0*/ static s16 _data_5A0[] = { 0x002d, 0x002e, 0x0038, 0x0039, 0x002f, 0x0030, 0x0031, 0x0032 };
/*0x5B0*/ static s16 _data_5B0[] = { 0x0025, 0x0029, 0x0033, 0x0034 };
/*0x5B8*/ static s16 _data_5B8[] = { 0x003a, 0x003e };
/*0x5BC*/ static s16 _data_5BC[] = {
    0x006e, 0x00b6, 0x00ba, 0x00b8, 0x006f, 0x00b7, 0x00b9, 0x00b5,
    0x00bb, 0x0068, 0x006c, 0x006a, 0x00bc, 0x006b, 0x006d, 0x0069
};
/*0x5DC*/ static s16 _data_5DC[] = { 0x0066, 0x0071 };
/*0x5E0*/ static s16 _data_5E0[] = { 0x0072, 0x0403 };
/*0x5E4*/ static s16 _data_5E4[] = { 0x0404, 0x0070 };
/*0x5E8*/ static s16 _data_5E8[] = {
    0x00bd, 0x0000, 0x0077, 0x00e4, 0x0075, 0x00e3, 0x00d1, 0x00e6, 0x00cc, 0x00e5, 0x0077, 0x0075, 0x0078, 0x007e, 0x0076, 0x007d,
    0x007b, 0x007c, 0x0079, 0x007a, 0x007f, 0x0080, 0x0084, 0x0085, 0x0081, 0x0082, 0x0086, 0x0087, 0x0083, 0x007f, 0x0080, 0x00e4,
    0x00e3, 0x0000, 0x00d1, 0x00cc, 0x00d2, 0x00d3, 0x00cd, 0x00ce, 0x00d8, 0x00d9, 0x00d6, 0x00d7, 0x00da, 0x00db, 0x00df, 0x00e0,
    0x00dc, 0x00dd, 0x00e1, 0x00e2, 0x00de, 0x00da, 0x00db, 0x00e6, 0x00e5, 0x00d4, 0x00d4, 0x0000, 0x3f80, 0x0000, 0x3f80, 0x0000,
    0x3f80, 0x0000, 0x3f80, 0x0000, 0x3f80, 0x0000, 0x3f80, 0x0000, 0x3f80, 0x0000, 0x3f80, 0x0000, 0x3f80, 0x0000, 0x3f80, 0x0000,
    0x3f80, 0x0000, 0x4040, 0x0000, 0x3f80, 0x0000, 0x4040, 0x0000, 0xbf80, 0x0000
};
/*0x69C*/ static s16 _data_69C[] = { 0x0e, 0x10, 0x5c, 0x47, 0x14, 0x15, 0x21, 0x5c, 0x5d, 0x00 };
/*0x6B0*/ static s16 _data_6B0[] = { 0x5a, 0x5b, 0x5a, 0x5b, 0x5c, 0x5d, 0x14, 0x14 };
/*0x6C0*/ static s16 _data_6C0[] = { 0x5a, 0x5b, 0x14, 0x14 };
/*0x6C8*/ static s16 _data_6C8[] = { 0x5a, 0x5b, 0x1c, 0x1d };
/*0x6D0*/ static s16 _data_6D0[] = { 0x0025, 0x0026, 0x0027, 0x0028, 0x0029, 0x002a, 0x002b, 0x002c };
/*0x6E0*/ static s16 _data_6E0[] = { 0x003a, 0x003b, 0x003c, 0x003d, 0x003e, 0x003f, 0x0040, 0x0041 };
/*0x6F0*/ static s16 _data_6F0[] = { 0x0066, 0x0067 };
/*0x6F4*/ static s16 _data_6F4[] = { 0x00ed, 0x00ee };
/*0x6F8*/ static f32 _data_6F8 = { 0.005 };
/*0x6FC*/ static f32 _data_6FC[] = { 0.05f, 0.03f, 0.54f, 0.52f, 0.94f, 0.92f, 1.32, 1.3f, 1.65f, 0.005f };
/*0x724*/ static f32 _data_724[] = { 0.05f };
/*0x728*/ static f32 _data_728[] = { 0.03f, 0.54f, 0.52f, 0.94f, 0.92f, 1.32, 1.3f, 1.65f };
/*0x748*/ static f32 _data_748[] = { 0.005f, 0.05f, 0.03f, 0.55f, 0.53f, 1.65f };
/*0x760*/ static f32 _data_760[] = { 0.005f, 0.05f, 0.03f, 0.55f, 0.53f, 1.65f };
/*0x778*/ static u32 _data_778[] = {
    0x00000166, 0x00000167, 0x00000256, 0x0000036e, 0x0000037f, 0x00000380, 0x00000381, 0x00000543, 
    0x00000544, 0x00000545, 0x00000546, 0x0000012e, 0x00000169, 0x000001d0, 0x000001d6, 0x000001ed, 
    0x000001fd
};
/*0x7BC*/ static s8 _data_7BC = 0;
/*0x7C0*/ static DLL_Unknown *_data_7C0 = NULL;
/*0x7C4*/ static s16 _data_7C4[2] = { 0, 0 };
/*0x7C8*/ static u8 _data_7C8[] = { 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0xFF, 0x00, 0x00, 0x00 };
/*0x7D4*/ static u8 _data_7D4[] = { 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x08, 0x00, 0x00, 0x00 };

/*0x0*/ static u8 _bss_0[0x2];
/*0x2*/ static u8 _bss_2[0x2];
/*0x4*/ static f32 _bss_4[1];
/*0x8*/ static f32 _bss_8[2];
/*0x10*/ static u8 _bss_10[0x4];
/*0x14*/ static u8 _bss_14[0x4];
/*0x18*/ static u8 _bss_18[0x4];
/*0x1C*/ static u8 _bss_1C[0x4];
/*0x20*/ static f32 _bss_20;
/*0x24*/ static f32 _bss_24;
/*0x28*/ static f32 _bss_28;
/*0x2C*/ static f32 _bss_2C;
/*0x30*/ static f32 _bss_30;
/*0x34*/ static u8 _bss_34[0x4];
/*0x38*/ static f32 _bss_38;
/*0x3C*/ static f32 _bss_3C;
/*0x40*/ static u8 _bss_40[0xc]; // srt *?
/*0x4C*/ static f32 _bss_4C; // obj x
/*0x50*/ static f32 _bss_50; // obj y
/*0x54*/ static f32 _bss_54; // obj z
/*0x58*/ static ObjFSA_StateCallback _bss_58[81];
/*0x19C*/ static ObjFSA_StateCallback _bss_19C[1];
/*0x1A0*/ static s16 _bss_1A0[2];
/*0x1A4*/ static s32 _bss_1A4;
/*0x1A8*/ static s16 _bss_1A8;
/*0x1AA*/ static u8 _bss_1AA[0x2];
/*0x1AC*/ static f32 _bss_1AC;
/*0x1B0*/ static f32 _bss_1B0[0x4];
/*0x1C0*/ static u8 _bss_1C0[0x8];
/*0x1C8*/ static f32 _bss_1C8[2];
/*0x1D0*/ static u8 _bss_1D0[0xc];
/*0x1DC*/ static f32 _bss_1DC;
/*0x1E0*/ static u8 _bss_1E0[0x18];
/*0x1F8*/ static f32 _bss_1F8[2];
/*0x200*/ static s16 _bss_200;
/*0x202*/ static s16 _bss_202;
/*0x204*/ static f32 _bss_204;
/*0x208*/ static f32 _bss_208;
/*0x20C*/ static Camera *_bss_20C;
/*0x210*/ static Object *_bss_210[4];
/*0x220*/ static s16 _bss_220[2];
typedef void (*Bss244)(Object*, Player_Data*, f32);
/*0x224*/ static Bss244 _bss_224[1];
/*0x228*/ static u8 _bss_228[0x8];

// offset: 0x0 | func: 0
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_func_0.s")

// offset: 0x3F8 | ctor
#if 1
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_ctor.s")
#else
static void dll_210_func_0();

void dll_210_ctor(void *dll) {
    dll_210_func_0();
}
#endif

// offset: 0x438 | dtor
void dll_210_dtor(void *dll) { }

// offset: 0x444 | func: 1 | export: 0
#ifndef NON_MATCHING
#pragma GLOBAL_ASM("asm/nonmatchings/dlls/objects/210_player/dll_210_setup.s")
#else
// matches but requires these as static:
// dll_210_func_4910
// dll_210_func_692C (matched)
// dll_210_func_64B4 (matched)
// dll_210_func_A058 ("matched")
void dll_210_setup(Object* arg0, u32 arg1) {
    s32 i;
    Player_Data* data;

    data = arg0->data;
    obj_add_object_type(arg0, 0);
    obj_add_object_type(arg0, 0x27);
    obj_set_update_priority(arg0, 0x3C);
    obj_init_mesg_queue(arg0, 0x14U);
    arg0->setup = NULL;
